<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v20">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    만물트럭을 타고 전 세계를 다니는 전설의 월클 장사꾼 '세일러맨'
                </p>
                <p class="main-character-text2">
                    "만물트럭을 타고 전세계를 돌아다니는 글로벌장사꾼!"
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">26세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">175cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#덩치에맞지않는큐티함</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">팔씨름</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">만물트럭에서 나오는 신비한 물건</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 세일러맨 이야기</h3>
            [세일러맨]<br/>
            ‘나 박광식 한다면 하는 남자다.’<br/>
            거울 속의 날 보며 고개를 두어 번 끄덕이곤 ‘완판’ 이란 빨간 글씨가 적힌 흰 천을 머리에 둘렀다. 그렇게 결의를 다지며 나온지 5시간 째.<br/>
            가판대에 진열해둔 물건은 팔릴 기미가 없었다.<br/>
            상자를 꾹꾹 눌러 만든 초 강화 딱지, 하얀 조약돌로 만든 공기놀이 세트, 손수 그린 다트 판...<br/>
            고심하며 선별한 물건들을 5일장에 가지고 왔건만, 지나가는 사람들은 나에게 눈길조차 주지 않았다.<br/>
            “한 번 둘러보고 가세요! 아이들이 좋아할 장난감도 많습니다아!” 목청이 터져라 외쳐도 마찬가지였다.<br/>
            “어이 학생, 좀 조용히 해. 하루 종일 네 목소리 듣느라 귀가 먹먹해!” 옆집 생선장수 아저씨가 역정을 내며 말했다.<br/>
            쳇 자기는 가만히 있어도 손님이 넘쳐나니까 그러지.<br/>
            나는 입술을 삐쭉 내밀었지만 그의 손에 들린 네모난 중식 칼을 보고 빠르게 입술을 집어넣었 다.<br/>
            “이눔 자식이 지금이 몇 신데 이제 들어와!”<br/>
            늦게까지 시장에서 자리를 지키다 들어온 내게 할머니는 불호령을 내렸다.<br/>
            “내 오늘 5일장 간다고 말했다이가!”<br/>
            나도 질세라 열일곱 사춘기의 사자후를 보여주려 했건만... 짜악,<br/>
            할머니의 매콤한 등짝 스메싱이 조금 더 빨랐다.<br/>
            “학생이 공부를 해여지 뭘 물건을 팔러다녀!”<br/>
            할머니의 손이 또 다시 올라가는 걸 본 나는 재빠르게 방으로 달려가 숨었다. “할머니는 암 것도 모름서”<br/>
            <br/>
            꿍얼거리며 방에서 짐을 풀다 책상 위에 놓여있는 하얀 편지봉투를 발견하곤 내 입 꼬리는 주 체 할 수 없이 올라갔다,<br/>
            서울에 사는 펜팔 친구 경현이었다.<br/>
            이번 편지 또한 흥미로운 이야기 거리가 한가득 담겨있었다. 그 중 가장 눈에 띈 건 요즘 서 울에서 인기 있는 물건에 관한 글이었다.<br/>
            내 친구들은 요즘 다마고치에 푹 빠져있어. 다마고치는 작은 기계 안에 가상 애완동물을 키우 는 게임이야. 신경을 꽤나 써 줘야 한단다. 다음에 기회가 된다면 편지와 함께 넣어 보낼게.<br/>
            “다마고치...?!”<br/>
            게임기 안에 들어있는 애완동물이라니...! 서울은 정말 없는 게 없는 곳이 구나.<br/>
            나는 몇 번이고 감탄 할 수밖에 없었다.<br/>
            난 불을 끄고 침대 속으로 들어가 천장을 가만히 바라봤다. 얼마 전 경현이 보내준 야광별 스 티커가 천장에서 빛나고 있었다.<br/>
            “서울에 가믄 별별 희한한 게 넘쳐 나겠지...”<br/>
            난 천장의 별을 이으며 달콤한 환상에 젖어들었다. 서울 한복판의 세련된 백화점에서 커다란 가판대를 늘어놓고 상품을 홍보하고 있는 내가 서있다. 딱 떨어지는 양복에 머리는 기름을 발 라 가르마를 타고...<br/>
            “그래 낸 서울로 간다!”<br/>
            나는 자리에서 벌떡 일어나 외쳤다.<br/>
            짤그랑,<br/>
            포부 좋게 외치긴 했으나, 자금은 빨간 저금통 속 동전 몇 닢이 전부였다.<br/>
            ‘이걸론 버스비도 못하겄네.’<br/>
            맥이 쭉 빠졌다. 하지만 한번 뱉은 말을 무를 수 는 없는 법, 깊은 밤 마당을 빙빙 돌며 자금 을 모을 방법을 고민했다.<br/>
            이른 아침부터 난 분주하게 움직였다. 어제 밤 고안해낸 아이디어를 실행하기 위해서였다. 마당 한 구석의 창고에서 먼지를 뒤집어쓴 낡은 수레하나를 꺼내왔다. 오래 돼 보이던 수레는 쓸고 닦으니 금세 새것처럼 보였다. 수레에 그 동안 모아온 상품들을 잘 담고 마지막으로 마 당에서 날보고 꼬리치던 똘복을 수레에 묶었다.<br/>
            이로서 모든 준비는 끝났다.<br/>
            컨튜리 마켓 출격이다!<br/>
            컨튜리 마켓은 어젯밤동안 머리를 싸매다 떠올린 새로운 사업 아이템이었다. 5일장의 주 고객 층은 내 상품을 원치 않는다. 그렇다면 생각을 바꿔, 물건을 파는 일이 아닌 전달하는 일로 돈을 벌면 어떨까? 더불어 자잘한 심부름도 하고. 이건 그야말로 획기적인 아이디어였다.<br/>
            <br/>
            “자자 움직이는 신개념 마켓! 컨튜리 마켓입니다! 심부름! 배달! 기타 등등 불러만 주세요!”<br/>
            수레를 끌고 마을 이곳저곳을 돌아다녔지만 반응은 썩 좋지 못했다. 3시간 동안 한 일이라곤 아랫집 할머니 외양간의 소들에게 여물을 퍼다 준 것이었다. 그마저도...<br/>
            “니 윗집 할매 손주 맞제, 고생 했으니까 떡 좀 싸주께”<br/>
            현찰이 아닌 따끈한 떡으로 수고비를 받았다.<br/>
            “이게 아닌데...”<br/>
            수레를 끄는 똘복과 함께 시장을 지날 때였다. 의기소침해진 나를 거친 목소리가 불러 세웠 다.<br/>
            “니 어제 오일장 나온 꼬맹이 맞제”<br/>
            무시하는 말투에 난 고개를 휙 돌려 그를 노려봤다. 한 달에 두어 번, 장날에 와서 품바를 하 는 아저씨였다. 이 동네에서 꽤나 인기 있었고, 재치 있는 입담으로 장사수완도 좋은 사람이 었다.<br/>
            “허허 이거, 새파랗게 어린놈이 장사를 한다꼬,”<br/>
            그는 물고 있던 담배를 비벼 끄곤 내게 성큼 다가왔다. 나보다 키가 조금 작은 그는 내 머리 부터 발끝까지 촘촘히 훑어봤다. 그의 예리한 시선에 나는 괜히 긴장돼 침을 꿀꺽 삼켰다. 그는 눈을 가늘게 뜨고 내게 말했다.<br/>
            “니는 장사의 기본이 안돼있다.” “네?!”<br/>
            그의 무게있는 한 마디에 난 놀라 큰소리로 답했다. 그리곤 애원하듯 그에게 물었다.<br/>
            “장사의 기본이 뭡니까! 알려주이소!” “장사는...기선제압이다.”<br/>
            기...선제압? 나는 그의 말을 이해할 수 없었기에 그가 설명을 이어가기를 가만히 기다렸다.<br/>
            “나 좀봐라, 누구든 지나가다 한번은 뒤돌아볼 인상이잖냐. 장사는 먼저 손님의 시선을 얻어 야 하는 거라고. 넌 너무 약해”<br/>
            일리 있는 말이었다. 새빨갛게 칠한 코, 볼에 찍은 까만 주근깨, 한쪽 다리를 걷어 올린 흰 한<br/>
            <br/>
            복. 그의 모습은 누구라도 한번쯤을 쳐다볼 모습이었다.<br/>
            난 큰 배움을 얻은 것에 감사해 고개를 숙여 인사를 전하고 얼른 집으로 돌아왔다.<br/>
            “이정도면 되려나.”<br/>
            난 몸을 이리저리 움직여 할머니 방의 장 거울에 내 모습을 비춰봤다.<br/>
            할머니 장롱을 뒤져 찾아낸 꽃무늬 바지에 여우털이 달린 조끼, 진하게 칠한 눈썹과 희고 뽀 얀 얼굴, 이정도면 충분히 장사꾼의 기본을 갖춘 것 같았다.<br/>
            만족스러운 얼굴로 씨익, 웃고 있을 때였다.<br/>
            “이 망할 도둑새끼가!”<br/>
            익숙한 호령과 함께 웬 쇳덩이가 내 머리를 내리쳤다. “어매...도둑새끼가 아니라 손주새끼였네...”<br/>
            흐릿해지는 할머니의 놀란 얼굴을 마지막으로 난 기절해버렸다.<br/>
            메아리 소리가 들려오는~ ... 여행을 떠나요~<br/>
            옆에서 들리는 경쾌한 음악소리, 그리고 기분 좋은 자동차의 덜컹거림.<br/>
            어릴 때 아버지의 트럭에 앉아 졸던 때가 떠올라 슬며시 웃으며 눈을 떴을 때,<br/>
            난 꽥 하고 비명을 내지를 수밖에 없었다.<br/>
            17살, 아직 운전면허도 없는데 내 손이 능숙하게 운전대를 잡고 있는 게 아닌가. 긴장감에 몸 이 굳었다. 흘깃거리며 주변을 살펴보니 난 짐을 한가득 실은 트럭을 몰고 허허벌판 같은 도 로를 달리고 있는 중이었다. 도대체 이게 어떻게 된 상황인지 고민해 보기도 전에 난 또 다시 비명을 내지를 수밖에 없었다. 룸미러에 비친 내 모습 때문이었다.<br/>
            곱슬 거리는 노란 머리, 자기주장을 강하게 펼치는 이두와 삼두, 그리고 그 탄탄한 몸 위에 입혀진 핑크색 앞치마...<br/>
            “이게 무슨 꼬라지고!”<br/>
            혼미해지는 이성의 끈을 붙잡던 나는 이내 생각을 바꿔먹었다.<br/>
            이 모습이야 말로 품바 아저씨가 말한 진정한 장사꾼의 모습이 아닌가!<br/>
            위기는 기회라고 하지 않았던가. 나는 룸미러를 보며 씨익 웃었다. 가지런한 흰 치아가 햇빛 에 반짝였다.<br/>
            이 트럭이 어디로 향하는지, 내가 왜 이곳에 있는지 아무것도 모르겠지만, 일단 이 길이 향하 는 곳으로 가보는 거다.<br/>
            <br/>
            그렇게 마음을 먹는 순간, 끝을 알 수 없던 도로의 끝에 밝은 빛이 나타났다. 나는 트럭의 속도를 올리고 새파란 빛을 향해 질주했다.<br/>
            <br/>

            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal20",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title20.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title20_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
