<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v9">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    바다를 호령하는 바다의 神 '마! 도로스 아이가'
                </p>
                <p class="main-character-text2">
                    “바다를 동경하는 항해자,<br /> 세계를 꿈꾼다!”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">14세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">165cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#유행에 민감한 MZ</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">수영</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">특별한 힘을 이용해 바다를 지배</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 마! 도로스 아이가 이야기</h3>
            “거지!”<br/>
            누굴 부르는지 알았지만 모르는 척했다.<br/>
            “거지가 귀도 먹었나?”<br/>
            무시하면 제 풀에 지쳐 다른 곳으로 갈 거다. 아이는 그렇게 생각했다. 지금껏 경험으론 그랬다. 그런데 이번엔 오기가 생겼는지 머리를 힘껏 잡아당겼다.<br/>
            “아악..!”<br/>
            “너 왜 대답 안 해? 너 거지 맞잖아!”<br/>
            한쪽이 머리를 잡기 시작하자 다른 한쪽도 지지 않겠다는 의지로 머리끄덩이를 놓지 않았다. 아 직 주먹을 휘둘러 싸우는 법에 익숙하지 않은 애들 같은 싸움이었다. 머리에 땜빵 구멍이 나서야 싸움이 끝났다. 병호가 머리를 탈탈 털자 땜빵 자리가 더 커져 보였다.<br/>
            병호는 여기 있다간 또 다른 애들이 달려 들 것 같았다. 갑자기 어젯밤 누님이 했던 말이 떠올랐 다. ‘병호야, 부둣가에 엄청나게 큰 배가 들어왔대. 우리 동네만큼 큰 배라는데 궁금하지 않니?’ 병 호는 선착장에 배를 보면서 놀아야겠다고 생각했다.<br/>
            어른들은 애들이 바닷가에 가면 정신 사납다고 썩 집에 가리 했지만 병호는 바다가 좋았다. 멋진 배도 볼 수 있고 운이 좋으면 예쁜 조개껍질을 주울 수 있었다. 시끄럽지만 갈매기가 날아다니는 걸 구경할 수 있었다. 병호는 누나의 말이 맞는지 확인하고 싶었다. 진짜로 집보다 크고 동네보다 큰 배인지 눈으로 봐야 잠을 잘 수 있을 것 같았다. 병호는 자신이 모험가가 된 것 같았다. 나뭇 가지 하나를 쥐고 적들을 물리치는 상상을 하며 항구로 갔다. 어린아이가 혼자서 항구에 나타나 자 어른들은 어쩐 일로 왔냐며 물어왔다. 병호는 어떻게 해야 집으로 돌아가지 않을지 고민한 끝 에 심부름을 왔다고 거짓말했다. 그게 병호의 첫 거짓말이었다.<br/>
            “아부지 심부름? 으매 효종이 그 양반 아들내미는 잘 뒀네. 어디 따른 데 가지 말고 금방 들렸다 집 가그래.”<br/>
            “네. 안녕히 계세요.”<br/>
            병호는 처음 거짓말만 어려웠지 다음은 어렵지 않았다. 심부름을 핑계로 항구를 싸돌아다녔다. 어 린 병호가 돌아다니기엔 너무 넓어서 지쳐갈 때쯤, 사람들이 모여 있는 걸 발견했다. 지나다닐 수 없을 정도로 사람이 많았다. 병호는 어른들 다리 사이로 고개를 빼꼼 내밀었다. 배에서 내리는 선 원들이 신발이 보였다. 병호는 벌떡 일어나서 그들이 가는 방향으로 달려갔다.<br/>
            “뭐하는 사람이래요?”<br/>
            “이번에 항해하다가 잠깐 들렸다고 하는데. 마도... 뭐라고 했지?” “마도로스? 그랬던 것 같은데?”<br/>
            <br/>
            ‘마도로스..‘<br/>
            병호는 흰 제복을 입고 일렬로 걷는 사내들이 거대해 보였다. 그들의 뒷모습이 사라질 때까지 자 리에 우뚝 서서 바라봤다. 병호의 시선엔 동경이 담겨있었다. 어른들 역시 하나 둘 해산했다.<br/>
            집에 돌아갈 시간이 됐다. 병호는 왼쪽 신발로 흙먼지를 일으키며 나뭇가지로 탁탁 바닥을 치며 집으로 향했다. 흙먼지로 더러워진 신발을 보자 병호는 자신도 멋진 뱃사람처럼 깨끗하고 멋진 미제 신발이 갖고 싶다는 생각이 들었다.<br/>
            오랜만에 찾은 바다는 어느 때처럼 드넓었다. 생각했던 것 이상으로 광막한 바다는 모든 것을 집 어삼킬 것 같았다. 파도는 선박을 집어삼킬 것처럼 몰아쳤지만 이내 잔잔한 물결로 사라졌다. 배 는 엔진 소리와 함께 출렁이는 파도 위를 헤쳐 나갔다. 바다 내음은 노인이 바다로 온 것을 실감 하게 했다. 그는 집채만 한 파도가 몰아쳐도 굳건하게 항해를 나아가는 바다 사나이가 되고 싶었 다. 어린 마음, 바다 사나이를 동경했던 사내아이는 63세가 되어서야 바다에 올 수 있었다.<br/>
            노인은 자신의 손을 물끄러미 바라봤다. 매끈했던 살결은 사라지고, 보기 싫은 주름과 앙상해진 뼈 마디만 남았다. 마주 잡은 손에는 점점 힘이 들어갔다.<br/>
            “세월도 야속하지 조금만 늦게 흐르면 좋을 걸.”<br/>
            그는 자신이 아닌 누군가를 위해 돈을 벌기 시작해 현재까지 달려왔다. 그렇지만 그 시절을 다시 겪게 된다면 같은 선택을 하리라. 자신이 힘들게 보낸 세월 있었기에 모든 걸 지킬 수 있었다.<br/>
            잦은 이사로 이삿짐을 풀지 못하고 쌓여있는쪽방.이삿짐이 없는 곳에 온가족이 옹기종기 붙어 잤던 그때의 기억. 학교는커녕, 그날 한 끼를 해결하는 것도 하루의 큰 문제였다.<br/>
            그랬다. 그땐 그랬지.<br/>
            바쁜 나날에 가려진 기억이 떠올랐다.<br/>
            인부로 일하시던 아버지, 시장에서 나물을 팔던 어머니, 학교를 포기하고 공장에서 일을 하던 누 님, 꼭 돈을 벌어오겠다며 고향을 떠난 형님. 다들 어떻게들 지내시는지요. 그곳에서는 안녕하신가요.<br/>
            막내는 이리 다 컸답니다.<br/>
            노인은 지난밤, 어린 시절 가족들과 함께 배를 타고 세계를 여행하는 꿈을 꿨다. 꿈속에서 모두 가 힘듦을 잊고 행복한 모습에 불쑥 바다를 찾았다. 떠난 이들을 그리며 석양을 바라보니 주책도 없이 눈물이 나는 걸지도 모르겠다.<br/>
            <br/>
            마도로스 아아 마도로스 영원한 바다여<br/>
            마도로스<br/>
            바다를 개척하는<br/>
            고독한 사나이<br/>
            염원을 담은 노래가바다를 물들인 석양에 울려퍼졌다.노인은오랜 가족이 그리웠다.그때그 시 절이 그리웠다. 이 늙은이에게 주어진 시간이 더 있다면, 그렇다면 바다 저편을 건너는 항해사가 될 것이다.<br/>
            노인은 다짐의 순간, 선장석에서 박수소리가 들려왔다. 다 늙은 노인네가 바다를 보다 노래 부르는 모습을 봤다고 생각하니 이내 부끄러움이 몰려왔다. 배 한 척을 빌려서 다행이지 그렇지 않았다면 시선을 면치 못했을 것이다. 운전석으로 몸을 돌리자, 낯짝이 희멀건 젊은 선장은 뭐가 그리 즐거 운지 웃음을 참는 것 같았다.선장은 노인이 제 쪽을 바라보는 시선이 느껴지자 먼저 말을꺼냈다.<br/>
            “멋지십니다.”<br/>
            멋지다는 칭찬에 노인은 머쓱해졌다. 괜한 주책에 반응해주는 젊은 청년이 고마웠다.<br/>
            “... 들었소? 거 참, 쑥스럽구먼. 내 꿈의 노래요.”<br/>
            “멋진 꿈인 걸요. 꼭 이룰 수 있을 겁니다.”<br/>
            “젊은 사람이 말도 곱구려, 고맙소”<br/>
            “결심은 현실로 나오기 마련이죠. 아마 오늘은 좋은 꿈을 꾸실 겁니다.”<br/>
            “그러면 좋겠군. 이제 슬슬 돌아갑시다.”<br/>
            “그럼, 배 돌리겠습니다.”<br/>
            노인은 선뜻 발을 내딛을 수 없었다. 지금 내리면 또 언제 바다에 올 수 있을지 몰랐다.<br/>
            “회장님.” 수행비서의 목소리가 들렸다. 노인은 상념에서 깨어났다. 비서는 배에는 혼자 탈 거라는 회장의 말에 차량을 대기하고 있었다.<br/>
            “가지.”<br/>
            <br/>
            “다음에 또 오세요.” 선장이 노인에게 해사하게 웃으며 말했다.<br/>
            기묘한 청년이었다. 뱃사람이라면 뜨거운 태양볕과 바다에 반사되는 빛으로 시꺼멓게 탄 양반이 대 부분인데 허연 피부는 붉게 달아오르지도 않았다. 자신이 꽤 사람을 잘 본다고 치부했건만 아직 멀 었다는 생각이 들었다. 그는 많은 사람들을 만났다. 그 동안 정말 다양한 사람을 만나봤지만 저런 부류의 사람은 처음 보는 것 같았다.<br/>
            노인은 수행기사의 손을 잡고 선착장으로 내렸다.<br/>
            포장된아스팔트 도로를 달리는 차량이 밋밋하게 느껴졌다.그는 거친 파도를 느낄 수 있던 몇 시 간 전의 감각을 다시 느끼고 싶었다. 노인이 표정을 굳히자 운전기사는 회장의 심기를 거스를까 더조심히차를 끌었다.그는 배에서 내린 지 얼마나 됐다고벌써 바다를 그리워하는지 실소가 나 왔다. 누가 보면 정말 바다에서 사는 걸로 착각할 것이다.<br/>
            노인은 사업적으로 뛰어난 수완을 보였다. 20대부터 사업에 성공해 안 해본 것이 없었다. 수산 물 도소매를 시작으로 제조업에 진출했다. 그걸 기반으로 지금의 자산가가 될 수 있었다. 그는 아버 지와 어머니는 못 챙겼어도 아들과 딸, 손주들까지 먹여 살릴 수 있었다. 노인은 자신의 취미생활 에 몰두했다. 공장 설립 축하로 받은 수석으로 수석 모으기에 눈을 뜨기 시작했다. 수석 사랑에 아내도 혀를 내둘렀다.<br/>
            “또, 또, 그놈의 돌 그만 닦으라니까.” “돌이라니. 이건 수석이요. 당신도 참.”<br/>
            “그게 그거잖아요.” 아내가 중얼거렸다. 노인이 수석을 애지중지 닦자 그의 아내는 닭살이 올라왔 다. 가족한테도 안 하는 행동을 돌에 하고 있으니.<br/>
            “이렇게 닦아줘야 윤기가 보이는 걸 어떡해. 아이고 예뻐라~ 뽀뽀라도 해줘야지. 쪽쪽쪽.” “남들도 당신이 이러는 거 알아요?”<br/>
            “체면이 있지. 남사스럽게.”<br/>
            “나한테도 체면 좀 차려줘요.”<br/>
            수석을 닦고 노인은 하루를 마무리했다. 배를 타서 그런지 몸이 고단했다. 노인은 침대에 몸뚱이를 뉘고 서서히 눈을 감았다. 내일 해야 할 일들과 사업에 대한 생각을 하다 보니 오늘 낮에 젊은 선 장이 건넨 말을 떠올랐다.<br/>
            ‘좋은 꿈을 꾸실 겁니다.’<br/>
            그날 꿈을 꿨다. 커다란 배에 선원복을 입은 사내가 보였다. 뭐가 그리 즐거운지 함박웃음을 짓는 모습에 절로 웃음 지어졌다. 아, 내가 지은 웃음인가.<br/>
            노인은 자신의 손을 쓸어내렸다. 손목 위로 빳빳하게 다려진 소매 깃도 만져졌다. 짭조름한 바다<br/>
            <br/>
            내음이 코에 스쳐 지나갔다. 팔을 크게 벌려 온몸으로 바닷바람을 누렸다. 평생 짊었던 짐을 내려 놓는 것 같은 자유로움이었다.<br/>
            선장이 말한 좋은 꿈이 이런 거라면, 이런 꿈이라면, 바다를 항해하는 마도로스도 무리는 아닐 거다.<br/>
            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal9",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title9.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title9_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
