<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v21">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    사랑의 화살로 누구나 사랑에 빠지게 만드는 모태솔로 큐피트 '추앙애'
                </p>
                <p class="main-character-text2">
                    "세상 모든 사랑을 이어주고, 사랑이 가득한 세상에서 사는 것!"
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">20세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">130cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#중2병말기#사명감넘침</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">로맨스 영화 보기</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">활을 쏘면 쏟아지는 하트비</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 추앙애 이야기</h3>
            “엄마 저 왔어요!”ㅡ<br/>
            고등학교 3학년 2학기의 겨울방학이 시작된 날이었다. 방학식을 끝내고 돌아온 나는 한껏 들 떠 집에 들어왔다. 입시를 다 끝내고 졸업을 앞 둔 학생이 방학동안 할 일은 신나게 노는 것 뿐이니 들뜨지 않을 수 없었다.ㅡ<br/>
            하지만 내 설렘은 너무 일찍 깨져 버렸다.ㅡ<br/>
            “엄마 이게 다 뭐예요?”ㅡ<br/>
            집은 어수선했다. 여기 저기 쌓인 짐에 캐리어, 분주해 보이는 엄마와 오빠, 주변을 돌아다니 며 냄새를 맡는 4살 푸들 코코까지.ㅡ<br/>
            “뭐긴 뭐야. 오빠 다음 주에 출국하니까 짐 싸는 거지.” “네? 오빠 어디 가는데요?”ㅡ<br/>
            “야 너는 나 유학 가는 것도 모르냐?”ㅡ<br/>
            잠옷 바람의 오빠란 놈은 머리를 벅벅 긁으며 내게 핀잔을 줬다. 유학이라니? 생판 처음 듣는 소리였다.ㅡ<br/>
            “저한텐 말 안 해주셨잖아요.”ㅡ<br/>
            “어머 그랬나? 지금 알았으면 됐지. 지금 정신없으니까 방에 들어가 있어.”ㅡ<br/>
            엄마는 날 쳐다보지도 않고 말했다.ㅡ<br/>
            놀랍지도 않았다. 이 집에서 난 찬밥 같은 존재였으니까. 오죽하면 코코도 날 무시했다. 하루 이틀도 아닌 일에 슬퍼하지 말자. 어차피 나는 곧 이집을 떠날 테니까.ㅡ<br/>
            나는 가방을 아무렇게나 던져두고 침대에 폴짝 뛰어 올라 소리 없는 환호를 질렀다. 몇 달 뒤면 대학에 간다. 그것도 아주 먼 곳으로.ㅡ<br/>
            내가 원서를 넣을 때 중요하게 본 건 집과의 거리였다. 될 수 있으면 최대한 멀게.ㅡ<br/>
            그래서 서울토박이던 난 부산에 있는 대학에 가게 됐다.ㅡ<br/>
            이러고 있을 때가 아니었다. 난 얼른 컴퓨터 앞에 앉아 대학근처의 맛집과 핫플을 찾아보며 부산에서 가봐야 할 곳 100선을 뽑기 시작했다.ㅡ<br/>
            하지만 신은 무심하게도 내 희망을 짓밟았다.ㅡ<br/>
            다음날 아침식사 때였다. 오빠는 한참 유학얘기로 즐거워보였고, 나는 대충 맞장구를 치며 음 식을 입에다 밀어 넣고 있었다.ㅡ<br/>
            큼!ㅡ<br/>
            그때, 밥술을 뜨던 아빠의 헛기침에 오빠의 나불거리던 입이 멈췄다.ㅡ<br/>
            ㅡ<br/>
            “말자야, 너희 오빠 유학 가는 거 알지. 우리도 오래 고민하고 정한 일이다.” “네 알아요.”ㅡ<br/>
            “유학 비용이 꽤 들어. 최소 3년은 미국에 있기로 결정도 됐고.”ㅡ<br/>
            아빠는 조금 뜸을 들이다 말을 이었다.ㅡ<br/>
            “그래서 말이다. 너까지 지원해 주는 건 어려울 것 같다.”ㅡ<br/>
            “네?”ㅡ<br/>
            “일단 휴학하고 일 년 정도 일부터 해보는 건 어떻겠니. 굳이 넌 대학까지 갈 필요 없었잖아. 그리고 아빠는 너 공대 가는 거 반대다. 여자애가...”ㅡ<br/>
            나는 아빠의 입에서 흘러나오는 말을 이해할 수 가 없었다. 오빠는 굳이 필요하지도 않은 유 학까지 보내주면서 나는 최소한의 것도 지원해 줄 수 없다고?ㅡ<br/>
            더 화나는 건 아빠의 말에 그 누구도 이의를 제기하지 않는다는 거다. 엄마도 오빠도 입을 꾹 다물고 있었다.ㅡ<br/>
            “아니 아빠!”ㅡ<br/>
            “아버지 말하시는 중이잖니!”ㅡ<br/>
            조용하던 엄마가 끼어들었다.ㅡ<br/>
            큼, 하고 헛기침을 한번 한 아빠는 다시 말하기 시작했다.ㅡ<br/>
            “고모가 간호학원 하잖아. 거기 다니면 학원비는 지원해 주마.” “뭐라고요...?”ㅡ<br/>
            울지 말자. 울지 않을 거야.ㅡ<br/>
            난 마음속으로 몇 번이고 되뇌었지만 결국 눈물한방울이 흘러나왔다.ㅡ<br/>
            “또 우냐? 아버지가 아예 지원 안 해주신다는 것도 아니고, 간호학원 가면 되잖아.”ㅡ<br/>
            나는 오빠의 입을 콱 때려주고 싶었다.ㅡ<br/>
            사업을 하겠다며 경영학과에 들어가선 1년도 못 버티고 휴학하고는, 이제 와서 무슨 바람 들 었는지 유학타령이나 하고 있는 주제에.ㅡ<br/>
            나는 결국 화를 참지 못하고 오빠를 행해 꽥 고함을 질렀다.ㅡ<br/>
            “뭐? 네가 뭘 안다고 그래? 그럼 내가 유학 갈 테니까 네가 간호학원 다니던가!”ㅡ<br/>
            탁!-ㅡ<br/>
            내 말을 듣고 있던 아빠가 젓가락을 식탁에 세게 내려놓았다.ㅡ<br/>
            ㅡ<br/>
            “박말자! 너 지금 오빠한테 말버릇이 그게 뭐야. 빨리 사과 안 해?”ㅡ<br/>
            아빠가 큰 소리를 내자 식탁 밑에 누워있던 코코가 뛰어 나와 날 향해 짖기 시작했다.ㅡ<br/>
            코코는 항상 그랬다. 내가 혼이 날 때면 본인도 달려 나와 가담했다. 본능적으로 얘도 아는 걸 테다. 내가 미운오리새끼라는 걸. 나한테 붙어봤자 콩고물 하나 떨어지지 않는 다는 걸.ㅡ<br/>
            망할 강아지 망할 집구석,ㅡ<br/>
            “지긋지긋해...”ㅡ<br/>
            나는 잠옷 위에 패딩만 달랑 걸치고 집을 나갔다. 문을 쾅 닫는 것도 잊지 않았다.ㅡ<br/>
            12월 말의 아침공기는 차갑다 못해 아렸다. 사람들은 유난히 거리에 북적였고, 들떠보였다. 난 집 근처 공원에 한참을 앉아있다 깨달았다.ㅡ<br/>
            아 오늘 크리스마스이브구나.ㅡ<br/>
            가는 날이 장날이라더니.ㅡ<br/>
            나는 졸지에 크리스마스이브에 집에도 못 들어가고 거리를 떠도는 처량한 신세가 되어 버렸 다.ㅡ<br/>
            주머니 속엔 2만 원 정도 들어있는 교통카드 하나와 동전 몇 개가 전부였다. 나는 이렇게 준 비성 없이 집을 뛰쳐나온 것에 후회가 됐지만 그렇다고 다시 돌아갈 수도 없는 노릇이었다. 나는 머리를 굴려 재빨리 선택지 몇 가지를 떠올렸다.ㅡ<br/>
            1번, 윤지한테 연락을 한다.ㅡ<br/>
            2번, 지하철을 타고 하루 종일 시간을 보낸다. 3번, 집에 다시 들어간다.ㅡ<br/>
            일단 제일 먼저 3번을 지웠다. 자존심이 허락하지 않으니까. 그리곤 윤지에게 전화를 걸었다. 신호음이 몇 번 울리고 전화가 연결됐다.ㅡ<br/>
            [여보세요?]ㅡ<br/>
            “윤지. 나 지금 가출함. 너희 집 갈 수 있음?”ㅡ<br/>
            [드디어 가출? 근데 나 지금 가족들이랑 여행 왔어. 어제 말하지 않았나?] “아...그랬지.”ㅡ<br/>
            분명 어제 윤지가 내게 호주에서 크리스마스를 보낸다고 얘기했었는데, 방학이라는 사실에 들 떠 잊고 있었다.ㅡ<br/>
            “그래 재밌게 놀다와!”ㅡ<br/>
            ㅡ<br/>
            [알겠어. 선물 많이 사갈게]ㅡ<br/>
            전화를 끊고 나는 벤치에 더 깊숙이 눌러 앉았다. 괜히 전화했다는 후회도 들었다.ㅡ<br/>
            나도 좋은 가족을 만났더라면...ㅡ<br/>
            그런 상상은 날 더 비참하게 만들었다.ㅡ<br/>
            난 날 때부터 못난 애였다. 이유는 하나였다. 할머니는 아들을 원했지만 난 딸이었다는 것. 그 게 내가 못날 수밖에 없는 이유였다. 아무리 노력해도 성별을 바꿀 순 없었기에 난 사랑받을 수 없었다.ㅡ<br/>
            난 첫 번째 선택지도 머릿속에서 지워내고 지하철역으로 걸음을 옮겼다. 롱패딩 아래로 보이 는 핑크색 수면바지가 조금 신경 쓰이긴 했지만 마땅한 선택지는 없었다.ㅡ<br/>
            출근시간이 지났음에도 지하철역은 인파로 붐볐다. 이브를 맞은 사람들은 다들 행복해 보였 다. 커플들은 손을 마주잡고 서로를 사랑스런 눈빛으로 바라봤고, 아이의 선물을 들고 가는 부모들의 눈에는 애정 어린 기대가 서려있었다. 저 선물을 받은 아이들은 아마 기쁨의 비명을 내지르겠지. 핑크빛 지하철 역 속에서 나는 홀로 잿빛이었다.ㅡ<br/>
            나는 어디로 갈지 고민하며 역 안을 쏘다녔다. 애써 사람들의 밝은 표정을 외면하면서. 그러다가 벽면의 커다란 전광판 하나가 눈에 들어왔다.ㅡ<br/>
            국립중앙박물관 &gt;신화와 서양사&lt; 무료입장ㅡ<br/>
            무료입장이라니. 그 한 단어는 내 마음을 움직이기에 충분했다.ㅡ<br/>
            미술? 여태 관심도 둔적이 없다. 서양사? 듣기만 해도 하품이 난다. 하지만 무료전시라면 충 분히 가 볼 가치가 생긴다. 내게 있는 건 시간뿐이었으니까.ㅡ<br/>
            이브의 박물관은 한가했다. 데이트 코스로 박물관을 선택하진 않을 테니 어쩌면 당연한 일이 었다. 나는 수면바지를 롱 패딩 아래로 접어 넣고 박물관으로 들어갔다.ㅡ<br/>
            로비를 막 지날 때였다. 단정하게 머리를 올려 묶은 직원 한분이 날 불러 세웠다.ㅡ<br/>
            “잠시만요.” “네?”ㅡ<br/>
            무료전시가 아니었나? 아니면 박물관엔 이런 복장으로 오면 안됐나? 수면바지는 최대한 숨겼 는데... 이런저런 고민에 빠져있을 때 직원은 내게 상냥한 미소로 얘기했다.ㅡ<br/>
            “이번 전시는 도슨트가 없어서 오디오 가이드를 지원하고 있는데 이용하시겠어요?” “네...? 돈트요?”ㅡ<br/>
            “작품 보시면서 설명을 들으실 수 있는 오디온데, 이용 원하시면 말씀해 주세요.”ㅡ<br/>
            ㅡ<br/>
            나는 그게 뭔지 잘 몰랐지만 일단 고개를 끄덕였다. 무료라면 거절할 이유가 없었다. 직원은 내게 이어폰이 연결된 작은 오디오 기계를 건넸다.ㅡ<br/>
            “작품 옆의 번호를 입력하지면 설명을 들을 수 있어요.”ㅡ<br/>
            오디오는 나쁘지 않았다. 적어도 갈 곳이 없어 떠돌다가 박물관에 들어온 사람처럼은 보이지 않을 것 같다는 생각이었다. 물론 1분에 한 번씩 흘러내리는 수면바지를 끄집어 올려야 했지 만.ㅡ<br/>
            나는 작품을 빙 둘러보다 2층에 위치한 그리스 신화관으로 들어갔다. 온통 발가벗고 있는 그 림들에 얼굴이 화끈해져 바로 나올 뻔했지만 이제 성인인데 이 정도는 봐도 되지 싶어 천천히 작품을 살펴봤다.ㅡ<br/>
            미켈란젤로의 &gt;천지창조&lt; 라파엘로의 &gt;갈라테이아의 승리&lt;ㅡ<br/>
                나는 천천히 걸음을 옮기며 작품의 이름과 그림을 한번씩 눈으로 훑었다.ㅡ<br/>
                그리고ㅡ<br/>
                산드로 보티첼리의 &gt;라 프리마베라&lt;ㅡ<br/>
                난 그림 앞에 우뚝 멈춰 섰다. 그리고는 한참 동안 그 자리에 머물렀다.ㅡ<br/>
                내 눈길은 하늘을 날고 있는 날개 달린 작은 소년에게 고정 되어있었다 구불거리는 황금빛 머 리칼의 소년. 그리고 작은 활로 누군갈 겨냥하고 있는 모습.ㅡ<br/>
                난 오디오 가이드에 작품 번호를 입력하고 설명을 듣기 시작했다.ㅡ<br/>
                르네상스 초기 대표작가인 보티첼리의 작품 라 프라마베라는 다가오는 봄을 그린 작품입니다. 프리마베라는 이탈리어로 봄, 또는 청춘이라는 뜻을 담고 있습니다.ㅡ<br/>
                ...ㅡ<br/>
                상단의 큐피드는 잘 알려진 그리스의 신 중 한명입니다. 큐피드의 화살에 맞는 사람은 처음 본 사람과 사랑에 빠진다고 하죠. 청춘의 시작은 사랑의 시작이라고도 볼 수 있습니다.ㅡ<br/>
                ...ㅡ<br/>
                큐피드.ㅡ<br/>
                오디오가 끝난 뒤 내 머릿속에 남은 건 오로지 큐피드였다. 사랑의 화살이라니. 엄청난 능력 치의 아이템이었다.ㅡ<br/>
                저런 화살이 내게 있었다면...ㅡ<br/>
                “저런 화살이 있다면 누굴 먼저 쏘고 싶어요?”ㅡ<br/>
            ㅡ<br/>
                뒤에서 들려온 누군가의 목소리에 난 화들짝 놀라 돌아봤다.ㅡ<br/>

                <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal21",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title21.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title21_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
