<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v11">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    천만 불짜리 콧수염의 유혹~ 더티 섹시 순정마초남 '싼티안나'
                </p>
                <p class="main-character-text2">
                    “다양한 인종과 문화를 아우르는,<br /> 세상을 꿈꾼다!”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">30세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">175cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#느낌함#수다쟁이#세계이장느낌</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">투우</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">흥이 차면 토마토 운석이 떨어짐</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title">싼티아나 이야기</h3>
          스페인에서 게스트하우스를 운영하는 남자.<br/>
          외모로 겪는 지긋지긋한 차별의 덫에서 빠져 나오고 싶다 무엇으로? 언어와 피부의 장벽을 뛰어넘는 어나더 컬쳐 음악으로!<br/>
          스페인에 온지도 4 년이 지났지만 여전히 이곳의 아침공기는 낯설었다. 여전히 느껴지는 타국의 냄새는 내가 여전히 새로운 곳에 있음을, 내가 이방인이라는 점을 상기 시켰다.<br/>
          이른 새벽이었고 주변은 조용했다.<br/>
          나는 어스름한 새벽의 공기를 가르며 게스트 하우스, 산티아나의 거실로 나갔다. 불이 꺼져 어두운 거실에는 싸구려 술병들이 몇 개 널브러져 있었고, 술 냄새가 진동했다. 어젯밤에도 이곳에 머물던 투숙객들이 여흥을 만끽하며 파티를 벌였으리라.<br/>
          깨진 물건들이 없나 대충 둘러보다 바닥의 술병 몇 개를 치우고는 게스트하우스 구석에 마련된 작은 방으로 들어왔다. 싱글사이즈 침대 한 개. 작은 테이블 하나에 책 몇 권, 그리고 간소한 옷걸이에 세면 거울 하나가 전부인 방이다.<br/>
          게스트 하우스에서 이렇게 지낸 게 벌써 4 년째였다. 처음에는 그저 여행일 뿐이었다. 며칠 머무르고 다른 곳으로, 그리고 다시 한국으로 돌아갈 계획이었다. 하지만 돌아가는 건 싫었다. 돌아가서 느낄 따분함과 권태감, 그리고 날 신기하단 눈빛으로 바라보는 그들의 시선에서 벗어나고 싶었다.<br/>
          그래서 난 가지고 있던 돈이 모두 떨어질 때 까지 이곳에서 머물렀다. 그리고는 정말 내가 가진 돈이 모두 떨어졌을 때. 싼티아나 주인 부부에게 매달리듯 부탁해서 이곳에서 일하게 되었다.<br/>
          마침 나이가 적지 않은 주인 부부는 큰 게스트 하우스를 둘이서만 관리하는 것에 부담을 느끼고 있었고, 장기투숙하며 친하게 지내던 내가 그런 부탁을 했기에 흔쾌히 내가 이곳에서 일하는 것을 수락했다.<br/>
          방을 청소하고, 침구를 세탁하고, 또 새로운 사람들을 계속해서 만나고 떠나보내는 게 이 산티아나의 일상이었다.<br/>
          <br/>
          책상에 앉아 일정을 정리하다 기지개를 펴고 일어났다. 창밖엔 떠오른 해가 보였고 이제 난 오늘 하루를 시작해야 할 참이었다. 간단히 세수를 하던 중, 오래 된 거울 속에 내 모습이 비춰졌다. 꺼무잡잡한 피부, 곱슬거리는 장발머리, 수북이 난 수염은 한국 사람처럼 보이지는 않았다.<br/>
          이 때문에 난 한국에서 태어나고 자란 한국인 이었지만 동시에 이방인 이었다.<br/>
          한국에서 누군가 날 만나게 됐을 때, 첫 질문은 항상 같았다. ‘어느 나라에서 오셨어요?’<br/>
          그 질문은 날 질기게 물고 늘어졌다. 어릴 때는 속상함에 펑펑 울었던 것 같고, 청소년기에는 버럭 화를 냈다. 성인이 되고 나서는 ‘부산에서 왔어요.’ 라며 유머러스하게 넘겼지만 이후엔 그 조차도 질렸다. 난 한국에 살고 있지만 그들의 집단에 속하지 못했다. 그저 내 두 발만 한국 땅이란 곳에 붙어있는 것 같았다.<br/>
          하지만 이 게스트 하우스에 오는 사람들은 모두 이방인이다. 이 하얀 건물에 잠시 머물다 가는 모두 타지에서 온 이들이었다. 그 점이 내가 계속해서 이곳에 머물고 싶었던 이유였다. 모두가 이방인인 이 공간에서는 어느 누구도 내쳐지지 않는다. 각자가 하나의 집합이고 그렇기에 모두가 상처받지 않는다.<br/>
          물론 이곳에서도 날 평생 따라다녔던 그 질문은 건재했다. ‘어느 나라에서 오셨어요.’<br/>
          만나는 모든 이들이 서툰 언어를 사용하며 서로에게 그렇게 묻곤 한다. 하지만 어디서 왔는지는 전혀 신경 쓰지 않는다.<br/>
          그냥 단지 궁금했기에 물어볼 뿐이니까. 그들의 물음 속에 비열한 호기심 따위는 없다.<br/>
          내가 해변 가의 하얀 게스트하우스 산티아나와 사랑에 빠진 데는 마땅한 이유가 있었다. 4 년 전 스페인에 도착해 처음으로 이 공간에 발을 들였을 때, 현관 앞에 커다랗게 붙어있는 이용 규칙 때문이었다.<br/>
          [차별하지 말 것]<br/>
          주어도 목적어도 없는 한 문장이었지만 이 짧은 문장이 주는 울림이 너무나도 컸기에 난 이곳을 떠날 수 없었다. 규칙이 새겨진 낡은 나무판자는 이 집을 지키는 부적이었으며, 이 게스트 하우스는 이방인들이 숨을 수 있는 방공호였다.<br/>
          <br/>
          이곳에 오는 손님들 모두가 규칙을 제대로 지키는 건 아녔지만 나만은 규칙 한 줄을 꽉 붙잡고 놓치지 않으려고 애썼다.<br/>
          여느 날과도 같은 아침이었다. 2 층에서 작은 소동이 일었다. 소란스러운 소리에 나는 재빨리 2 층으로 올라갔다. 한 영국인 남성과 일본인 여성이 실랑이를 벌이고 있었다. 우악스러운 목소리로 빠르게 영어를 내뱉던 남자는 날보고는 상황을 설명했다.<br/>
          “내가 가방에 아끼던 시계를 넣어놨는데 사라졌어.”<br/>
          남자는 그 이상의 설명은 않고 여자를 노려보기만 했다. 여자는 얼굴이 빨개져 서툰 영어를 몇 마디 하다 입을 다물었다.<br/>
          “저 여자가 가져가는 걸 본거야?”<br/>
          나는 차분히 남자에게 물었다.<br/>
          “아니 보진 못했어. 근데 너도 알잖아. 시계 훔쳐갈 사람이 또 누가 있어.”<br/>
          “아무런 증거도 없잖아. 그리고 그런 식의 의심은 차별일 뿐이야. 다시 잘 찾아봐. 내가 다른 손님들한테 한번 물어볼게.”<br/>
          남자는 욕을 짓거리며 나갔다. 그의 말 사이사이에 섞였던 단어들을 여자가 듣지 못했길 빌었다. 여자는 고맙다는 말과 함께 자신의 방으로 들어갔다.<br/>
          몇 시간 후였다. 남자는 민망한 얼굴로 현관을 청소 중이던 내게 다가왔다.<br/>
          “준, 아까 소란 피워서 미안해, 그 시계 친구 옷 주머니에 있더라고. 내가 어제 넣어놓고 깜박했나봐.”<br/>
          나는 찾아서 다행이란 말도, 괜찮다는 말도 않았다. 그저 고개 몇 번을 끄덕였다. 말을 끝내고 게스트하우스로 들어가려는 남자를 붙잡고 난 물었다.<br/>
          “그 여자에겐 사과했어?”<br/>
          “아 그 동양인 여자? 음, 해야겠지.”<br/>
          태연한 미소로 그렇게 말한 남자는 안으로 쏙 들어갔다. 난 한 손엔 빗자루를 들고 입구를 올려다봤다.<br/>
          날 이곳에 남게 만든 그 문장은 여전히 그 곳에 있었다.<br/>
          “차별하지 말 것”<br/>
          난 소리 내어 문장을 읽었다.<br/>
          <br/>
          그 여자가 동양인이 아니었다면, 내 외모가 이국적이지 않았더라면. 수많은 가정들이 머릿속을 헤집고 다녔다.<br/>
          복잡한 이해관계와 오해, 오랫동안 사회를 지배했던 사고, 어쩔 수 없는 상황과 차별.<br/>
          나의 하얀 방공호는 더 이상 안전한 곳이 아니라는 생각에 서글펐다.<br/>
          다음 날 아침, 2 박 3 일을 이곳에서 묵은 일본인 여자는 산티아나를 떠났다. 이제 일본으로 돌아간다고 했다. 아마 그녀는 영국인 남자의 사과를 받지 못했으리라.<br/>
          업무가 끝난 초저녁, 난 해변으로 갔다. 머리가 복잡할 땐 어디든 걷는 게 좋다. 발길이 닿는 곳으로 걸음을 옮겼다. 하얀 모래 알갱이들이 대충 신은 샌들 속으로 밀려들어오는 게 느껴졌지만 굳이 멈춰서 모래를 털어내진 않았다. 해변의 끝에서 끝까지 갔다가 다시 돌아오는 길이었다. 가는 길에는 들리지 않았던 악기 소리가 들렸다.<br/>
          작은 현악기의 음색 위로 나긋한 남자의 목소리가 겹쳐졌다. 곧 부드러운 젬베 소리가 시작되며 조화로운 멜로디를 만들어 냈다. 나는 소리가 나는 곳을 향해 걸었다.<br/>
          멀지 않은 곳에서 그들을 발견할 수 있었다. 해가 저물어가는 시간에 바다를 등지고 있던 터라 그들의 얼굴엔 진한 그림자가 앉았다. 그림자 때문에 난 그들이 어느 나라 사람인지 가늠할 수 없었다. 하지만 알고 싶지 않은 마음도 들었다. 그냥 그들의 국적이나 외모는 제쳐두고, 조용히 바닷바람을 맞으며 음악을 즐기고 싶었다. 그들 주변에는 사람들이 모여 앉아있었다. 사람들은 하나 같이 소리를 죽이고 음악을 듣고 있었다.<br/>
          곧 노래 한 곡이 끝나고 새로운 노래가 시작됐다. 잔잔한 팝송이었던 노래는 어느 덧 이탈리아의 강렬한 음악으로 변해있었다. 한번은 한국의 유명한 노래를 부르기도 했다.<br/>
          사람들은 떠나지 않고 자리를 지켰으며, 음악에 맞춰 어깨를 흔들거나 호응을 보내기도 했다. 아마 그곳에서 노래를 듣던 그들의 인종은 모두 달랐으리라.<br/>
          해변을 등진 두 남자는 어둠이 완전히 내릴 때 까지 계속해서 노래를 불렀다. 3 번의 앵콜 곡 까지 부른 그들이 떠나고 나서야 난 모래사장에서 일어났다.<br/>
          샌들 바닥을 채운 모래를 털어내고 나서 난 게스트하우스를 향해 걷기 시작했다.<br/>
          복잡하게 꼬였던 머릿속의 매듭이 조금은 풀어진 기분이었다.<br/>
          ‘음악, 음악이라...’<br/>
          그 순간 내 머릿속에 엄청난 아이디어가 번뜩 떠올랐다.<br/>
          난 빠르게 걸음을 옮기다 어느 샌가 달리고 있었다.<br/>
          <br/>
          차별하지 말 것. 그 규칙을 지키기 위한 걸음이 시작되고 있었다.<br/>
          스페인의 하얀 마을 네르하에 위치한 게스트 하우스, 산티아나. 1 년 전까지 하얗던 외벽은 알록달록한 색깔로 덮여있다. 자세히 다가가 벽을 살피면 곧 각국의 국기가 이뤄낸 그림이란 걸 알 수 있다. 오늘 한국인 커플 한 쌍이 이곳을 방문했다. 그들은 체크인을 위해 나를 찾았다. 곧 어두운 톤의 피부에 진한 쌍꺼풀을 가진 내가 거실 옆의 작은 방에서 나오자, 나를 마주한 그들은 조금이나마 공부했던 스페인어로 인사를 건넸다.<br/>
          “알로”<br/>
          “알로, 한국분이시죠? 산티아나에 잘 오셨어요.”<br/>
          그들은 나의 능숙한 한국어에 놀라며 물었다.<br/>
          “어느 나라 분이세요?”<br/>
          나는 하얀 치아를 보일 만큼 환하게 웃으며 답했다.<br/>
          “우주인 입니다.”<br/>
          한국인 커플은 생뚱맞은 나의 말에 당황하지만 게스트하우스 내부를 둘러보다가 고개를 끄덕인다.<br/>
          천장을 메운 만국기와 다양한 국가에서 직접 공수해 온 듯 보이는 전통 인형과 의상들, 게스트 하우스 중심에 떡하니 놓여있는 거대한 지구본. 그리고 스피커에서 끊임없이 흘러나오는 여러 국가의 노래들과 옆에 마련된 작은 무대까지. 나의 말이 내심 납득이 가는 풍경이었다.<br/>

          <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal11",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title11.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title11_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
