<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v10">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    보기만 해도 당 충전 100% 만능 피로회복제 '안질리나 젤리곰'!
                </p>
                <p class="main-character-text2">
                    “비타민 젤리처럼 세상 곳곳에,<br /> 에너지를 전파 하겠다!”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">3개월</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">200cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#당참 #통통튀는</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">먹방</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">감정변화에 따라 몸 색깔이 변함</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 안질리나 젤리곰 이야기</h3>
           “쿼드러플 살코, 트리플 토룹. 성공입니다! 이로써 남은 점프는 단 하나. 김도형 선수 긴장을 놓으 면 안 됩니다.”<br/>
           “트리플 악셀! 깔끔합니다.”<br/>
           “김도형 선수, 이번 경기로 4관왕 달성했습니다.”<br/>
           울리는 함성 소리도 중계진의 말도 들리지 않았다. 터질 것 같은 심장소리와 가쁜 숨소리로 가득 찼다.<br/>
           ‘꿈은 현실이 될 거예요. 노력은 도망가지 않으니 두려워하지 말았으면 좋겠어요.’<br/>
           . . .<br/>
           아직 동이 트지 않는 시간, 방문이 열리는 소리가 들렸다. 그는 소음에 민감했다. 그렇지만 당장 은 잠이 더 중요했다. 저를 깨우는 소리가 반복되자 도형은 웅얼거리는 소리로 대답했다. 잠을 깨 지 못하자 결국 침대를 두드리기 시작했다. 도형은 모처럼 휴식에 깨어나는 게 아쉽게 느껴졌다.<br/>
           “도형아.”<br/>
           어머니는 비몽사몽 하는 도형의 모습이 익숙한 듯 침구를 정리하며 도형을 불렀다. “네...”<br/>
           “오늘 스케줄 없어?”<br/>
           “없어요... 저 좀만 더 잘게요.”<br/>
           “매니저님 오셨던데?”<br/>
           “매니저 형? 오늘 분명 쉬는 날이라고 했는데...”<br/>
           도형은 핸드폰을 확인했다. 아니나 다를까 매니저 형의 문자가 남겨져 있었다. 도형은 문자를 확<br/>
           <br/>
           인하는 동안에도 재촉하는 어머니를 못 이겨 비척비척 일어났다. 화장실로 가면서 혹시 모르니 매니저 형에게 문자를 남겼다.<br/>
           [오늘 일정 있어요?]<br/>
           [형: 어, 우선 내려와] [알겠어요. 금방 씻고 갈게요.]<br/>
           서둘러 내려간 도형은 차량을 찾기 위해 주차장을 돌았다. 도형의 눈에는 주차장에 있는 차량이 거기서 거기처럼 보였다. 한참을 주차장에서 빙글거리던 도형은 겨우 매니저의 차를 찾았다. 매니 저는 여러 연락 때문에 바쁜지 문이 열리는 소리에도 핸드폰 화면만 응시하고 있었다.<br/>
           “형, 많이 기다리셨어요? 어제는 잘 들어가셨고요?”<br/>
           “어, 왔네. 너는 잘 잤어?”<br/>
           “저야 뭐... 방금까지 자다 왔는데요. 그런데 갑자기 무슨 일이에요? 오늘 일정 없지 않아요?” “아, 원래 있던 일정인데 누락됐나 봐. 잠깐만 기다려 봐. 이것만 처리하고 출발할게.”<br/>
           “네.”<br/>
           도형은 매니저 형의 일이 끝나길 기다렸다. 매니저는 얼마나 바쁜지 핸드폰 화면에서 고개를 돌 리지 않았다. 도형의 배에서 꼬르륵 소리가 울리자 그제야 자신이 배고프다는 걸 인식했다. 에너 지 바라도 있으면 좋겠다는 생각에 차 안을 뒤지기 시작했다. 마침 어제 면세점에서 산 과자가 눈앞에 보였다. 한 개만 먹으면 허기 좀 달래겠지. 도형이 소포장된 과자를 꺼내자 그 소리에 매 니저가 입을 열었다. 다른 소리는 다 못 들으면서 이런 소리는 잘 듣는 매니저였다.<br/>
           “도형아, 너 어제도 인터뷰 전에 빵 먹었잖아. 저번에 너 체지방 관리하느라 고생한 거 기억 안 나? 좀만 참자.”<br/>
           “형, 그러면 샐...”<br/>
           “야 인마, 그거 하나 못 참아서 어떻게 하려고.” “그게 아니...”<br/>
           <br/>
           “주니어 졸업한 지 얼마 안 됐는데 벌써 은퇴하고 싶어?” “...”<br/>
           샐러드 사러 가자고 하려 했는데 은퇴 이야기까지 나왔다. 바빠서 핸드폰만 보고 있던 양반이 잔 소리만 늘어놨다. 도형은 제 말만 늘어 놓는 매니저 형이 짜증 났지만 굳이 말다툼을 하고 싶진 않았다. 매니저 형 역시 갑자기 생긴 스케줄에 예민해졌을 것이다.<br/>
           매니저 형이 틀린 말을 한 건 아니다. 피겨 특성상 체중 증가는 곧 은퇴니까. 가뜩이나 살이 잘 붙는 체질이고 감량하기는 힘든 타입이라 식단 관리를 중요시했다. 도형은 자신이 선택한 운동이 니까 제재는 당연한 것이라 생각했다. 하지만 눈길 한 번 안 주던 매니저 형이 비닐 소리만 듣고 저러는 건 짜증이 안 날 수가 없었다. 그는 짜증을 달래기 위해 시트 옆 사이드 포켓에 있는 비 타민 젤리 통을 꺼내 들었다.<br/>
           “너 그거 또 조절 못하고 한 통 다 처먹지 말고.” “...”<br/>
           도형은 매니저의 말에 자신의 입에서 무슨 말이 튀어나올지 몰라서 꾹 다물었다. 뭐가 나왔든 좋 은 말은 아니었을 것이다. 그렇지만 도형의 노력과 달리 표정은 험악했다. 표정을 봤는지 매니저 도 자신이 말을 험하게 했다는 걸 인지하고 바로 차 시동을 걸었다. 도형은 비타민 통을 열지 못 하고 빤히 바라봤다. 귀엽고 알록달록한 곰 모양의 젤리가 와글와글 붙어있었다. 보기만 해도 기 분 좋은 비타민 젤리지만 도형은 비타민 통을 손에서 내려놓았다. 저런 말까지 들으면서 먹기엔 자존심이 상했다. 차라리 잠을 자는 게 낫겠다는 생각이 들었다. 도형은 불편한 가죽 시트에 머리 를 대고 눈을 감았다.<br/>
           ***<br/>
           정신 차릴 새도 없이 일정이 몰아쳤다. 새로운 쇼트 프로그램 안무를 숙지하느라 도형의 몸이 멀 쩡할 날이 없었다. 안무 구성에 4회전 점프를 2개를 하는 건 도형에게 있어 새로운 도전이었다.<br/>
           파워풀한 점프를 선보이던 도형은 이번 프로그램이 자신의 변환점이 될 것이라고 예감했다. 프로 세계에서 쿼드러플 (4회전 점프)는 기본 중의 기본. 도형은 이제 걸음마를 뗀 셈이었다.<br/>
           <br/>
           도형은 새로운 안무가 고될 걸 알았지만 예상외의 복병이 있었다. 바로 체력 문제였다. 쿼드러플 점프를 구사하기 위해서 최대한 가벼운 몸을 유지해야 하지만 경기를 끝까지 할 수 있을 체력도 가지고 있어야 했다. 도형은 안무를 배우기 전까지만 해도 막연하게 할 수 있을 거라는 자신감을 가지고 있었다. 막상 훈련이 계속되자 생각이 많아졌다. 왜 주니어 시절 잘 나가던 선수들이 시니 어가 되면 경기력을 구사하지 못하나 생각했는데 자신이 직접 겪으니 쉽게 생각할 문제가 아니었 다. 도형은 결국 체력 대신 가벼움을 유지하기로 선택했다. 체력은 기르면 되지만 여기에서 쿼드 러플의 감각을 익히지 않으면 선수 생활을 포기하는 것이라고 생각했다.<br/>
           “도형, 손 더 높게! 몸의 곡선을 잘 살리면서 손을 쭉 뻗어야지. 왜 계속 손이 내려가지지?” “넵.”<br/>
           “한번 더 해보자.”<br/>
           도형의 계속되는 실수에 안무가는 고개를 갸웃거렸다. 단일 점프 연습 때는 괜찮아 보였는데 음 악에 맞춰 안무를 하는 도형의 모습이 어딘가 축축 처져 보였기 때문이다.<br/>
           “도형, 무슨 일 있어?” “네?”<br/>
           “점프 연습 때는 괜찮은데 프로그램 전체 연습 때는 체력이 부족한 게 보이네. 식단 관리 잘하고 있지?”<br/>
           도형은 안무가의 말에 웃음으로 질문을 넘겼다. 도형은 그때라도 안무가의 말을 귀담아들었어야 했다. 체력이 떨어지자 프로그램 전체를 수행하는 것이 어려운 건 물론이고 점프가 무너지기 시 작했다. 쿼드러플에 집착하니 콤비네이션 점프에서 자잘한 실수를 하거나 스핀에서 회전 수를 채 우지 못하는 경우도 있었다. 더군다나 휴일도 없이 훈련과 다른 일정을 병행하니 스트레스가 극 에 달았다.<br/>
           도형은 꿈을 꿨다. 쿼드러플 살코, 트리플 토룹 그리고 마지막으로 트리플 악셀. 꿈에서도 연습이 라니 최악이었다. 그래도 여기서는 허기짐이 느껴지지 않았다. 꿈에서라도 배고픔이 가시니 살 것 같았다. 하지만 음악이 들리자 도형은 흔들리기 시작했다. 점프를 실패하기 시작하더니 평소엔 잘 만 뛰던 트리플 토룹 점프마저 넘어졌다. 도형은 같은 꿈을 반복해서 꾸기 시작했다. 하루 종일 꿈에서도 현실에서도 빙판에서 넘어지길 반복하니 자신에게 화가 났다. 그리고 자괴감이 들었다. 피겨가 자신의 길이 아닌 것 같다는 생각까지 들면서 빙판은 도형을 얼어붙게 만들었다. 마치 내<br/>
           <br/>
           세상처럼 활보하던 공간이 순식간에 두려움의 공간으로 바뀌자 도형은 다시 일어설 수 없었다.<br/>
           ‘일어나지 말까?’<br/>
           도형은 일어설 용기가 나지 않았다. 프로그램 음악이 흘러가지만 계속 넘어질 걸 알기 때문에... 도형은 꿈이 미로 같다고 느껴졌다. 절망을 보지 못하면 깨어나지 못하는 미로.<br/>
           ***<br/>
           도형은 대회를 앞두고 한 잡지사와 화보 촬영과 인터뷰를 진행하기로 했다. 대회가 얼마 남지 않 은 상황에 훈련만 해도 모자란 상황에 인터뷰를 일정을 잡은 회사가 생각이 없다고 생각했지만 말이다. 스튜디오에 도형을 기다리던 기자는 눈에 띄는 금발의 머리를 하고 있었다. 도형은 처음 엔 신기했지만 곧 그러려니 여겼다. 기자는 가볍게 인사를 하고 본격적으로 질문을 했다. 프로그 램 소개를 시작으로 훈련 방향, 대회 목표와 구성 기술에 대한 질문을 했다. 여기서 마쳤다면 평 범한 인터뷰와 다를 게 없었을 것이다.<br/>
           “마지막으로 하나만 더 부탁드리겠습니다.”<br/>
           “네, 편하게 말씀해주세요.”<br/>
           “이번 훈련을 하면서 제일 힘들었던 점이 있을까요?”<br/>
           제일 편하지 않은 질문이 도형에게 들어왔다. 자기가 지금껏 들었던 질문 중 제일 날카로운 질문 같았다. 도형은 한참 동안 고민했다. 그리고 겨우 입을 열었다.<br/>
           “이번 대회가 제가 주니어에서 졸업하고 시니어에 올라와서 처음 출전하는 대회라 아무래도 제 역량을 다 못 보일 수 있다는 압박감이 있었던 것 같아요.”<br/>
           “압박감이라면...?”<br/>
           “음... 이게 우스울 수도 있는데 꿈을 꿔요. 링크장에서 넘어지는 꿈을 계속 꾸니까 멘탈이 무너지 는 게 느껴져서, 최근엔 그냥 꿈도 못 꾸게 열심히 훈련 중입니다.”<br/>
           “그렇군요. 제 말이 도형 선수에게 어쭙잖게 여겨질 수도 있지만, 도형 선수가 이루고자 하는 목 표가 강렬해서 꿈에도 그런 현상이 일어나는 거라고 생각해요. 조금 더 여유를 가져도 될 것 같 아요. 대회를 앞두고 여유를 가지라고 말하니까 어색하네.”<br/>
           “하하, 기자님께서 무슨 말씀 하시는지 잘 알겠습니다. 좋은 말씀 감사합니다.”<br/>
           <br/>
           “꿈은 현실이 될 거예요. 노력은 도망가지 않으니 두려워하지 말았으면 좋겠어요.” “...”<br/>
           “좋은 꿈 꾸실 겁니다.”<br/>
           도형은 인터뷰를 마치고 차량에서 이동을 기다렸다. 형이 멍하니 창밖을 바라보자 매니저의 목소 리가 들렸다.<br/>
            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal10",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title10.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title10_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
