<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v22">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    상위 1% 재력과 미모를 탑재한 이 시대의 슈퍼스타 '조광남'
                </p>
                <p class="main-character-text2">
                    "여심을 흔들어 남심의 평화를 깨는 것!"
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">20세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">187cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#치명적#만찢남#자뻑남</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">인터넷방송</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">손짓 한번에 여심을 사냥</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 조광남 이야기</h3>
            [조광남]<br/>
            째깍- 째깍- 째깍-<br/>
            틱,<br/>
            3시, 시침이 정확하게 숫자 3을 가리킬 때, 내 인내력은 바닥났다. 두 시간 전에 약속을 파했 다는 아들이 여태 들어오지 않고 있기 때문이었다. 걱정이 분노로 바뀐 지 오래였다. 불이 꺼 진 거실 쇼파에 앉아 시계만 노려보고 있던 나는 아들에게 전화를 걸었다.<br/>
            “민수야.”<br/>
            [어 아부지! 나 딘 짜! 집 앞! 진짜로!] 뚝-<br/>
            “민수야? 민수야!”<br/>
            “후우”<br/>
            나는 한숨과 함께 팔짱을 끼고 소파에 기대어 앉았다. 막 20살이 된 아들 민수는 요즘 친구들 과 놀다 늦게 들어오는 게 일상이 됐다. 성인이 되어 들뜬 마음은 이해가 된다만, 아버지로서 걱정이 안 될 수가 없었다.<br/>
            요즘 세상이 얼마나 흉흉한데,<br/>
            그때 도어락 소리가 들리며 아들이 들어왔다. 술을 잔뜩 마셨는지 얼굴이 벌게진 채였다. 제 딴에는 취기를 숨기기 위해 애쓰고 있는 듯 했지만 휘청이는 발걸음을 숨길 수 는 없었다.<br/>
            “다녀...와씁니다.”<br/>
            민수는 어둠속에서 살기어린 눈빛을 하고 있는 날 보고는 제 방으로 쏙 들어가려 했으나, 내 부름에 멈춰 설 수밖에 없었다.<br/>
            “박민수, 이리 와서 앉아.” “네에...”<br/>
            민수는 가방을 털썩 내려놓고 내 앞에 앉았다. 가까이 오니 술 냄새가 느껴졌다.<br/>
            “너 즐거운 건 이해하겠다만, 집에서 걱정하는 사람은 생각 안하니” “죄성합니다...”<br/>
            “오래 놀고 싶으면 친구들을 조금 더 일찍 만나면 되잖니” “죄성합니다아...”<br/>
            “요즘 세상이 얼마나 흉흉한지...” “죄성합...”<br/>
            “그냥 들어가서 자!”<br/>
            꾸벅꾸벅 졸며 죄송하다는 말한 반복하는 아들놈을 보자 나는 울컥 화가 치밀어 언성을 높이<br/>
            <br/>
            고 말았다.<br/>
            아들이 방으로 들어가자 거실은 고요했다. 새벽 4시가 가까워 졌지만 잠이 들것 같지 않았기 에 냉장고에서 남은 소주 반병을 꺼냈다. 안주는 콩나물 무침으로 대신했다.<br/>
            짜식, 언제 저렇게 커가지고...좋을 때다.<br/>
            내심 아들의 청춘이 부러웠다. 나의 젊음은 지나간 지 오래였다.<br/>
            밤거리를 거닐며 시덥지 않은 농담을 하며 깔깔 웃고, 패기 넘치게 새로운 일에 몸을 던져보 고, 첫사랑에 아파하기도 하는 청춘. 나에게는 다시 돌아오지 않는 시간이었다.<br/>
            매일 회사로 출근하는 일, 대출금 걱정에 밤을 새우는 일, 잠에 들지 못해 술을 마시는 일이, 조용히 늙어가는 일, 그게 내 인생에 남겨진 부산물이었다.<br/>
            나는 소주 반병을 헤치우곤 쇼파에 누워 그대로 잠들었다.<br/>
            충분한 수면을 취하지 못한 출근길은 지옥 같았다. 어제 급하게 들이킨 소주가 날 더 괴롭게 만들었다.<br/>
            고개를 꾸벅이며 지하철 손잡이를 잡고 서 있는데 앞쪽에서 앳된 목소리가 들렸다.<br/>
            “근데 나 전시회 처음 가 봐...!” “야 나도 처음이야!”<br/>
            어린 여학생 둘이 내 앞의 좌석에서 들뜬 목소리로 이야기 하고 있었다. 한껏 꾸몄지만 여전 히 어린 티가 나보였다. 아마 내 아들 또래정도 일게다.<br/>
            “다음에도 전시 있을 때 같이 가자. 다 보고 강남 가서 맛있는 것도 먹고!” “예쁜 카페 있음 거기도 갈까?”<br/>
            소소한 대화였지만 흐뭇한 미소가 지어졌다.<br/>
            젊을 땐 모든 게 다 새롭고 들뜨지.<br/>
            그 아이들의 설렘이, 기대가 부러웠다. 그런 감정을 느껴보지 못한지 얼마나 됐을까.<br/>
            나는 주위를 빙 둘러봤다. 유난히 젊은 아이들이 눈에 들어왔다. 공부하러 가는 아이도 있었 고, 데이트 중인 아이도 있었다. 여행을 온 듯 보이는 아이들도, 출근길처럼 보이는 청년도 있 었다.<br/>
            그들은 나와 다른 삶을 살고 있는 듯 했다. 젊다 못해 어렸고, 눈엔 활기가 돌았다. 마치 자신 앞에 펼쳐진 무궁무진 한 삶을 뽐내는 것 같았다.<br/>
            나는 절대 가지지 못 할, 그런 삶을.<br/>
            참, 좋겠다.<br/>
            내 마음에 스멀스멀 피어난 부러움, 내지 질투심은 회사를 퇴근할 때 까지 계속 됐다. 나는 그런 내 모습이 우스워 보여 피식 헛웃음을 지었다.<br/>
            나이 54에 무슨 청승이야...<br/>
            <br/>
            라고 생각은 했지만... 이미 머릿속에 깃든 젊음에 대한 갈망은 쉽게 가시지 않았다.<br/>
            조금 충동적이고 싶었다. 그 결과 겨우 내가 한 일이라곤 한 정거장 앞에서 내리는 것이었다.<br/>
            1월의 공기는 꽤 쌀쌀했기에 코트를 더 여몄지만, 얼굴에 닿는 얼음장 같은 바람은 막을 수 없었다.<br/>
            괜한 짓을 해가지고... 카페에서 따뜻한 음료라도 마시다 갈까.<br/>
            나는 몸을 웅크리고 전진하다 우연히 길 건너편의 현수막을 보게 됐다.<br/>
            [청춘을 되찾아 드립니다.]<br/>
            갓 오픈한 미용실인 듯했다. 현수막 옆엔 젊은 모델이 환한 미소를 짓고 있었다. 저런 문구가 먹히기나 하나<br/>
            하지만 이미 발길은 그 미용실로 향하고 있었다.<br/>
            너무 추워서, 추워서 그런 거야, 이 나이 먹고 젊어 보이고 싶어서 온 게 아니고...! 머릿속으로 자기합리화를 하며 나는 미용실 문을 열었다. 히터의 텁텁한 바람이 얼린 코끝을 녹이는 게 느껴졌다.<br/>
            “어머! 어서 오세요! 퇴근길이신가 봐요~ 너무 잘 왔어요. 저희 이번에 오픈했는데....”<br/>
            30대 중반쯤 보이는 샤프한 인상의 남자였다. 두꺼운 뿔테안경이 본인에게 너무 커보였지만 나름의 멋인 것 같았다. 나는 끊임없이 나오는 그의 말에 진저리가 날 때쯤 미용실 의자에 앉 을 수 있었다.<br/>
            “손님 커트 하실 거죠? 어떻게 해드릴까요? 원하는 스타일 있으세요? ”<br/>
            “음...”<br/>
            “지금 스타일이 조금 올드해 보이는 데 제가 좀 손봐드릴게요. 한 20살을 젊어 보일 거예요~”<br/>
            젊어보이게 해달라는 요청이 조금 부끄러웠는데 잘 됐다 싶었다.<br/>
            차칵차칵-<br/>
            가위질 소리에 흰머리가 꽤 많이 자란 머리카락이 바닥으로 떨어졌다.<br/>
            “선생님 젊었을 때 한 인물 하셨죠?” 갑작스런 그의 칭찬공세에 난 조금 민망했다.<br/>
            “허허... 그런 소리 처음 듣는데요? ”<br/>
            “어머 그래요? 인기 많으셨을 것 같은데요? 대학교에 인기 있는 선배 스타일!” “아효 무슨요. 일하느라 바빴지요.”<br/>
            “어릴 때부터 일을 시작하셨나 봐요.”<br/>
            “그런 셈이죠. 18살에 작은 회사 들어가 일 시작했으니까”<br/>
            <br/>
            “어머 어머, 그 꽃다운 나이부터 일을 하셨어요? 너어무 어렸다.”<br/>
            나는 허허 웃음만 지었다.<br/>
            “커트 다 끝났어요 어때요? 훠얼씬 젊어 보이죠? ”<br/>
            엄청난 차이가 있는 건 아니었지만 만족스러운 미소를 지어보였다. 똑같은 얼굴인데 헤어스타일이 바뀐대서 뭐 얼마나 달라지겠는가.<br/>
            “저희 오픈 이벤트로 헤어팩 해드리거든요. 잠깐이면 되니까 앉아 계세요~”<br/>
            미용실 원장은 딱히 내 의사는 묻지 않고 헤어 팩을 바르기 시작했다.<br/>
            “20분만 기다리실게요~”<br/>
            추위에 꽁꽁 얼었던 몸이 녹아서 일까. 나는 폭신한 미용실의자에 앉아 꾸벅 꾸벅 졸기 시작 했다.<br/>
            꿈속에서 나는 18살이었다. 삼촌이 소개해준 작은 농산물 유통회사에 들어 간지 얼마 되지 않 았을 때였다. 유통업에 딱히 관심 있었던 건 아니었다. 단지 돈을 벌 수 있다기에, 무작정 들 어간 곳이었다. 순진무구하고 팔팔한 어린애는 그들의 입맛에 맞는 인력이었다.<br/>
            ‘광남아, 이번에 현장에 가서 일 좀 도와라. 너도 직접 보고 배워야지’<br/>
            사장이 담배를 피며 내게 말했다.<br/>
            ‘네!’<br/>
            나는 활기차게 답했다. 그 순간엔 내가 일을 하고 돈을 번다는 게 너무나도 즐거웠다. 그를 따라 간 곳은 양상추 밭이었다.<br/>
            ‘내일 아침에 물류차 오거든? 그 전까지 수량 맞춰야해.’<br/>
            유통업과는 그리 상관이 없었지만, 인정받고 싶었기에 한나절이 넘도록 양상추를 따다가 날랐 다. 날씨는 추웠고, 밥은 부실했지만 나는 꾀부리는 법도 모르는 아이였다.<br/>
            양상추가 가득 담긴 박스를 옮길 때였다. 요령 없이 힘으로 박스를 들어 올리다 삐끗하는 느 낌과 함께 쓰러졌다.<br/>
            “아!”<br/>
            나는 작은 탄식을 내지르며 잠에서 깨어났다.<br/>
            “어디 불편한 곳 있으세요?”<br/>
            내 소리에 옆에서 청소를 하던 원장이 달려왔다.<br/>
            “아뇨... 안 좋은 꿈을 꿔서 말이죠.”<br/>
            난 여전히 욱신거리는 허리를 매만지며 답했다. 18살, 양상추 박스를 들다 삐끗한 허리가 여 태 말썽이었다. 그러다 거울속의 나를 바라봤다. 달려온 세월만큼 깊은 주름이 이마에 진하게 박혀있었다.<br/>
            <br/>
            ‘그 시절에 후회는 없다만, 아쉬움은 남는 구나.’<br/>
            계산을 위해 카운터로 갔을 때, 원장을 내 코트를 꺼내 건네주며 말했다. “오늘 밤엔 좋은 꿈꾸실 거예요. 꿈이란 건 간절함과 맞닿아 있으니까요.” “그랬으면 좋겠네요.”<br/>
            나는 그의 말을 대수롭지 않게 넘기곤 집으로 향했다.<br/>
            늦은 밤이었다. 어제 잠을 얼마 자지 못해서 인지 일찍이 잠에 들었던 나는 새벽 3시경에 깨 어났다. 요즘 들어 새벽에 깨어나는 일이 잦았다.<br/>
            ‘이러면 내일 또 피곤할 텐데...’<br/>
            난 옆에서 곤히 자고 있는 아내를 내려다보다 조용히 거실로 나왔다.<br/>
            그리곤 습관처럼 소주와 마른안주 몇 가지를 꺼내 식탁에 앉아, 머그컵에 한가득 담긴 소주를 한 모금 마셨다<br/>
            “어우 써!”<br/>
            평소와 다른 맛에 나는 육성으로 소리를 냈다.<br/>
            뭐야, 소주가 상했나? 소주도 상하나...?<br/>
            오늘은 날이 아닌가보다 싶어져 오징어 다리 하나를 질겅이며 화장실로 향했다.<br/>
            볼일을 보고 난 후였다. 손을 씻기 위해 세면대로 갔고, 입으로는 딱딱한 오징어를 짓이기며 고개를 들었다.<br/>
            그리곤<br/>
            “아아아아악!!”<br/>
            입에서 튀어나온 오징어가 바닥으로 떨어졌지만 내 입은 다물어 질 줄을 몰랐다.<br/>
            “이게 뭐야...”<br/>
            나는 세면대를 부여잡고 거울 가까이로 얼굴을 들이밀었다. 거울 속의 소년도 내게 점점 가까 이 다가왔다.<br/>
            “미친...”<br/>
            거울 속엔 18살의 내가 서있었다.<br/>


            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal22",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title22.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title22_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
