<template>
  <div class="content-modal" :class="{ on: showContentsModal === true }">
    <div class="content-character-box v5">
      <div class="main-character">
        <h3 class="main-character-title">
          <img :src="titleUrl" class="pc-only" />
          <img :src="titleUrlMo" class="mobile-only" />
        </h3>
        <p class="main-character-text">
          저음과 고음을 넘나드는 우주 요정 '반이바니'
        </p>
        <p class="main-character-text2">
          “아름다운 목소리로 사람들에게<br />
          다정한 친구가 되고 싶어”
        </p>
        <ul class="main-character-info">
          <li>
            <div class="title">나이</div>
            <div class="text">8세</div>
          </li>
          <li>
            <div class="title">키</div>
            <div class="text">100cm</div>
          </li>
          <li>
            <div class="title">성격</div>
            <div class="text">#귀여움 #자유로움 #평화주의자</div>
          </li>
          <li>
            <div class="title">취미</div>
            <div class="text">역할극</div>
          </li>
          <li>
            <div class="title">스킬</div>
            <div class="text">
              복제초능력으로 사람들에게 순간적인 혼란을 줄 수 있다.
            </div>
          </li>
        </ul>
        <button type="button" class="btn-related" @click="showRelated = true">
          관련작품 보기
        </button>
      </div>
    </div>
    <div class="related-layer" :class="{ on: showRelated === true }">
      <h3 class="title">반이바니 이야기</h3>
      <br />

      늘 사람들에게 꿈과 희망을 주는 놀이동산의 마스코트<br />
      그들 에게도 꿈이 있다면..?<br />
      한철 피는 곳처럼 잠시 사람들에게 스쳐지나가는 행복이 아니라,<br />
      진심이 전해지는 기억의 매개체, 진정한 친구가 되고 싶다.<br />
      <br />
      <br />
      그녀, 그러니까 석고로 이뤄진 단단한 몸을 가진 놀이공원의 마스코트 동상
      말이다.<br />
      그녀가 이곳에 서서 사람을 바라보고 있었던 건 언제부터였을까.<br />
      ‘바니송’이란 이름의 그 동상에 사람을 사랑하는 마음이 깃든 건
      언제부터였을까.<br />
      그녀가 가진 태초의 기억은 어린 날의 추억처럼 흐릿해 얼마나 오랜 시간 동안
      그녀가 그 곳에 있었는지 가늠할 수 없다. 다만 위스크 카라를 두른 토끼동상
      곳곳의 작은 균열들이 긴 시간의 흐름을 짐작케 할 뿐이다.<br />
      <br />
      바니송의 일과는 단순했다. 이른 아침부터 놀이공원을 찾는 이들을 보며 행복에
      젖어 있다가 느지막이 저녁이 다가올 때, 떠나가는 이들을 보며 아쉬워한다.
      그리고 깊은 새벽, 별들만이 어둠을 비출 때, 그날 마주쳤던 모든 이들을
      그리워하는 것. 이게 바니송 삶의 전부였다.<br />
      <br />
      그동안은 그랬단 말이다. 바니송은 최근 마음 한 구석의 일렁임을 느꼈다
      정확히 설명할 순 없었다. 간지럽기도 했고 답답하기도 했고, 때로는
      고통스럽기도 했다. 작은 벌레가 빈 석고상의 내부를 돌아다니는 기분이었다.
      가을의 서늘한 바람이 원인인 것 같기도 했다.<br />
      바니송은 어둠속에 우두커니 서 이 감정의 시작에 대해 고민했다.<br />
      <br />
      일주일 전이었다. 놀이공원 입장을 기다리는 인파 사이에서 한 아이가 불쑥
      튀어나왔다. 그 뒤로 아이의 아버지가 뒤따라왔다. 아이는 환한 미소를 지으며
      바니송에게 달려왔다.<br />
      “바니송! 바니송이야! 아빠 여기 바니송이 있어.”<br />
      <br />
      피곤한 안색을 한 아이의 아버지는 아이의 말에 지긋이 웃으며 카메라를
      꺼냈다.<br />
      “그래 바니송이네! 민현아 여기 봐. 아빠가 사진 찍어줄게.”<br />
      <br />
      아이는 짧은 팔로 바니송의 몸을 꽉 끌어안았다. 맞닿은 몸에서 아이의 미미한
      온기가 느껴졌다. 아이와 아버지는 영업시간이 다 끝날 때쯤에 놀이공원을
      나왔다. 사람들이 떠나고 조용한 입구를 걸어가던 아이는 살짝 몸을 틀어
      바니송 바라봤다. 아이는 마치 그녀가 자신의 친구라도 된 냥, 손을 흔들어
      인사를 건넸다.<br />
      분명 그 순간이었다고 그녀는 생각했다. 그 순간 이 요상한 감정이 바니송의
      내면으로 불쑥 찾아온 것이다. 아이의 웃음을 바라보며, 아이가 흔드는 작은
      손을 보며, 그 아이의 빛바랜 사진 속의 추억으로만 남고 싶지 않았다.<br />
      <br />
      ‘내게 두 다리가 있었다면, 따듯한 온기를 가진 몸이 있었더라면 당장 자리를
      박차고 달려 나가 아이의 손을 잡았을 텐데. 그리고 아이의 일상 속에
      스며들고, 아이가 자라는 모습을 지켜 보겠지.’<br />
      <br />
      바니송은 문득 깨달았다.<br />
      <br />
      ‘이 감정이 바로 욕심이구나. 내가 욕심을 가지고 말았구나.’<br />
      <br />
      “아직도 한심한 생각을 하는 중이냐”<br />
      <br />
      목소리의 주인은 바니송 옆에 서있는 키티송이었다. 화려한 삐에로 옷차림의
      까만 고양이 동상 키티송은 바니송과 함께 긴 시간을 보냈음에도 그녀와
      정반대의 성격을 가지고 있었다. 매사에 비관적이었고 인간을 사랑하는
      바니송을 비웃었다.<br />
      키티송은 떠나가는 아이에게서 눈을 떼지 못하는 바니송에게 말했다.<br />
      <br />
      “그들이 널 보고 즐거워하는 건 순간일 뿐이야. 뒤돌아 일상으로 돌아가면 우리
      같은 건 기억도 않을 테지.”<br />
      “그게 뭐, 그게 뭐 어떻다고. 한순간의 추억이 되는 것도 좋은 걸”<br />
      “거짓말, 이뤄지지 못할 꿈을 꾸고 있으면서. 내가 그렇게 말했잖아. 그들을
      사랑하지 말라고,”<br />
      바니송은 그의 말을 차마 부정할 수 없었다.<br />
      “바니송 네가 좋아할 만한 정보를 주지.”<br />
      <br />
      그렇게 말하는 키티송은 재밌는 일을 발견한 것처럼 들떠있었다.<br />
      “퍼레이드에서 쏘는 불꽃이 가장 높이 올라갔을 때, 그 불꽃을 향해 몸을
      던지면 사람이 될 수 있대”<br />
      “뭐? 정말이야?”<br />
      “그래, 저번에 이 근방을 떠돌던 검은 고양이 기억나지? 그 친구가 내게
      말해줬어. 요즘은 안 보이는 걸 보면 벌써 사람이 됐을지도 모르지.”<br />
      “키티록, 고마워...정말 고마워!”<br />
      <br />
      그날 밤이었다. 경쾌한 음악과 사람들의 웃음소리가 놀이공원 안에서 들려왔다.
      이윽고 퍼레이드의 대미를 장식하는 폭죽 소리가 들려왔다. 바니송은 온 신경을
      하늘의 불꽃에 쏟았다. 그리고 하늘의 가장 높은 곳에 피어난 불꽃을 향해 몸을
      날렸다.<br />
      덜컹-<br />
      동상이 미세하게 흔들리며 소리를 낼뿐 어떤 일도 일어나지 않았다. 석고
      동상인 바니송의 몸이 떠오를 리가 없었다. 약간의 흔들림만이 있었을
      뿐이다.<br />
      “아아...그래, 내 몸은 길거리를 떠도는 고양이와는 다르지.”<br />
      <br />
      슬픔에 잠긴 바니송을 지켜보던 키티록은 그녀의 우스꽝스러운 모습을 보고
      조소를 지었다.<br />
      ’간만에 꽤 재밌는 구경거리가 되겠군.‘<br />
      그는 빠르게 웃음을 지우고 바니송에게 말했다.<br />
      “바니송, 인간이 되는 일이 쉬웠다면 모두가 이 방법을 써서 인간이
      됐겠지.”<br />
      “하지만 난 애초에 움직일 수도 없는 몸인 걸, 어떻게 하늘을 향해 몸을
      날리겠어...”<br />
      바니송은 한껏 의기소침해 져 있었다.<br />
      <br />
      “아냐, 방금 네가 뛰어오를 때, 네 몸이 조금 덜컹거리는 소릴 들었어. 매일
      밤, 간절함을 가지고 뛰다보면 이 세계를 창조한 ‘신’이란 존재가 네 염원을
      이뤄줄지도 모르지”<br />
      “매번 고마워 키티록,”<br />
      슬픔이 묻어나던 바니송의 얼굴에 금세 환한 웃음이 피어났다.<br />
      <br />
      그날 이후 그녀는 매일 밤 불꽃을 향해 몸을 던졌다. 물론 그녀의 마음처럼
      되진 않았다.<br />
      수 백, 아니 수 천일은 흘렀을 테다. 바니송은 지칠 줄도 모르고 매일 밤 몸을
      내던졌다. 물론 그곳을 지나가는 그 누구도 그녀의 노력을 알지 못했다. 하지만
      그 시간동안 바니송의 몸엔 아무도 눈치 채지 못할 작은 변화가 일어나고
      있었다. 텅 빈 석고상의 안쪽에 균열이 생기기 시작한 것이다. 석고상을 가르는
      금들은 점점 퍼져나갔다.<br />
      <br />
      키티록은 밤마다 뛰려고 애쓰는 바니송을 지켜보는 일도 슬슬 지겨워졌다. 그는
      이제 바니송의 간절한 꿈을 깨부숴보자는 생각을 했다. 절망에 빠진 그녀를
      보는 것도 꽤나 재밌는 일이 될 것 같았다.<br />
      “야 바니송 이제 좀 그만해, 그런다고 네가 인간이 되진 않아.”<br />
      “무슨 소리야? 네가 간절함을 가지고 매일 밤 뛰다 보면 인간이 될 거라고
      했잖아”<br />
      “그런 헛소릴 믿다니, 네 덕분에 심심한 일은 없다니까. 모두 다 거짓말 이었어
      모두 다. 넌 평생 이곳에서 발이 묶인 채 지나가는 인간들만 보고 있겠지.”<br />
      바니송은 말이 없었다. 울지도 화를 내지도 않았다.<br />
      <br />
      그날 밤이었다. 바니송은 오늘도 밤하늘을 바라봤다. 밝게 빛나는 별 하나가
      그녀를 내려다 보고 있었다.<br />
      <br />
      ‘당신이 날 보고 있다면, 내 간절함도 보이시겠죠’<br />
      <br />
      바니송의 기도와 함께 폭죽이 터지기 시작했다.<br />
      그녀는 불꽃의 틈새에게 가장 높은 곳에 피어나는 불꽃을 기다리고 있었다. 곧
      큰 소리와 함께 작은 빛줄기가 솟아올랐고, 거대한 보라색 불꽃으로 피어났다.
      바니송은 하늘을 향해 뛰어 올랐다.<br />
      신이 그녀의 기도를 들어줬던 것일까.<br />
      <br />
      늘 꿈쩍도 않던 그녀의 몸이 움직였다. 바니송은 기대에 찬 표정으로 하늘을
      바라봤다. 그 순간, 그녀의 몸은 수백 개의 작은 조각들로 변해 바닥으로
      떨어졌다.<br />
      오랜 시간동안 충격을 버텨온 몸이 부서져버린 것이다.<br />
      <br />
      “한심한 자식”<br />
      <br />
      비웃음이 가득한 키티록의 목소리를 들으며 바니송은 천천히 눈을 감았다.<br />
      흰 공간이었다. 끝이 보이지 않는 하얀 공간에 바니송은 늘 그렇듯 우두커니
      서있었다.<br />
      실패한 걸까. 키티록의 말대로 불가능한 일이었구나. 이곳은 어딜까. 사람들이
      겪는다는 죽음이 내게도 온 걸까.<br />
      이런저런 생각을 하고 있을 때였다. 한 아이가 흰 공간 속으로 빼꼼 얼굴을
      내밀었다.<br />
      <br />
      ‘저 아인... 그때 그 아이...!’<br />
      <br />
      바니송은 자신의 마음속에 간절한 염원을 불어놓고 간 아이를 떠올렸다.<br />
      <br />
      “안녕!”<br />
      아이는 쾌활한 목소리로 인사했다.<br />
      ‘안녕 오랜만이야.’<br />
      반가운 마음에 아이를 와락 껴안고 싶었지만 몸은 여전히 움직이지 않았다.<br />
      아이는 바니송의 주위를 한바퀴 빙 돌며 그녀를 찬찬히 살폈다. 그러다 앳된
      목소리로 말하기 시작했다.<br />
      <br />
      “네가 간절히 원했잖아. 그런데 뭘 겁내고 있는 거야. 그렇게 있지 말고 어서
      날 따라와”<br />
      <br />
      바니송의 손을 살포시 잡아주던 아이는 자신이 들어온 곳을 향해 뛰어가기
      시작했다.<br />
      <br />

      <button type="button" class="modal-close" @click="showRelated = false">
        <span class="blind">닫기</span>
      </button>
    </div>
    <button
      type="button"
      class="modal-close"
      @click="$emit('update:visible', !showContentsModal)"
    >
      <span class="blind">닫기</span>
    </button>
  </div>
</template>

<script>
import { reactive, toRefs } from "vue";

export default {
  name: "CharacterModal5",
  emits: ["update:visible"],
  props: {
    showContentsModal: {
      type: Boolean,
      default: false,
    },
    title: {
      type: String,
      default: "",
    },
  },
  data() {
    return {
      showRelated: false,
    };
  },
  setup() {
    const state = reactive({
      titleUrl: require("@/assets/image/region1/bg_char_title5.png"),
      titleUrlMo: require("@/assets/image/region1/bg_char_title5_mo.png"),
    });
    return {
      ...toRefs(state),
    };
  },
};
</script>

<style scoped></style>
