<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v3">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl">
                </h3>
                <p class="main-character-text">
                    러블리한 외모에 그렇지 못한 털털함과<br>
                    화끈한 성격을 가진 불량소녀,
                </p>
                <p class="main-character-text2">
                    “미움을 뱉는 입보단<br>
                    듣는 귀가 나아”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">20세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">165cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#자유분방 #도전적 #흥부자 #엉뚱함</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">메이크업, 쇼핑</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">물감총을 활용한 컬러풀한 그래피티</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 삐뚜르 빼뚜르 이야기</h3>
            <br/>
            장례식장은 무서우리만치 조용했다. 통곡하는 소리마저 없었다. 사람들은 부조금을 내고, 꾸벅 인사만 건네고 종종걸음으로 식장을 빠져나갔다.<br/>
            나또한 그들처럼 조문객으로서의 역할을 다하고 후련하게 떠나고 싶었지만 그럴 수 없었다.<br/>
            나는 타오르는 향을 들고선 영정사진을 올려봤다. 액자 속엔 규현의 앳된 사진이 들어가 있었 다. 20대 중반 쯤 찍은 사진 같아 보였다. 스트라이프 셔츠를 입고 활짝 웃고 있는 규현의 미 소에선 어째선지 해방감이 묻어나 보였다.<br/>
            규현과 나는 24살 초겨울, 홍빈의 소개로 만났다. 의과대학 동기인 홍빈은 같이 밴드를 만들 자며 규현을 당시 아지트로 쓰이던 내 자취방으로 데려왔다. 치대생이던 규현은 말이 없고 조 용한 친구였다. 홍빈보다 일찍 내 자취방에 도착한 규현은 현관에 한참 서 5평 남짓 안 되는 지저분한 방을 둘러보다 나지막한 목소리로 ‘집이 참 좋네요.’하고 말했다. 들어와서 앉으라는 내 말에 신발을 벗고 가지런히 정리해두곤 탁자 앞에 앉았다. 난 첫 만남에 규현이 마음에 들 었다. 그가 연주하는 베이스도 그와 닮아 있었다. 낮고 여리지만 속을 울리는 음색이었다.<br/>
            우리는 일주일에 두세 번은 만나 함께 연주했다. 나는 보컬을, 규현은 베이스를 홍빈이란 친 구는 드럼을 쳤다. 모두 의과 대학에 재학 중이라 밴드이름을 ‘닥터 피쉬’로 정했다. 두 명의 친구가 더 들어와 밴드의 구색을 맞추긴 했으나 실력은 형편없었다. 규현만은 베이스를 꽤 잘 연주했는데, 그는 우리의 실력에 딱히 불평하지 않았다. 모두에게 밴드활동은 지겨운 공부에 서 벗어날 수 있는 일탈일 뿐이었다.<br/>
            마땅한 연습장소가 없었으므로 홍대의 합주실을 대여하지 못했을 땐 그냥 집에 둘러앉아 살인 적인 의과대학의 공부량을 욕했다.<br/>
            몇몇이 군대로 떠나고 몇몇은 인턴 생활을 시작했다. 우리의 모임을 점차 줄었고, 사실상 밴 드는 해체 됐다고 볼 수 있었다. 자취방이 가까웠던 규현과 나만이 종종 만나 노래방을 가거 나 술을 마셨다. 이마저도 규현이 대학 졸업 후 본가로 내려가며 마무리 지어졌다. 우리들의 젊은 날의 인연은 여기서 종결되는 줄 알았다.<br/>
            30즘 되었을 때였다. 정신과를 선택한 나는 인턴생활로 한창 정신없는 시간을 보내고 있었다. 고단한 업무에 출근과 퇴근의 경계도 사라지고 있었다. 어느 날 저녁 규현으로부터 문자 한통 이 날아왔다. 근 1년 반 만의 연락이었다.<br/>
            [오랜만에 술 한 잔 할까.]<br/>
            갑작스러운 연락이었기도 했고 그동안 누적된 피로 때문에 거절할까 하다 무슨 일이 있나 싶 어 그가 있는 곳으로 갔다.<br/>
            대학생 때 자주 가던 허름한 선술집이었다. 내부 인테리어를 바꿨는지 어설프게 세련된 선술 집에 규현이 고개를 꾸벅거리며 앉아 있었다. 내가 도착하기 전부터 혼자 술잔을 기울인 모양 이었다. 취기가 올라 얼굴에 붉은기가 도는 그 앞에 앉으며 무슨 일 있냐고 걱정스레 물어봤 지만 내 물음에 그는 헤실헤실 웃으며 일은 무슨, 얼굴 한 번 보고 싶어서. 라고 대수롭지 않 은 척 답했다. 그와 나는 한참을 말없이 술잔을 채웠다. 1년 반이란 시간은 우리 사이에 여백<br/>
            <br/>
            <br/>
            을 만들기에 충분했었다. 오랜만에 만난 그는 어딘가 낯설어보였다. 마른안주를 뜯으며 벽의 오래된 낙서를 살피고 있는 나에게 규현은 말했다.<br/>
            “넌 그 일이 좋니.”<br/>
            내가 고민을 끝내고 답을 하기도 전에 규현이 말을 이었다.<br/>
            “나는, 싫다.”<br/>
            처음 듣는 이야기였다. 물론 우리가 깊은 이야기를 나누던 사이도 아니었기도 했고, 규현은 자기 속내를 잘 털어놓는 아이도 아니었다.<br/>
            “나는 음악이 하고 싶었거든. 근데<br/>
            할 수가 없었어. 웃기지 왜 내가 음악 못했는지 아니. 돈 못 벌어서? 음악에 재능이 없어서? 뭐 그런 이유도 있긴 한데.”<br/>
            나는 규현의 입에서 우수수 쏟아져 나오는 말들을 가만히 듣고만 있었다.<br/>
            “부모님 때매 그렇다. 이 나이 먹고 부모님 핑계되는 거 웃기긴 한데…”<br/>
            규현의 피식 웃고는 계속해서 말했다.<br/>
            “재우야, 나 치대 붙었을 때, 맞아 죽는 줄 알았다, 의대 못 갔다고. 삼수하라는 거 내가 진짜 못하겠다고 빌고 빌어가지고 치대 등록했다. 내가 음악 하고 싶다고 얘기라도 꺼내면 난리가 났어. 엄마는 자식 잘못 키웠다고 다 자기 잘못이라면서 죽겠다하고 아빠는 딴따라 될 거면 연 끊자고 하고.”<br/>
            규현의 눈빛은 공허했다. 한풀이를 위해 속내를 터놓는 사람의 눈빛은 아니었다.<br/>
            차라리 울었으면, 힘들다고 펑펑 울고 도와달라고 했으면 내 마음이 더 편했을 것이다.<br/>
            “이런 이야기 불편하제.”<br/>
            규현은 경상도 사투리를 섞어서 말했다. 취했을 때의 습관이었다.<br/>
            “아냐. 얘기해 줘서 고마워.”<br/>
            어떤 말을 더 해야 할지 고민했다. 학교를 다니며 배웠던 이론은 다 부질없다는 생각을 했다. 그래도 무슨 위로나 아니면 그 비스무리 한 거라도 해야겠다는 생각으로 규현의 술잔을 채우 며 말했다.<br/>
            “많이 힘들면 나 찾아와. 약 처방 받아줄게.”<br/>
            다음번 규현을 만난 건 2년이 지나서였다. 고향에 치과를 개업했다는 소식이었다. 부모님 노 후자금에 대출을 얹어 건물을 지었다고 했다. 그 연락이 썩 달갑지 않았다.<br/>
            25살의 그가 내 자취방에 앉아 베이스 기타를 애지중지 닦던 모습이 생각이 나서였을 테다. 일 년 동안 과외로 번 돈을 모아 장만 한 기타라고 했다. 하지만 그는 오묘한 푸른색의 새 베 이스기타를 몇 번 들지도 않았다. 아깝다는 이유로 합주엔 중고로 싼값에 구한 베이스를 들고 다녔다.<br/>
            규현아. 너 괜찮나.<br/>
            문자를 쓰다 지우고 다시 썼다.<br/>
            [축하 한다 짜식, 돈 많이 벌어라. 연락 좀 자주 하고]<br/>
            며칠 뒤 찾아간 규현의 병원은 내 기억 속에 또렷이 남아있다. 입구에 푸른빛의 베이스 기타 가 반항하듯 걸려있었기 때문이다.<br/>
            <br/>
            <br/>
            개업한지 3년 정도가 흘렀다.<br/>
            그리고 어젯밤에 그의 소식이 들려왔다.<br/>
            규현이가 죽었다고. 늦은 밤에 혼자 진료실 의자에서, 한 손에는 사제 권총을 쥐고서.<br/>
            끄흡, 끄흑,<br/>
            누군가 악에 받친 울음을 먹고 있었다. 그 소리에 나는 정리되지 않은 추억의 더미에서 빠져 나올 수 있었다. 소리가 들려오는 곳엔 규현의 어머니가 쪼그려 앉아 있었다. 그녀는 결코 통 곡하지 않았다. 고문을 당하는 공작원 같은 표정을 하고선, 눈의 실핏줄이 터져 벌건 눈을 부 릅뜨고선, 결코 소리 내 울지만은 않았다. 그럴 만도 하다. 나는 씁쓸한 표정으로 빈소를 빠져 나왔다.<br/>
            2월의 공기는 차가웠지만 하늘은 쾌청했다. 차라리 비라도 쏟아지길 빌었다. 유달리 맑은 날 씨가 원망스러웠다.<br/>
            서울까지 가는 버스는 드문드문 있었다. 난 우등버스를 보내고 40분 늦게 있는 일반버스에 탑 승했다. 5시간 동안 비좁은 좌석에서 몸을 웅크리고 있어야 했지만 오늘만큼은 내가 편치 않 았으면 하는 바람이었다.<br/>
            치과 개업 후 만난 규현은 지쳐보였다. 괜찮냐는 물음에 그는<br/>
            ‘하루 종일 청록색 천으로 눈이랑 코를 가린 사람의 입 속을 들여다보는 게 썩 유쾌하진 않 아.’<br/>
            하고 답했다. 나는 그가 삶과 죽음의 경계선 위에서 줄타기를 하고 있다고 느꼈다. 그는 작은 바람에도 휘청거렸다.<br/>
            난 그런 규현을 두고 다음날 일찍 서울로 떠났다. 병원에서 날 기다리는 환자들이 있기 때문 이었다. 그들의 우울을 살펴야 했고 약을 처방해야 했다.<br/>
            미필적 고의, 이런 것도 미필적 고의 아닌가. 우울지수가 높은 환자를 남겨두고 그렇게 떠나 버렸으니 이건 또 의사의 직무유기 아닌가.<br/>
            버스의 히터가 차가운 공기를 데웠다. 밤을 새고 아침 첫차를 타고 온지라 이 상황에서도 눈 이 감겼다. 난 죄책감에 절여진 채로 잠에 들었다.<br/>
            꿈속에서 규현과 나, 홍빈을 포함한 닥터 피쉬 친구들은 부산 광안리에 있었다. 과거 젊은 날 의 치기처럼 악기 하나씩을 들고 부산으로 내려갔을 때였다. 우리는 겨울 바다 앞에서 버스킹 을 했다. 사람들 몇몇이 우리 앞에 앉아있다 노래 한 곡이 끝나기도 전에 자리를 떴다. 그럼 에도 우린 계속 연주했다. 난 마지막 곡을 부르다 뒤를 돌아봤다. 빨갛게 언 손으로 베이스를 연주하던 규현이 나와 눈이 마주치자 씨익 웃어보였다. 맑고 따스한 미소였다. 우리는 늦은 밤 편의점에서 컵라면을 끓여 먹었다. 라면이 익기를 기다리며 코를 훌쩍이던 규현이 내게 말 했다.<br/>
            “네 노래 소리는 참 위로가 된다. 잘 부르는 것도 아닌데.”<br/>
            규현의 말에 다른 친구들이 무슨 사내새끼가 오글거리는 이야기를 하냐며 핀잔을 줬지만 난 꽤나 기분이 좋았다.<br/>
            <br/>
            <br/>
            이곳저곳을 떠돌다 새벽 5시쯤이 되었다. 첫 차를 기다리는 데 규현이 내 옆에 슬며시 와 앉 았다.<br/>
            “재우야. 나 때문에 죄책감 가지지 마.”<br/>
            난 뒤통수를 세게 맞은 기분이었다. 이 기억은 내겐 없던 것이니까.<br/>
            “좋은 꿈 꿔.”<br/>
            규현은 그 말을 남기고는 후련하다는 표정으로 사라졌다. 규현과 함께 사방의 사물들도 점점 희미해지고 있었다. 곧 밀려들어온 어둠속에 모든 게 잠겼다. 난 그 어둠 속에서 몸을 웅크리 고 있었다. 아까 본 규현의 잔상이 머릿속을 맴돌았기 때문이다.<br/>
            그때 스포트라이트가 내 위로 쏟아졌다. 갑작스런 밝은 빛에 난 눈을 가늘 게 떴다. 내 앞에 놓인 마이크 하나가 보였다.<br/>
            ‘뭐지...? 왜 마이크가...’<br/>
            나는 본능적으로 마이크를 잡았다. 쇠의 차가운 촉감이 손끝으로 와 닿는 게 느껴졌다. 꿈이라기엔 너무나도 생생했다.<br/>
            딩 딩딩 --<br/>
            저편에서 리듬감 있는 옅은 울림이 느껴졌다. 베이스 소리였다. 어둠 속에서 누군가 홀로 연 주를 하고 있다는 생각에 서글퍼졌다. 규현이 떠올라서였을까. 난 베이스의 리듬에 맞춰 호흡 을 가다듬다 입을 땠다.<br/>
            마이크를 통해 목소리가 퍼져나갔다.<br/>
            길을 걸었지 누군가 옆에 있다고 느꼈을 때 나는 알아 버렸네.<br/>
            이미 그대 떠난 후라는 걸<br/>
            나는 혼자 걷고 있던 거지<br/>
            희미했던 베이스 소리가 점점 커졌다. 단순한 리듬이었던 울림이 이젠 내 노래에 맞춰 연주하 기 시작했다.<br/>
            갑자기 바람이 차가와지네<br/>
            마음은 얼고 나는 그곳에 서서 조금도 움직일 수 없었지.<br/>
            칠흑 같던 어둠이 점점 걷히기 시작했다. 꾸역꾸역 참아왔던 눈물이 밀려올라왔다. 죄책감의 뒤에서 숨죽이고 있던 슬픔이었다.<br/>
            저편에서 연주하고 있는 베이스의 주인이 보이진 않았지만 난 규현이라고 믿고 싶었다. 규현이 아니더라도, 그 누구라도 좋았다. 누군가의 슬픔을 내가 다 가져갈 수 있다면, 내 노래 를 듣고 작은 위로를 받을 수 있다면. 그것만으로 됐다고 생각했다.<br/>
            마치 얼어버린 사람처럼 나는 놀라 서있던 거지. 달빛이 숨어 흐느끼고 있네.<br/>
            <br/>
            <br/>
            목소리가 갈라졌다. 비릿한 피 맛이 목에서 올라왔지만 난 노래를 멈추지 않았다. 누군가 이 노래를 듣고 행복하길 바라며.<br/>


            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal3",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title3.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
