<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v17">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    내 여자와 국가는 내가 지킨다! 전설의 비밀 요원, '특수요원 진'
                </p>
                <p class="main-character-text2">
                    “일과 사랑을 다 잡은 제임스본드,<br />같은 남자를 꿈꾼다.”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">비밀</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">180cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#꼰대#우정#의리</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">해킹,마피아게임</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">학용품으로 만든 특수장비 사용</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 특수요원 진 이야기</h3>
            특수요원 진 (Agent Jin)<br/>
            전쟁터에서 얼빠져 죽은 놈들이 많다. 시체 밭에서 정신 차리기는 훈련을 받은 군인도 어려운 일 이니까. 더군다나 자신의 동료의 시신이 즐비한 곳에서 그러기엔 더 어렵다.<br/>
            삐-<br/>
            왼쪽 귀에서 이명 소리가 들렸다. 총신의 반동으로 오른쪽 어깨는 감각이 없어진 지 오래다.<br/>
            곳곳에 폭탄이 터지는 소리가 울려 퍼졌다. 귀가 멀기 딱 좋은 장소이다. 진의 친했던 이들은 전 쟁으로 이미 세상을 떠난 지 오래다. 그가 지금까지 살아남을 수 있었던 이유는 그들의 유언 때 문이었다.<br/>
            “진, 피해!” 목소리가 들렸다. 진은 본능적으로 몸을 날렸다. 곧이어 진이 있었던 자리에 폭발음이 들리고 흙먼지가 날렸다. 방어전선 언덕 아래 참호로 굴러 떨어진 진은 빗발치는 총알을 피하기 위해 몸을 웅크렸다.<br/>
            “진! 괜찮아?”<br/>
            네이슨은 죽은 동기들과 같은 훈련소 출신으로 목소리의 주인이다. 우리 중 가장 능력이 뛰어난 에이스이며 모두를 이끄는 리더 같은 존재였다. 네이슨은 언덕 위에 머리를 내밀어 진을 확인하 려 했다. 언제 포격이 쏟아질지 모르는 상황에 네이슨은 진의 무사를 확인하려고 무모한 짓을 행 했다. 진은 네이슨의 단독 행동에 기겁했다. 진은 자신이 죽을지 언정 네이슨을 잃을 수 없었다.<br/>
            “네이슨, 난 멀쩡하니까 빨리 이곳에서 벗어나!” “기다려, 금방 부축해 줄 테니까.”<br/>
            “임무상황에 무슨 개소리야 빨리 쳐 나가라고!”<br/>
            네이슨은 기어코 언덕 아래 참호로 내려왔다. 자신을 어깨에 들쳐 멨다. 진은 내려놓으려고 바둥 거렸지만 이내 멈췄다. 포격이 시작되면 끝이기 때문에 빨리 이곳에서 벗어나는 게 맞다는 생각<br/>
 <br/>
            이 들었기 때문이다.<br/>
            “네이슨, 동남쪽으로 500m 가면 방어 진지가 있을 거야.”<br/>
            “그래, 거기로 가는 중이야.”<br/>
            “에이스, 내 다리가 부러진 것도 아닌데 좀 내려 주시지?” 진은 투덜거리며 말했다. “부축하는 것보다 빠르니까 잔말 말고 가만히 있어.”<br/>
            네이슨은 그렇게 말하곤 진을 다잡았다. 들썩거리는 움직임에 진이 신음이 절로 나왔다.<br/>
            ***<br/>
            진과 네이슨은 진지까지 얼마 남지 않은 참호에서 멈춰 몸을 낮추고 상황을 지켜봤다. 방어 진지 를 지키는 경계병이 보였다. 경계병은 굳은 자세로 정면을 바라보고 있었다. 둘은 피아식별 띠가 잘 보이도록 먼지를 털었다. 이제 남은 건 직진뿐이었다.<br/>
            “가자.” 비장한 목소리가 들렸다. 진은 고개를 끄덕였다.<br/>
            네이슨이 진을 부축해 참호에서 나오려던 순간, 갑자기 경계병의 태세가 변했다.<br/>
            진은 불안했다. 초조함에 네이슨과 눈을 마주치자 포격 소리가 들려왔다. 공포스러운 폭발음과 함 께 네이슨이 날아가는 모습이 슬로우모션처럼 보였다.<br/>
            진은 농담처럼 뱉은 말이 실제가 될 거라고 상상도 못 했다. 이미 죽음에 익숙해졌다고 생각했지 만 자신이 뱉은 말에 책임을 지라는 듯 소중한 이의 목숨을 빼앗아 갈 줄 몰랐다. 진은 폭발로 넝마가 된 발을 끌어 네이슨이 쓰러진 곳으로 기어갔다. 제발, 제발 살아있어라.<br/>
            네이슨은 직격은 피했지만 파편과 화기로 인해 죽어가고 있었다. 흙먼지 속에서 인기척이 느껴졌 다. 네이슨은 인기척으로 진이 목숨에 위협이 될 만한 부상을 입지 않았다는 걸 알 수 있었다. 먼 지 속에서 진의 얼굴이 보이자 네이슨은 웃음을 보였다. 방금까지만 해도 툴툴대던 진이 눈물범 벅이 되어있었다. 네이슨은 죽음의 고통에도 자신을 위해 울어주는 이가 있다는 것이 위안이 됐 다. 그는 먼저 떠난 동기들이 진에게 유언을 남긴 이유를 알 수 있었다.<br/>
 <br/>
            “한국인은 죽으라는 농담을 쉽게 하더니 눈물도 쉽네. 이봐 진, 부탁이 있는데 가까이 좀 와봐.”<br/>
            이 상황에서도 웃는 네이슨을 이해할 수 없었다. 진은 네이슨의 복부에 큰 출혈이 나는 걸 발견 했다. 자신을 밀어내느라 파편을 피하지 못 한 게 분명했다.<br/>
            “시발, 이 상황에 뭔 개소리야! 빨리 지혈해. 지혈하라고!” “진은 정말 웃기다니까. 그동안 받아줘서 재밌었어.”<br/>
            “입 다물어!”<br/>
            “다들 왜 마지막 말을 진한테 남기고 갔는지 이해가 되네.” “너 그딴 말하면 진짜로 죽여버릴 거야”<br/>
            “거봐 재밌잖아.” 진의 눈을 마주하며 말하던 네이슨의 시선이 어깨너머의 어딘가를 응시했다. “나는 네가 오래 살았으면 좋겠어. 이런 전쟁터에서 살지 말고 네 꿈을. 네 인생을 살아.”<br/>
            그 말을 마지막으로,<br/>
            콰광-! 쾅!<br/>
            폭발음과 함께 그날의 기억은 거기서 끝이었다. 모두가 자신이 살아남은 게 기적이라며 말했다. 방어 진지까지 적진의 공격이 들어왔다고 전해 들었다. 방어 진지에서 가까운 위치에서 발견되어 빠른 구조가 가능했다고 하지만 진은 자신이 그날 죽어야 했다고 생각했다. 친우를 죽음으로 몰 고 간 망령은 죽지 못해 살아갔다. 진은 네이슨의 죽음 이후 자신의 목숨이 아깝지 않았다. 빨리 누군가 자신을 죽여주길 바랐다. 혼자 죽지 못해 사는 겁쟁이는 용병으로 활동했다. 전장을 떠날 수 없는 몸이라면 떠돌이 인생이 더 나았다.<br/>
            진은 발이 닿는 대로 떠났다. 특수요원 출신 용병은 널리고 널렸지만 진은 독보적이었다. 누구와 도 팀을 이루지 않고 임무를 완수하기 위해서 어떤 수단이든 상관하지 않기로 유명했다. 그런 진 을 자기 소속으로 데려가기 위해 많은 움직임이 있었지만 끝내 진을 포섭할 수 없었다. 꾸준히 진에게 다가가려는 사람은 있었지만 진은 그들을 철저하게 외면했다.<br/>
            진은 회사의 임무로 산소가 희박한 땅 구덩이 속에서 호흡을 조절하며 물만 섭취하며 버텼다. 작 전지를 알아내기 위해 열흘 동안 버틸 수 있었던 건 그때 꾼 꿈 덕분이었다. 전쟁이 없는 평화로 운 곳에서 친우들과 함께 자유롭게 학교를 다니는 꿈이었다. 모국에 있는 학교에서 교복을 입고 간식거리를 입에 물고 있는 모습을 본 진은 자신의 상상력에 감탄했다. 학교 생활을 해본 적도 없는 자신이 수업을 듣고 있었다. 그곳엔 네이슨도 있었다. 5년 전 모습으로 웃고 있는 네이슨을 보니 꿈에서 깨고 싶지 않았다.<br/>
 <br/>
            이곳에서 깨어난다면, 자신은 다시 혼자가 될 테니까. 꿈을 꾼 진은 긴 잠을 자고 싶었다.<br/>
            진은 임무를 마치고 보고를 위해 회사에 방문했다. 용병 회사에 돈을 쓸어 모아주는 진이 방문하 자 시끌벅적했다. 진은 결과 보고를 마치고 돌아가려고 했다. 보름달을 보기 전까진. 진은 옥상으 로 향하는 계단을 올랐다. 문을 열자 선선한 저녁 공기가 건물 안으로 들어왔다. 탁 트인 옥상으 로 걸어가자 도시 야경이 펼쳐졌다. 주변에 고층 건물 하나 없이 우뚝 세워진 회사가 참으로 스 나이퍼의 저격을 막기 위해 주변 부지까지 전부 사들인 용병 회사답다고 느껴졌다. 진은 고개를 들어 보름달을 봤다. 구름 한 점 없는 밤하늘이었다.<br/>
            옥상 안쪽에서 라이터 부싯돌 소리가 들렸다. 진은 본능적으로 소리의 출처로 고개를 돌렸다. 소 리의 주인공은 옥상 벤치에 앉아있었다. 그는 불이 안 붙는지 라이터 소리가 여러 번 들렸다. 그 리곤 진을 보고 씨익 웃으면서 담배를 내밀었다.<br/>
            “필래?” 다짜고짜 반말이었다.<br/>
            “아니.”<br/>
            “이봐, 청승맞은 동지끼리 담배라도 피우자고.”<br/>
            “청승?” 진은 갑작스러운 질문에 되물었다.<br/>
            “그래, 청승.”<br/>
            상대는 그렇게 답하고 담배를 물었다. 진이 침묵하자 남자는 자기 사연을 말하기 시작했다.<br/>
            “무슨 사연이 있는지 모르겠지만, 여기에 사연 없는 사람은 없을 걸? 나는 아들을 잃었어. 아내도 잃었고. 네 사연은 모르겠지만 때로는 주변에 의지하는 게 좋을 거야. 그게 동료 아니겠어?”<br/>
            진은 남자의 담배 연기를 바라보다 동기 녀석들이 웃는 소리가 들리는 것 같아서 보름달을 바라 봤다.<br/>
            남자는 이후 진의 임무에 따라다니기 시작했다. 따라오지 못하게 고위험군의 임무만 받았는데 그 는 지치지도 않는지 진에게 다가갔다. 물리적 거리가 가까워지니 결국 심리적 거리도 가까워지고 말았다. 진은 언젠간 떠날 사람에게 또 정을 줘버렸다.<br/>
            “진, 총탄 챙겼어?”<br/>
            “당연하지. 윌로우 너는?”<br/>
            “이제 챙기려고.”<br/>
            “정신도 같이 챙겨.” 진은 단검을 보조주머니에 넣으며 말했다.<br/>
            그러자 윌로우는 진의 어깨에 매달렸다. 위험하게 붙어오는 윌로우에게 떨어지라 말했다.<br/>
 <br/>
            “매정하기는.”<br/>
            “오늘 미션은 정신 똑바로 챙겨야 해. 까딱하면 죽는... 아니다.”<br/>
            “죽는다고?”<br/>
            “...”<br/>
            “괜찮아. 어차피 죽음밖에 안 남았어.”<br/>
            진은 윌로우의 말에 부정할 수 없었다. 진 역시 죽음만 바라보며 살기 때문에. 말은 예언과도 같 아서 죽음을 입 밖으로 꺼내는 순간 사신의 낫이 목에 닿았다.<br/>
            진과 윌로우가 투입된 작전은 상황이 좋지 않았다. 테러가 예고된 행사에서 의뢰인을 지키는 임 무였다. 행사를 취소할 수 없다는 입장에 용병에게 경호를 의뢰한 것이었다. 진작에 행사를 취소 했으면 될 일을 더 크게 만든 의뢰인을 이해할 수 없지만 돈은 모든 걸 해결했다.<br/>
            행사가 시작하자마자 테러 집단들의 습격이 시작됐다. 의뢰자는 경호팀과 함께 탈출한 지 오래다. 테러 목표물이 사라진 곳에서 용병과 테러 집단의 대치가 이어졌다. 진은 적을 차례로 쓰러트렸 지만 얼마 가지 못할 것 같다는 생각이 들었다. 그는 윌로우와 함께 계단으로 피신했다. 벽을 엄 폐물로 삼아 총을 쏘던 중 진은 공중에 던져진 물체를 포착했다. 진은 본능적으로 윌로우를 계단 아래로 밀쳤다.<br/>
            그 순간 진은 윌로우와 함께하는 동안 왜 친우들이 자신을 살리기 위해 몸을 날렸는지 알 수 있 었다. 죽음은 자신만으로 족했다. 자신 외의 사람들은 안온한 생활을 하면 좋겠다는 지독한 욕심 이었다.<br/>
            “진!”<br/>
            윌로우의 목소리가 아득하게 멀어졌다.<br/>
            . . .<br/>
            진은 수면 아래로 몸이 잠기는 느낌이 들었다. 어느 순간 전신을 누르던 감각이 사라지고 자유로 워졌다. 진은 눈을 떴다. 빛이 눈꺼풀 사이로 들어오자 모든 감각이 되돌아왔다.<br/>
            따뜻한 아침 햇살 피부로 느껴졌다. 영어가 아닌 한국어로 대화하는 학생들이 자신의 옆을 지나 가고 있었다. 진은 자신의 행색을 내려다봤다. 꿈에서 봤던 교복을 입고 있었다. 어깨가 묘하게<br/>
 <br/>
            묵직했던 이유는 백팩을 메고 있어서였다. 그때, 어디선가 자신을 부르는 소리가 들렸다.<br/>
            “진! 빨리 와!”<br/>
            “왜 거기 서서 멍 때리고 있어? 너 그러다 지각이야!” “야, 쟤 버려. 지각이야.”<br/>
            “뛰어!”<br/>
            그리운 목소리. 진은 멍하니 그들을 바라봤다. 필, 크리스, 앤드류 그리고 네이슨이 보였다. 교복을 입고 달려가는 뒷모습에 진은 눈물이 날 것 같았다. 이곳은 진의 이상(理想)이었다.<br/>

            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal17",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title17.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title17_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
