<template>
  <div class="content-modal" :class="{ on: showContentsModal === true }">
    <div class="content-character-box v14">
      <div class="main-character">
        <h3 class="main-character-title">
          <img :src="titleUrl" class="pc-only" />
          <img :src="titleUrlMo" class="mobile-only" />
        </h3>
        <p class="main-character-text">
          뜨거운 열정으로 모든 걸 불태우는 힙합 저승사자 'MC 하대수'
        </p>
        <p class="main-character-text2">
          “초심으로 돌아가 죽이는 랩이 뭔지,<br />보여주겠다!”
        </p>
        <ul class="main-character-info">
          <li>
            <div class="title">나이</div>
            <div class="text">550세</div>
          </li>
          <li>
            <div class="title">키</div>
            <div class="text">185cm</div>
          </li>
          <li>
            <div class="title">성격</div>
            <div class="text">#욱하지만#츤데레</div>
          </li>
          <li>
            <div class="title">취미</div>
            <div class="text">프리스타일랩</div>
          </li>
          <li>
            <div class="title">스킬</div>
            <div class="text">디스노트를 이용해 상대를 저격</div>
          </li>
        </ul>
        <button type="button" class="btn-related" @click="showRelated = true">
          관련작품 보기
        </button>
      </div>
    </div>
    <div class="related-layer" :class="{ on: showRelated === true }">
      <h3 class="title">MC 하대수 이야기</h3>
      [MC 하대수]<br />
      붕괴사고로 무너진 콘크리트 사이에 갇힌 남자.<br />
      꿈인지 현실인지 구분 할 수 없고 낮과 밤을 알 수도 없다.<br />
      그의 하루를 버티게 해주는 것은 꿈이다.<br />
      그 사이 구조대는 도착한다. 하지만 남자는 깨어나고 싶어 하지 않는다.
      콘크리트와 골조들 사이의 좁은 틈에 못으로 힘겹게 적어 내려간 꿈의 이야기가
      그 곳에 남 겨져 있기 때문이다.<br />
      죽음의 끝자락에서 다시 찾은 새로운 인생<br />
      사방은 빛 한 점 없이 어두웠다. 상황을 파악하려 몸을 조금 움직였을 때,
      강열한 통증이 온 몸으로 퍼져나갔다. 처음 느끼는 고통이었기에 순간
      자각하지도 못했다.<br />
      “으윽”<br />
      나는 사방을 더듬으며 통증의 근원을 찾다 다리가 거대한 콘크리트 더미에
      깔렸다는 걸 알게 됐다.<br />
      어둠에 눈이 적응했을 무렵에 나는 깨달았다. 아, 내 자취방이 무너졌구나.<br />
      여느 날처럼 밤새 게임을 하던 중이었다. 태풍이 오는 날이었고, 문자로
      산사태주의보가 발령됐다는 안전문자가 왔다. 집 주인에게서도 문자가 왔지만
      그다지 신경 쓰지 않았다. 자연재해는 멀기만 한 이야기였으니까.<br />
      산을 등지고 있는 낡은 원룸 촌이어서 산사태를 직격으로 맞았을 테다. 헤드셋
      때문에 흙이 쏟아져 내리는 낌새도 알아차리지 못했겠지.<br />
      운이 좋게도 책상위로 천장의 콘크리트 덩이가 떨어지며 흙을 막아줬다. 그
      덕분에 다리는 깔렸지만 흙더미 속에서 질식사 하진 않을 수 있었다.<br />
      그때 주머니에서 핸드폰이 울렸다. 친구 우식이었다.<br />
      [하민우! 너 괜찮아? 뉴스 보니까 너희동네 산사태 났다 길래 전화했어]<br />
      운 좋게 우리 집이 무너졌네.<br />
      <br />
      [미친놈아 그게 운이 좋아? 지금 구조중이라고 하는 데 조금만 기다려.
      걱정하지 말고]<br />
      난 괜찮아, 이게 뭐가 대수라고 전화를 하냐. 끊어 나중에 보자<br />
      [참나, 누가 하대수 아니랄까봐. 그래도 별로 안 다친 거 같아서 다행이다.]<br />
      하대수,<br />
      하대수는 친구들이 날 부르는 별명이었다. 무슨 일이 있어도 ‘뭐가 대수야’
      털털하게 넘기기 때문이었다. 그 별명이 썩 좋진 않았다. 나는 전혀 그런
      사람이 아니었기 때문에.<br />
      주위 사람들은 날 모른다. 내가 통쾌하고 걱정 없이 사는 놈이라고, 뭘 해도
      잘될 거라고 말하곤 한다.<br />
      우습다. 내가 그런 사람이라니, 난 그저 내게 주어진 생명의 시간이 어서
      흐르기만을 고대하는 사람인데.<br />
      나는 휴대폰을 내려두고 가만히 누워있었다. 다리엔 점점 감각이 없어졌다. 아,
      이대로 죽어도 나쁘지 않겠다 싶었다.<br />
      내 인생은 즐기며 살기엔 비루했다. 꿈이 딱히 없었기에 성적에 맞춰 지방의
      작은 대학교 호텔경영학과에 원서를 넣었고 덜컥 합격했다. 1 학년 1 학기
      짝사랑하던 선배에게 공개고백을 하고 차이자마자 도망치듯 입대했다.<br />
      전역은 2 개월 전에 했지만 복학을 할 자신도 일을 할 마음도 없었기에 매일
      집에서 게임만 하며 시간을 죽이고 있다. 매일 밤 내 처지를 비관하며 술을
      마시지만 정작 자격증 공부는 귀찮아서 시작도 못한다.<br />
      삶이 피폐해지니 느는 건 허세밖에 없었다. 찌질한 사람으로 보이고 싶지
      않았기에 남들 앞에선 더 당당한척 괜찮은 척 굴었다.<br />
      술자리에서 한껏 내 자신을 꾸며내고 돌아오는 새벽의 공기는 비참했다. 그
      길을 걸을 때면 죽음을 고민하곤 했다.<br />
      그러니 어떻겠는가. 산사태 속에 깔린 이 상황이 내겐 희극으로 느껴지지 않을
      수 없었다.<br />
      시간이 얼마나 지났는지는 모른다. 나는 낮인지 밤인지 모르는 시간 속에서
      잠들고 깨고를 반복했다.<br />
      <br />
      처음 꾼 꿈속에서 나는 어렸다. 나는 집 마루를 기어 다녔는데, 이게 내게 정말
      있었던 과거인지는 정확히 알 수 없었다. 나는 집 안으로 날아 들어온 나비를
      잡기 위해 애썼다. 검은 바탕에 보라색 무늬가 있는 신비로운 나비였다. 힘껏
      손을 뻗었지만 나비는 내 손에 살포시 앉았다가 다시 날아갔다. 마루에
      들어오는 햇살은 포근했고 봄 내음이 감돌았다.<br />
      부모님과 함께 아쿠아리움에 갔던 꿈도 꿨다. 그곳에서 난 어리광을 피웠고,
      결국 갖고 싶었던 펭귄 인형을 품에 안고 돌아갔다.<br />
      대학교를 졸업하고 호텔리어로 일하는 꿈도 있었다. 그 상황이 썩 달갑진
      않았지만, 무능한 내가 해냈다는 것에 감격했다.<br />
      꿈이 어찌나 달콤하던지, 나는 그곳에서 빠져나오지 않기 위해기를 썼다.
      간간히 다리의 통증으로 꿈에서 깨어날 때면 묵직한 현실의 무게가 날
      짓눌렀다.<br />
      내가 살던 현실보다 무너져 내린 콘크리트 속의 시간이 더 편안했다면
      우스울까. 죽음을 앞 둔 채 꿈속에 머무는 게 더 행복했다면 모두가 날
      비웃을까.<br />
      내 현실은 지독했기에 잠에 들 수밖에 없었다.<br />
      며칠 밤이 지났는지도 모른다. 어떠한 물도 음식도 먹지 못했지만 더 이상
      고통스럽지 않았다. 꿈속에서 평안을 찾았으니까.<br />
      까마득한 어둠 속에서 난 또 다시 꿈을 꿨다. 나는 중학생 시절의 나를
      지켜보고 있었다. 교실의 구석에 앉아있는 나는 수업시간에 교과서 뒤에 노트
      한권을 펼쳐두고 뭔가를 열심히 쓰고 있었다. 있었다. 난 과거의 나에게 다가가
      노트를 살펴보았다.<br />
      NOTE<br />
      난 하얀 노트 위에 살아<br />
      흰 칸이 방이고 검은 줄이 벽이야 꿈꾸는 게 아니고 진짜란 말이야<br />
      노트에 적힌 글을 보자마자 난 피식 웃음이 나왔다.<br />
      노트의 글은 당시 내가 쓰던 랩 가사였다. 한동안 힙합오디션 프로그램에 빠져
      래퍼가 되겠다며 난리를 쳤지만 오래가진 못했다.<br />
      하지만, 내 어린 나는 꽤나 열정적으로 보였다. 쉬는 시간 종이 울렸음에도
      어린 나는 머리를 싸매고 가사를 쓰고 있었다.<br />
      <br />
      맞아. 그때 그랬었지.<br />
      그 아이는 왜소하고 볼품없었지만, 기특했다.<br />
      난 아이에게 다가가 머리를 살포시 쓰다듬었다. 그 순간이었다. 머리를 쳐박고
      있던 어린 나는 고개를 들어 나를 올려다봤다.<br />
      아이의 눈은 형형한 빛을 띠고 있었다. 그 눈빛에 압도 돼 나는 재빨리 머리에
      손을 땠다. 착각인걸까. 아이는 놀란 나를 보고 슬며시 미소를 지으며 입을
      움직였다.<br />
      ‘기다릴게..’<br />
      다리의 찌릿한 통증이 꿈에서 나를 끄집어냈다. 나는 아이의 말에 답도 하지
      못하고 깨어났다. 분명 기다린다고 했던 것 같은데.<br />
      기다린다고...<br />
      나는 희미한 웃음을 흘렸다. 그 아이의 말은 내 마음 속에 새로운 목표를
      심어줬다.<br />
      그 아이가 있는 곳으로 가겠다는 결심. 이곳에서 평온한 죽음을
      맞이함으로서.<br />
      나는 손을 뻗어 바닥을 더듬었다.<br />
      분명 있을텐데.<br />
      곧 내손에 마카 하나가 잡혔다. 연필 꽃이에 있던 마커였다.<br />
      나는 몸을 조금 비틀어 옆쪽의 콘크리트 덩어리를 바라봤다. 다리의 통증이 더
      강해졌지만, 굴하지 않았다. 나는 콘크리트 덩어리 위로 천천히 글자를 세기기
      시작했다.<br />
      [유언장]<br />
      중학교 2 학년, 모든 게 한심해 보였지.<br />
      손에 잡히는 건 펜 밖에 없었고.<br />
      시간을 죽이느라 가사를 썼지.<br />
      지금은 나를 죽이느라 가사를 쓰지.<br />
      꿈속에서 나는 살아 움직여.<br />
      가사를 쓰다 까무러지고 또 다시 가사를 쓰기를 반복했다. 어느덧 콘크리트
      덩어리엔 빼곡히 글자가 채워졌다. 의식이 희미해지고 호흡이 가빠왔다.<br />
      어둠은 다정했고, 습한 공기는 익숙했다. 나는 영원한 꿈속으로 떠나길
      기다렸다.<br />
      덜컹-<br />
      꽤 큰 울림이 머리 위에서 느껴졌다.<br />
      <br />
      곧 사람들의 웅성거림이 들려왔고, 어둠속에 날카로운 빛 한줄기가
      스며들어왔다. 그 순간 내가 느낀 감정이 무엇인 줄 아는가.<br />
      절망,<br />
      절망이었다.<br />
      안돼, 난 돌아가고 싶지 않아.<br />
      희미한 나의 숨소리가 끊어지길 빌고 빌었다,<br />
      어느새 머리위의 커다란 콘크리트 덩어리가 밀려났고, 구조대원은 날 보며
      소리쳤다.<br />
      “여기 사람이 있습니다!”<br />
      그는 걱정스런 표정으로 내 곁으로 와 말했다.<br />
      “괜찮으십니까?”<br />
      나는 그런 그의 손목을 낚아챘다. 남은 힘의 전부였다.<br />
      “제발... 제발 그냥 가주세요.”<br />

      <button type="button" class="modal-close" @click="showRelated = false">
        <span class="blind">닫기</span>
      </button>
    </div>
    <button
      type="button"
      class="modal-close"
      @click="$emit('update:visible', !showContentsModal)"
    >
      <span class="blind">닫기</span>
    </button>
  </div>
</template>

<script>
import { reactive, toRefs } from "vue";

export default {
  name: "CharacterModal15",
  emits: ["update:visible"],
  props: {
    showContentsModal: {
      type: Boolean,
      default: false,
    },
    title: {
      type: String,
      default: "",
    },
  },
  data() {
    return {
      showRelated: false,
    };
  },
  setup() {
    const state = reactive({
      titleUrl: require("@/assets/image/region1/bg_char_title15.png"),
      titleUrlMo: require("@/assets/image/region1/bg_char_title15_mo.png"),
    });
    return {
      ...toRefs(state),
    };
  },
};
</script>

<style scoped></style>
