<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v16">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                   손짓 한 번으로 생명을 살리는 숲의 여신 '피어나 공주'
                </p>
                <p class="main-character-text2">
                    “청량한 숲처럼 사람들에게 존재만으로,<br />힐링을 주고 싶다!”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">45억 세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">175cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#고상함#백치미</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">분갈이,꽃꽃이</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">손끝으로 사물에 생명력을 부여</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 피어나공주 이야기</h3>
            [피어나 공주]<br/>
            자본주의 세상에 자유롭게 살지 못하는 식물들과 자신을 볼 때마다 이질감이 느껴진다.<br/>
            매일 꽃에게 물을 주면서도 이쁘다, 죽지마를 말하면서<br/>
            꽃의 팔다리를 사정없이 가위로 자르고 목을 꺾으며 더 이쁘게 만들어주겠다며 말하니 말이다. 내가 주는 물 만큼 식물들은 같은 보상으로 돌아온다. 활짝 핀 꽃잎으로 나의 미소를 만개 하게하며 더 크고 넓은 곳으로 옮겨주면 언제 그랬냐는 듯 쑥쑥 자라나 열매라는 선물도 준다.<br/>
            이렇게 같이 자유롭게 생활 할 수만 있다면 얼마나 좋을까?!<br/>
            [노력은 배신하지 않는다]<br/>
            서전 가판대 1 열에 자리 잡은 책 제목을 보며 피식, 실소를 흘렸다.<br/>
            32 년, 길지 않는 삶을 살면서 느낀 건 노력은 배신의 귀재라는 것이다.<br/>
            노력의 첫배신은 19 살 대입이었다. 누구보다도 열심히 공부했던 밤들, 볼펜으로 허벅지를 찔러가며 이겨낸 잠을, 노력은 가벼이 비웃으며 배신했다.<br/>
            두 번째는 배신은 연애.<br/>
            재수로 들어간 대학에서 만난 동갑내기 남자였다. 21 살, 꽃다운 나이에 시작된 연애는 29 살까지 이어졌다. 군대를 기다리고 그의 취업을 도왔다. 하지만 그 끝은 일방적인 이별통보로 마침표를 찍었다. 최악의 이별방식 1 위라는 잠수이별이었다.<br/>
            대망의 세 번째 배신은 최근이었다.<br/>
            5 년 동안 몸을 담그던 출판사의 인사정리다. 함께했던 시간이 무색하게 회사는 내게 권고사직은 권유했다. 권유라기엔 꽤 강한 압박이 담겨있었다.<br/>
            “노력은 개뿔. 이 작자는 운빨이 좀 따랐나보지”<br/>
            꿍얼거리며 얼굴도 모르는 책 작가를 욕하고 있을 때였다. 옆에서 느껴지는 따가운 시선에 눈을 돌리니 한 남자가 흥미로운 눈으로 날 보고 있었다. 유난히 흰 피부에 까만 뿔테안경, 하늘색 셔츠가 퍽 잘 어울리는 남자였다. 남자는 내가 노려보고 있던 책을 집어 들었다.<br/>
            갑작스런 남자의 등장에 그곳을 뜨려 몸을 틀었을 때 그는 내게 말을 걸었다.<br/>
            <br/>
            “이 작가랑 아는 사이세요?” “네? 아뇨?”<br/>
            생뚱맞은 질문에 눈을 이리저리 굴리다 그가 내 혼잣말을 들었구나, 어림짐작했다. 얼른 이 대화를 끝내기 위한 대답을 찾다 난 책 제목을 가리키며 말했다.<br/>
            “그냥... 이런 말 하는 사람 별로 안 좋아하거든요.”<br/>
            남자는 책 제목을 한번 흘기곤 다시 내게로 시선을 돌렸다.<br/>
            “아. 노력은 배신을 하지 않는다?<br/>
            전 아무런 노력도 않으면서 열심히 사는 사람 비웃는 인간들이 더 최악이던데”<br/>
            말을 하는 남자의 입 꼬리가 비스듬히 올라갔다. 분명 비아냥이 섞인 어조였다.<br/>
            그 말이 날 겨냥하는 말이라는 걸 몇 초 뒤 알아채곤 얼굴이 붉어졌다. 이미 남자는 책을 들고 떠난 뒤였다.<br/>
            뭐 저런 새끼가 다 있어!<br/>
            나는 씩씩거리며 꽃집 문을 열었다. 사방에서 밀려오는 꽃향기가 머리끝까지 오른 화를 조금은 식혀줬다.<br/>
            꽃대의 잔잎을 정리하던 사장 정희언니는 날 보고 반갑게 인사했다<br/>
            “유이 왔어? 오늘 일찍 나왔네?”<br/>
            하나정원의 사장인 정희언니는 내가 식물을 키우기 시작하며 친해진 동네언니였다. 그리고 내가 회사에서 잘렸을 때 먼저 자기 가게에서 일해보지 않겠냐고 제안해준 고마운 은인이었다.<br/>
            “마침 잘됐다 지금 단체주문이 들어와서 바쁘거든 저기 장미 잔가지 좀 정리해 줄래? 아래에 지저분한 것만 잘라주면 돼. 난 배달 다녀올게”<br/>
            “알겠어.”<br/>
            <br/>
            홀로 남은 꽃집에선 사각사각 가위질 소리만 울렸다. 날이 선 원예가위에 이파리들이 속절없이 떨어졌다.<br/>
            ‘이 이파리들도 너희의 노력일 텐데... 사람들 보기 좋으라고 마구잡이로 잘려야 한다니.’<br/>
            자본주의 세상에서 고통 받는 건 비단 사람들만은 아니구나.<br/>
            식물을 꽤나 좋아했기에 선뜻 일하겠다고 했는데, 막상 시작한 꽃집일은 마음 한구석을 계속 불편케 했다.<br/>
            그때 또각또각 구두소리와 함께 여자 한명이 가게로 들어왔다. 편안한 세미복장의 차림에 단발머리 여자를 본 순간 난 눈이 동그래졌다.<br/>
            잊으려야 잊을 수 없는 얼굴.<br/>
            박소영, 인사정리명단에 가장 먼저 내 이름을 올려준 고마워 미치겠는 입사동기.<br/>
            “어머 유이야, 꽃집에서 일한다는 소문만 들었는데 진짜였네?”<br/>
            사람 속을 박박 긁는 말투며 행동까지, 변한 게 하나 없었다.<br/>
            “여기까지 또 뭐 하러 왔니. 그냥 가지”<br/>
            “무슨 말을 그렇게 서운하게 해. 꽃도 살 겸, 네 얼굴도 볼 겸, 겸사겸사” “꽃 살일이 뭐가 있다고”<br/>
            “우리 기획팀 규현 팀장님 있잖아. 편집부로 옮기시게 됐거든.<br/>
            아 넌 몰랐겠구나.”<br/>
            꽃으로도 때리지 말라는 말이 있지만 지금만큼은 내 손아귀에 있는 장미 한 다발로 그녀의 얼굴을 때려주고 싶었다.<br/>
            “아참 그리고 규현 팀장님 나간 자리에 누가 들어온 줄 알아?” “누구”<br/>
            특유의 가식적인 미소로 한번 싱긋 웃은 소영은 말했다.<br/>
            “나”<br/>
            <br/>
            거칠게 현관문을 열고 집에 들어온 내가 향한 곳은 베란다였다. 나는 철푸덕 바닥에 앉아 큼직한 몬스테라 잎을 쓰다듬었다. 하루 중 유일하게 마음의 위안을 얻는 시간이다.<br/>
            4 월, 날씨가 조금씩 풀리자 베란다 한 면을 가득 메운 식물들은 쑥쑥 자라나고 있었다.<br/>
            “노력은 배신해도 너희는 절대 배신하지 않는구나.”<br/>
            나는 다정한 눈빛으로 푸른 잎사귀를 향해 속삭였다.<br/>
            엄마는 내가 어릴 때부터 참 욕심 없는 애라고 그랬었다. 달리기에서 꼴등을 해도 헤실헤실 웃고 마는 애였다고. 왜 이렇게 욕심이 없냐고 타박하기도 하셨다. 하지만 난 경쟁도 질투도 다 싫었다. 남들을 따라 공부했고, 연애했고, 취업을 했다. 그 과정은 진정 내가 원한 일들은 아니었다.<br/>
            난 정원을 가꾸면서 유유자적하며 사는 게 꿈이었는데, 사람들은 그런 건 꿈이 아니라고만 말했다.<br/>
            비좁은 베란다에 몸을 욱여넣고, 창문 너머로 펼쳐진 밤하늘을 올려봤다. 또 마주하게 될 내일을 떠올리자 마음 한구석이 공허해 졌다. 나는 다리가 저릿저릿해질 때까지 무릎에 얼굴을 파묻고 있다 찬 바닥에서 잠들었다.<br/>
            그날 밤 나는 거대한 나무 앞에 서있었다. 밤하늘엔 유성이 꼬리를 그리며 떨어졌고, 수 십 마리의 반딧불이가 나무 주위의 어둠을 밝히고 있었다.<br/>
            나는 아름답다 못해 황홀한 광경을 우두커니 서서 바라보고 있었다.<br/>
            그때 머릿속에 나지막한 음성이 울려 퍼졌다.<br/>
            [나의 주인, 당신을 기다렸습니다]<br/>
            나는 웅장한 목소리의 주인을 찾기 위해 주위를 둘러봤지만 누구도 보이지 않았다.<br/>
            “누...누구세요?”<br/>
            [난 당신의 종이자 이 땅을 지키는 세계수입니다.]<br/>
            “세계수?”<br/>
            <br/>
            나는 내 앞에 서있는 커다란 고목을 올려 봤다. 세월의 흐름을 가늠도 할 수 없는 높이였다.<br/>
            이 나무가 나한테 말을 건건가...?<br/>
            의문을 가지고 있을 때, 그 커다란 나무는 또 다시 내게 말을 건넸다. 머릿속이 울리는 웅장한 목소리였다.<br/>
            [얼른 다시 돌아와 이 땅을 다스려 주세요]<br/>
            “돌아오라니... 그게 무슨...”<br/>
            내 질문이 다 끝나기도 전에 바닥에서 큰 굉음이 울려 퍼지며 땅이 꺼졌다. 난 비명을 지르며 심연 속으로 빨려 들어갔다.<br/>
            “허억...! 무슨 꿈이 이래...!!”<br/>
            잠에서 깨어난 나는 온 몸에 식은땀을 흘리고 있었다. 바닥에서 잠들어 뻐근한 몸을 스트레칭 하다가 창밖을 내다봤다.<br/>
            이상하리 만치 밝은 날씨였고, 중천에 뜬 해를 바라보다 온 몸에 소름이 돋았다.<br/>
            “미친! 오늘 면접날이잖아!”<br/>
            현재 시간은 12 시 반, 면접은 2 시고, 출판사까지는 한 시간이 걸린다. 지금 당장 뛰쳐나가야지 겨우 도착할 수 있는 거리였다.<br/>
            나는 어제 벗어둔 옷을 재빨리 주워 입고는 달려 나가 택시를 잡았다.<br/>
            미치겠네. 까먹어도 이런 걸 까먹냐.<br/>
            나는 택시 안에서 머리를 정리하며 예상 질문을 정리했다.<br/>
            “음... 유이씨는 전 출판사에서 로맨스 소설을 담당하셨네요?”<br/>
            면접관이 예리한 눈빛으로 내 이력서를 훑으며 물었다.<br/>
            “네! 4년 동안 로맨스 파트 PD로 일했습니다.”<br/>
            “이력서를 보니까 전 회사에서 5년 동안 일을 하셨던데, 나머지 1년은 어느 부서에서 일했나요?” “신입이었던 초반 1 년은 자기개발서 보조 PD 로 업무를 배웠습니다.”<br/>
            “그렇군요. 그러면 자기개발서 담당 PD 로 들어가시는 것도 생각을 하고 오신 건가요?”<br/>
            <br/>
            “그건...”<br/>
            난 말꼬리를 흐렸다. 신입시절, 잠깐 일했던 자기개발서 보조 PD 일을 더럽게 지겹고 짜증났다. 자기 말이 다 맞는 말인 양, 자신이 살아온 방식이 진리인 양 늘어놓는 글들을 수백 권을 읽어야 했으니까. 하지만 그게 뭐 대수인가! 지금 중요한건 취업인데. 난 최대한 열정 가득한 목소리로 답했다.<br/>
            “네! 자기개발서 분야가 오히려 더 제 적성에 잘 맞는다고 생각합니다.”<br/>
            정신없어.<br/>
            면접이 끝나고 엘리베이터를 기다리며 한숨 돌리고 있을 때였다. 한 층 전체를 출판사로 쓰고 있는 곳이라 옆으로 보이는 사무실이 꽤 넓었다. 나는 힐긋거리며 회사 내부를 구경하다 누군가 다가오는 인기척에 앞만 바라보고 섰다. 나는 회사 사람이겠거니 싶어 예의상 인사를 꾸벅 하곤 옆으로 살짝 비켰다.<br/>
            그때, 내 옆에 선 남자가 내게 물었다.<br/>
            “면접 보셨나 봐요?”<br/>
            다정한 남자의 목소리였다.<br/>
            “네, 끝나고 나오는 길이에요.”<br/>
            나는 최대한 예의 바르게 답하며 고개를 들어 목소리의 주인을 쳐다봤다.<br/>
            “어...!”<br/>
            내 눈이 휘둥그레졌다.<br/>
            흰 피부, 뿔테안경, 감색 셔츠. 그리고 손에 들린 책 [노력은 배신하지 않는다]<br/>
            분명 어제 서점에서 봤던 싸가지가 가출했던 그 남자였다. 남자는 아주 무해한 미소를 지어보이며 내게 물었다.<br/>
            “노력은 하셨나요?”<br/>

            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal16",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title16.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title16_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
