<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v14">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    당신의 리즈 시절을 선물해드립니다!<br />
                    시간 여행자 '미스터리'
                </p>
                <p class="main-character-text2">
                    “인생의 리즈시절을 오래오래,<br />느끼고 싶음”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">38세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">187cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#꼼꼼함#허당미</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">아재개그</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">브로치를 누르면 자체발광 발생</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 미스터리 이야기</h3>
            꿈이었던 직업에 치여 시골마을에 작은 사진관을 차린 남자. 새로운 곳에서 만난 특별한 인화기를 통해 사람들의 과거와 현실의 모습을 오고 가며<br/>
            꿈을 볼 수 있게 되는데..<br/>
            “준호야, 나는 네가 사진관 여는 거 다시 생각해 봤으면 좋겠어.”<br/>
            크지 않은 초밥 집이었다. 대학 동기인 종호가 초밥 하나를 입에 욱여넣으며 내게 말했다.<br/>
            “이미 가게 계약까지 다 했는데 뭘 다시 생각해”<br/>
            “그래도 그 시골에서 사진관 하는 거, 말도 안 되는 짓이야. 너 월세 낼 돈도 못 벌어.” “괜찮아. 그 동안 많이 벌어놨어. 쉬러 가는 거지 뭐.”<br/>
            “아니 쉴 거면 여행을 가던가. 그 깡촌에 뭐 하러 가. 요즘 누가 사진관 가서 사진 찍냐고, 그리고 너는 10 년 동안 사진 찍는 일 했으면서, 쉴 때도 사진을 찍냐.”<br/>
            “그냥 로망이지 뭐. 알잖아 나. 일 힘들어 한 거”<br/>
            “그건 그렇지”<br/>
            나는 초밥과 같이 나온 우동을 뒤적거리며 말했다. 24 살부터 34 살 지금까지, 정말 일만 바라보고 살았다. 광고 포토그래퍼로 살아온 10 년 동안 지겹도록 사진을 찍고 보정했다. 하지만 그 일을 하는 동안은 전혀 즐겁지 않았다.<br/>
            광고를 위해 모델은 행복한 표정을 짓고 지시된 포즈를 취한다. 난 그걸 가장 효율적이고 계산된 위치에서 찍고, 상품이 잘 드러날 수 있게 보정한다.<br/>
            그런 사진을 찍고 싶진 않았다. 사람의 혼이 담긴, 인생이 담긴 사진을 찍고 싶었다.<br/>
            기왕이면 홍콩 영화에서 나올 것 같은 사진사가 되고 싶었다. 오래된 골목에 위치한 사진관이지만 항상 잘 다려진 양복에 흰 중절모를 쓰고 다니는 그런 사진사. 그런 모습을 하고 사람들의 삶을 담아내는 거다. 그게 내 로망이었다.<br/>
            “인화기는, 샀어? 그거 비싸다며”<br/>
            <br/>
            생각에 빠져 우동을 괴롭히는 나를 보고 종호는 대화 주제를 바꿨다.<br/>
            “아 그거, 중고나라에 싸게 올라온 게 있더라고, 상태 좋아 보이 길래 사기로 했어” “야 그래도 사기 당하면 어쩌려고 암만 싸도 40 만원은 할 거 아냐”<br/>
            “당연 직거래지. 이따가 만나기로 했어.”<br/>
            거래자를 만나기 위해 간 곳은 한적한 카페였다. 새하얗게 꾸며진 카페는 내부 인테리어가 꽤나 세련됨에도 불구하고 유난히 손님이 없었다. 나는 커피 한 잔을 사들고 거래자가 있다는 2 층으로 올라갔다. 단번에 찾을 수 있었다. 2 층에 손님은 그 사람밖에 없었으니까. 거래자는 긴 생머리에 키가 꽤 큰 여자였다. 찐한 보라색의 원피스는 개화기의 여성복식을 떠오르게 했고, 희다 못해 창백한 피부에 붉은 입술은 왠지 모를 긴장감 까지 줬다.<br/>
            조금 이상한 사람인 것 같다는 생각이 끝나기도 전에 여자는 내게 말했다.<br/>
            “인화기 구매하러 오셨죠?”<br/>
            “네...!”<br/>
            “상태 한번 살펴보세요, 깨끗할 거예요.”<br/>
            그녀의 말대로 인화기는 깨끗했다. 출시 한지 꽤 된 기종임에도 방금 포장을 뜯었다 해도 믿을 수 있을 정도였다. 나는 문득 의문이 들어 그녀에게 물었다,<br/>
            “그런데 왜 파시는 거예요? 이 인화기 전문가용인데... 사진 쪽 일 하셨나 봐요?” “그냥, 저보다 더 잘 쓸 수 있는 사람한테 보내주고 싶었어요.”<br/>
            여자는 싱긋 웃었다.<br/>
            그녀의 말에 나름 수긍을 하고 있었다. 그녀는 속내를 알 수 없는 표정을 짓고 내게 말했다.<br/>
            “당신이 보이는 것 이상을 볼 수 있는 사람이면 좋겠네요.”<br/>
            그녀의 말은 내가 도심을 떠나 이 작은 시골 마을 소요리에 도착할 때 까지 머릿속을 맴돌았다. 소요리는 전라도 외곽의 작은 마을이었다. 아버지의 고향이었기 때문에 이곳으로 가야겠다는 생각이 들었다.<br/>
            <br/>
            ‘청춘 사진관’이라는 간판이 붙은 작은 가게는 세월의 흔적이 고스란히 느껴졌다. 벽면의 페인트는 벗겨졌고 입구는 부실한 미닫이문이었다. 난 그곳에서 내일부터 시작 될 사진사의 삶을 기대하며 곳곳의 먼지를 털어내고 있었다.<br/>
            그때 드르륵- 하는 소리와 함께 할아버지 한분이 사진관으로 들어왔다. 첫 손님이었다. 그는 뒷짐을 지고 내부를 둘러보며 말했다.<br/>
            “아이고, 이 동네에 사진관이 다 생기네.” “안녕하세요.”<br/>
            나는 사람 좋은 미소를 보이며 할아버지께 다가갔다.<br/>
            “나 여기 마을 이장인데 한번 보러왔어~. 사진 언제부터 찍을 수 있나? 마침 사진 좀 찍을라구 했는데.”<br/>
            “내일부터 정상 영업합니다! 그런데 어떤 사진 찍으세요? 가족사진?”<br/>
            “젊은이가 쯧. 이 나이에 찍을 사진이 영정사진 말고 뭐 있겠어! 내일 아침에 다시 오께!”<br/>
            나는 그의 농담을 어떻게 받아야 할지 몰라 허허 웃고 말았다. 그 사이 이장님은 가게를 떠나고 없었다. 이곳에서의 생활 쉽지 않겠구나. 직감했다.<br/>
            다음날 아침, 이장님은 어르신을 몇 분을 더 끌고 가게를 방문했다. 모두 사진을 찍을 계획이었는지 한복과 정장을 빼입고 있었다.<br/>
            “아이고, 여기야 여기, 젊은 청년이 이번에 장사 한다고 내려왔더라고~”<br/>
            이장님은 관광가이드처럼 다른 분들에게 내 사진관에 대해 이야기 했다.<br/>
            “이제 옆동네까지 안 나가도 되고 좋구만.”<br/>
            “잘됐네, 이참에 곱게 하구 사진 좀 찍어두면 되겠어.”<br/>
            나는 가게 안을 꽉 채우는 어르신 손님들을 보며 진땀을 흘렸다.<br/>
            “총각 여긴 커피 없어?”<br/>
            <br/>
            연한 하늘색 한복을 차려입은 할머니 한분이 내게 물었다. 나는 곧장 2 층의 집 찬장을 열고 믹스커피 6 잔을 내드렸다,<br/>
            자 카메라 보시고요! 하나, 둘, 셋<br/>
            밝게 플레시가 터졌다. 오랜만에 한복과 정장을 빼입은 그들은 즐거워보였다. 차례로 사진을 찍는 동안, 그들은 내 작은 사진관을 모임의 장소로 이용했다. 휴우. 생각보다 힘들구나.<br/>
            나는 손님들이 떠난 가게 안에서 혼자 목을 축였다,<br/>
            잠깐 낮잠을 즐긴 나는 늦은 밤이 되어서야 일어났다. 가게 2 층에 집을 만든 건 최고의 선택이었노라 자부하며 1 층 가게로 내려온 나는 달빛에 물든 사진관 내부를 살피며 뒤늦은 감동에 잠겼다.<br/>
            내가 정말 원하던 그 모습이야.<br/>
            넓지 않은 가게였다. 아직 벽지를 다 붙이지 못해 벽 한 면에 시멘트가 다 드러나 보이지만 그것조차 좋았다. 시골의 밤은 조용했고, 풀벌레 우는 소리만 밖에서 들려왔다.<br/>
            나는 흰 정장을 맞춰 입겠다고 다짐했다. 그리고 작은 어항에 물고기를 키우고, 나무 의자를 몇 개 사와야지. 그럼 더 완벽해질 거야.<br/>
            나는 계단에 앉아 따뜻한 차를 홀짝이다 사진 인화를 시작했다.<br/>
            가게 안을 한 바퀴 돌며 감상에 잠긴 나는 인화기에서 사진 출력이 완료됐다는 알림을 듣고 사진을 집어 들었다.<br/>
            “이게 뭐야”<br/>
            나는 깜짝 놀라 사진을 내팽개쳤다.<br/>
            사진 속에는 오늘 만난 하늘색 한복차림의 할머니가 아님 젊은 무용수가 서 있었다. 나는 차례로 뽑혀 나오는 사진을 확인했다. 흰 모자를 쓰고 있는 요리사. 정장차림의 회사원, 어린 아이를 안고 있는 젊은 엄마, 그리고 [자유, 정의, 진리] 라고 쓰인 흰 천을 들고 형형한 눈빛으로 서있는 검은 교복 차림의 고등학생.<br/>
            단 한 장도 오늘 찍은 손님이 아니었다. 예전에 찍힌 사진이 섞여 나온 건가. 그렇다고 치기엔 이상했다. 흰 천을 든 고등학생의 교복은 족히 30 년도 전에나 입었던 교복이었다. 말죽거리 잔혹사에서 보던 그 교복이란 말이다!<br/>
            <br/>
            나는 내일 이 사진을 찾으러 오는 어르신께 뭐라 설명을 해야 할지 고민하다 밤을 훌쩍 새웠다.<br/>
            어르신은 어김없이 이른 아침에 찾아오셨다. 나는 당황스러운 기색을 감추지 못하고 그들을 맞았다. 어제 고운 한복을 입고 오셨던 할머니가 들뜬 목소리로 내게 말했다.<br/>
            “총각! 사진 잘 나왔어? 한 20 년 젊게 보이게 손 좀 대주지.” “어... 그게 말이죠...일단 좀 보셔야 할 것 같아요.”<br/>
            나는 얼른 사진을 꺼내들어 할머니께 보여드렸다.<br/>
            “어매! 뭐야!”<br/>
            나는 눈을 질끈 감으며 인화기가 고장 났다는 설명을 하려고 했다. 그때 옆에서 이장님이 사진을 보고 한마디 던졌다.<br/>
            “또옥같이 나왔구만 뭘 그래?”<br/>
            “뭐어? 내가 이렇게 주름이 자글자글해?”<br/>
            “그럼 뭐 7 살 애처럼 맨들맨들 할 줄 알았어? 참나”<br/>
            이게 무슨 상황인가. 아무래도 그들 눈에는 사진이 본래 모습으로 보이는 듯했다. 나는 사진을 다시 받아 찬찬히 살폈다. 눈을 비비고 봐도 젊은 발레리나였다. 내가 미치기라도 한 걸까, 아니면 귀신이라도 씐 걸까.<br/>
            “저 혹시... 할머님 무용을 하신 적 있나요? 발레요.”<br/>
            나는 어처구니없는 생각인걸 알지만 그래도 혹시나 하는 마음에 할머니께 물었다.<br/>
            “어머, 자네가 그걸 어떻게 알아? 내가 젊었을 땐, 인기도 무진장 많았어~” “하하...여전히 자세가 곧으셔서 한번 물어봤어요.”<br/>
            “그럼 이장님은 젊으셨을 때 어떤 일 하셨어요?”<br/>
            나는 20 대 초반의 앳된 요리사가 나온 사진을 바라보며 물었다.<br/>
            <br/>
            “나는 뭐 이것저것 다했지. 돈 벌려면 닥치는 대로 일해야 했어.”<br/>
            “그럼 요리사로 일하신적도 있겠네요?”<br/>
            “그건... 20 대 초반에 잠깐이었지...사고로 손목이 다치면서 포기해야했어. 그땐 참 즐거웠는데”<br/>
            그렇게 말하는 이장님의 표정은 쓸쓸해 보였다.<br/>
            어르신들이 사진을 들고 떠나고, 나는 확신할 수 있었다. 이건 그들의 과거 모습이다. 그것도 그들의 가장 찬란했던 시절,<br/>
            나는 오늘 사진을 찾으러 오지 않은 박혁일 할아버지의 사진을 내려다 봤다. 투지 가득한 고등학생이 흰 천을 꽉 쥐고 서 있었다.<br/>
            자유, 정의, 진리<br/>
            학생운동을 하던 고등학생, 이게 그의 찬란한 과거구나.<br/>
            나는 그가 사진관에서 나갈 때 오른쪽 다리를 절던 모습을 기억해 냈다.<br/>
            <br/>
          <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal14",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title14.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title14_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
