<template>
  <div class="content-modal" :class="{ on: showContentsModal === true }">
    <div class="content-character-box">
      <div class="main-character">
        <h3 class="main-character-title">
          <img :src="titleUrl" class="pc-only" />
          <img :src="titleUrlMo" class="mobile-only" />
        </h3>
        <p class="main-character-text">
          온 우주를 떠돌며 모든 것을 기록하는<br />
          우주 기록자 ‘기록희’
        </p>
        <p class="main-character-text2">
          “전 우주를 다니며 우주의 모든 것을<br />
          기록하고 마음껏 노래하고 싶다!”
        </p>
        <ul class="main-character-info">
          <li>
            <div class="title">나이</div>
            <div class="text">27세</div>
          </li>
          <li>
            <div class="title">키</div>
            <div class="text">166cm</div>
          </li>
          <li>
            <div class="title">성격</div>
            <div class="text">#쿨함 #차갑지만뜨거움 #사랑스러움</div>
          </li>
          <li>
            <div class="title">취미</div>
            <div class="text">독서</div>
          </li>
          <li>
            <div class="title">스킬</div>
            <div class="text">과거기록들이 펼쳐지는 투명메모장</div>
          </li>
        </ul>
        <button type="button" class="btn-related" @click="showRelated = true">
          관련작품 보기
        </button>
      </div>
    </div>
    <div class="related-layer" :class="{ on: showRelated === true }">
      <h3 class="title">기록희 이야기</h3>

      멀어져가는 기억의 끝자락을 붙잡고 과거의 꿈을 쫒는 여인. 그 여인의 기억
      속에는 사랑하는 남자와 사랑하는 한 아이가 있다. 세상에 머물러 있지 못 했던
      아이와, 아직 그 자리에 머물러 있는 여인 둘은 초월의 다리에서 만나게 된다.
      <br /><br />
      <br /><br />
      쌀쌀한 공기를 가르는 햇살을 느끼며 잠에서 깨어났다. 가장 먼저 눈에 들어온
      건 옅은 푸른 색의 천장이었다.<br />
      “여긴 어디지”<br />
      입에서 흘러나오는 낯선 목소리에 화들짝 놀라 손으로 입을 감쌌다.<br />
      가만있지 못하는 가슴을 부여잡고 주위를 살피다 침대 옆 낮은 탁자 위의 쪽지
      한 장을 발견 했다.<br />
      [여긴 나의 집, 10년 동안 난 여기 살았어.]<br />
      마치 날 위해 준비된 쪽지 같았다. 이 쪽지는 누가 쓴 걸까. 그리고 도대체
      무슨 말을 하려는 걸까. 연분홍색 포스트잇을 원래 자리에 다시 붙여두고
      조심히 방을 둘러봤다. 인기척이라곤 전혀 느껴지지 않았다. 처음 본 공간에서
      깨어나서 공포감이 들어야 할 법도 한데, 어째선지 이곳은 본능적으로
      안전하다고 느껴졌다.<br />
      어떻게 여기에 오게 됐더라. 침대에 앉아 아무리 떠올려 보려했지만 아무것도
      생각나지 않았 다. 머릿속에 희뿌연 안개가 낀 것 같았다. 그 안개의 실오라기
      하나를 잡기위해 손을 뻗으려 했지만 안개의 끈은 날 놀리기라도 하는 듯 나와
      멀어졌다.<br />
      내가 누구였더라.<br />
      길고 긴 고민은 결국 내 존재에 대한 의문까지 닿았다. 나는 침대에서 일어나
      문 옆의 화장대 앞으로 갔다. 거울 속의 내 모습을 본 나는 그 자리에 경직될
      수밖에 없었다.<br />
      ‘이게 뭐야...’<br />
      깊게 잡힌 팔자주름, 피부 곳곳에 핀 검버섯. 하얗게 샌 머리. 세월을 잔뜩
      묻힌 힘이 빠질 대 로 빠진 갈색 눈동자.<br />
      누가 봐도 80세는 족히 되어 보이는 할머니였다.<br />
      난 거울 옆에 붙은 쪽지를 거칠게 뜯어냈다. 아까와 같은 분홍색
      포스트잇이었다.<br />
      [놀랐지. 난 73세 심설화. 이젠 주방으로 가야해]<br />
      나...?<br />
      이쪽지에서 말하는 ‘나’는 분명 나인 듯 했다. 그렇다면 이 글을 내가 썼다는
      건데...<br />
      아무리 떠올려 봐도 그런 기억은 없었다.<br />
      머리가 복잡했다. 하루아침에 할머니가 된 것도 싫었고, 내가 누군지, 이곳이
      어딘지도 모르는 상황에 답답했다. 나는 이 상황의 실마리를 찾자는 심정으로
      쪽지의 말대로 주방으로 향했다. 작은 주방에는 오래된 식기들이 바짝 마른 채
      옹기종기 정리되어 있었다. 창가에는 다 말라죽 어 가는 작은 화분이
      있었다.<br />
      주방 한 켠, 한때는 새 하얀 색이었을 누런 냉장고에 똑같은 분홍 포스트잇이
      내가 봐 주기를 바라는 듯 붙어있었다.<br />
      [잊지말것! 약 꼭 먹기]<br />
      옆의 탁자에는 심설화 세 글자가 쓰인 약 봉투가 놓여있었다. 소분된 약 봉지
      속 알약은 족히 10개는 되어 보였다. 막연히 약 봉지를 하나 뜯어 손바닥 위에
      알약들을 올려 두었다.<br />
      텁텁한 약 냄새가 코를 찔렀다. 사람을 불안하게 만드는 냄새였다.<br />
      손 위의 약들을 하나하나 유심히 살피다 문득 이 약을 먹어도 되는 걸까, 하는
      의심이 들었 다. 과연 무엇을 믿고 이 많은 약들을 먹어야 하는 걸까. 나는 그
      약을 모조리 씽크대 배수구 에 버리고 거실을 둘러보기 시작했다.<br />
      난 어느새 거실 큰 창 앞에 놓인 흔들의자에 앉아 바깥의 지나가는 사람들을
      바라보고 있었 다. 바깥은 겨울임이 분명했지만 거실의 창으로 들어오는 햇살을
      꽤 따뜻했다. 창 밖에서 떠 도는 바람이 창틀을 가볍게 흔드는 소리와 무언가
      기계장치가 돌아가는 소리가 들렸다. 방바 닥에선 따스한 온기가 올라왔다.
      창밖으로 지나가는 사람들, 그리고 점점 먼 곳으로 시선을 옮기니 오래된
      주택들과 자기가 더 잘났다고 자랑하는 것만 같은 괴상한 모양의 깔끔한 주택
      들이 모여 있는 마을들이 보였다. 이 집에서 얼른 나가야하는데... 머리는 내게
      그렇게 말하고 있었지만 겨울 낯의 햇살은 내 몸을 자꾸 가라앉게 만들었다.
      호흡은 느려졌고 눈은 감겨버렸 다.<br />
      내가 다시 눈을 떴을 땐, 시장 한복판이었다. 난 외투도 없이 길가에 우두커니
      서있었다. 사람 들의 힐긋거리는 시선을 느낀 나는 일단 발길이 닿는 데로 걷기
      시작했다. 한참을 걷자 손끝 이 빨갛게 얼고 추위에 몸이 굳어졌다. 관절
      마디마디를 채찍으로 사정없이 얻어맞은 것만 같 은 느낌이었다. 어디로
      가야하는 걸까. 사람과 건물, 가판대, 호객행위, 오고가는 지폐들의 미 로를
      배회하던 나는 시린 손을 호호 불다 주머니에 넣었을 때, 야트막한 무언가가
      손에 잡히 는걸 느꼈다.<br />
      이게 뭐지<br />
      붉은색 표지의 작은 수첩이었다.<br />
      의문을 가진 것도 잠시, 난 수첩의 첫 장에 적힌 정갈한 글자를 보고 작은
      안도감을 느꼈다. &lt;집으로 오는 길&gt;<br />
      집... 집이라. 이 순간 가장 듣고 싶었던 말이었다. 먼저 떠오른 건 아침에
      눈떴던 침실이었다. 푸른색 천장의 방. 그 아늑했던 곳이 사무치게
      그리웠다.<br />
      다행히 나의 ‘집’은 멀지 않은 곳에 있었다. 난 길거리의 사람들에게 길을
      물어물어 겨우 집으 로 다시 돌아올 수 있었다. 빨간 벽돌로 지어진 주택의
      현관문은 잠겨있지 않았고, 안의 공기 는 몸을 순식간에 녹일 만큼이나
      따뜻했다. 내가 앉았던 흔적이 온대 간대도 없는 흔들의자는 조용히 날
      기다리고 있었다.<br />
      몸을 녹인 나는 언제 그랬냐는 듯 다시 집 구석구석을 살폈고, 거실 한구석의
      책장에서 같은 글씨가 빼곡히 담긴 노트 수십 권을 발견할 수 있었다. 난
      바닥에 앉아 노트를 읽어 내려갔 다.<br />
      1995년, 8월 11일<br />
      <br />
      맑은 눈망울을 가진 아이, 늦었지만 우리에게 축복과 같은 아이를 만났다.<br />
      함께 떠난 첫 여행, 두려움을 꾹 참고 바다로 뛰어들었다. 두려움은 잠시
      뿐이었다. 바다 속을 유영하는 형형색색의 물고기의 모습에 모두가 아이처럼
      기뻐했다.<br />
      2001년, 12월 8일<br />
      겨울비는 지독하다. 밤새 길을 얼리곤 사람들을 괴롭힌다. 하니가 돌아올 길을
      따라 우산을 들고 종종걸음으로 길을 나선다. 추위를 많이 타는 하니에겐
      겨울은 쥐약이다. 돌아와 따뜻한 차로 몸을 녹여줄 생각 뿐 이다. 그러나
      만나자 마자 하니는<br />
      ‘이런 날엔 이불 속에서 귤 까먹는 게 최고지!’ 라며 동네 과일가게에서 귤 한
      봉지를 사달라 며 때를 쓴다. 참 이쁘다.<br />
      2005년 5월 3일<br />
      비통하고 개탄스럽다. 아가, 너를 만나려면 어디로 가야하니<br />
      누군가의 일기였다. 날짜를 보니 무려 20년이 넘는 동안 꾸준히 쓰인 듯 했다.
      가장 마지막 일기는 2020년 9월. 딱 한 줄이었다.<br />
      밤이 길다.<br />
      한참동안 누군가의 인생을 읽어 내려갔다. 이 일기의 주인은 어떤 사람일까.
      계속 등장하는 ‘하니’라는 아이는 누굴까.<br />
      일기의 주인의 삶은 즐거워 보였다. 난 이곳에서 주름이 가득한 늙은 노인네로
      깨어났는데. 이 사람은 어디선가 즐거운 삶은 살고 있다는 생각에 부러운
      마음이 들었다.<br />
      그때 현관문이 열리며 머리가 희끗한, 내 모습만큼이나 늙어버린 남자가
      들어왔다. 한손에는 검은 봉지를 든 채였다.<br />
      그는 바닥에 앉아있는 날 보고 화들짝 놀라며 달려왔다.<br />
      “바닥에서 왜 이러고 있어. 당신 또 일기 보고 있는 거야?”<br />
      그의 말을 듣고 나는 잠시 침묵했다. 남자는 검은 봉지를 바닥에 내려놓고 거친
      손으로 내 손 을 부드럽게 쓰다듬었다.<br />
      남자가 들고 온 봉지가 바닥에 널브러지며 안에선 귤 몇 알이 굴러 나왔다.<br />
      난 고개를 들어 남자의 얼굴을 들여다보았다. 그리고 우리는 세월에 속절없이
      힘을 잃은 흐릿 한 눈동자를 마주했다. 내 눈을 한참 바라보던 그의 눈시울이
      붉어진 것을 보고 알 수 있었 다.<br />
      아, 저 남자는 무언가 알고 있구나<br />
      나는 담담한 목소리로 내 앞에 주저앉은 남자에게 말했다.<br />
      “제 기억이 지워지고 있군요.”<br />
      <br />
      시선을 창밖으로 옮겼다. 어느새 밖엔 눈발이 날리고 있었다.<br />
      내가 얼마나 많은 추억을 잃었을까, 그리고 그 추억과 함께 사라진 감정들은 또
      얼마나 많을 까.<br />
      내 앞에 흩어진 수십 권을 붉은 일기장을 보자 서글퍼졌다.<br />
      나는 어린아이처럼 눈물을 뚝뚝 흘렸다. 눈물은 껍데기만 남은 주름진 손등을
      적셨다. 그 광 경은 날 더 괴롭게 만들었다.<br />
      내가 부끄러움도 없이 입을 찡그리고 엉엉 울기 시작하자 나의 남편이라는
      사람은 내 등을 가 만가만 쓸어줬다.<br />
      어제의 나도 이렇게 울었을까. 내일의 나도 이렇게 울게 될까.<br />
      늦은 밤, 나는 서랍 속의 손때가 묻은 만년필을 집어 들었다.<br />
      내일의 내가 오늘을 잊더라도 알 수 있도록 기록하기 위해, 그리고 매번 나를
      기다리는 이 남 자만은 잊지 않기 위해.<br />
      ***<br />
      “여긴 어디지”<br />
      끝없는 어둠 속에서 내 몸은 부유하고 있었다. 광활하게 펼쳐진 어둠은 내
      고향만큼 편안한 느낌을 줬다.<br />
      그때 저 멀리서 밝은 빛을 내뿜는 행성이 서서히 내게 다가왔다. 난 거대한
      행성의 접근에도 두려움 한 점 없었다.<br />
      행성의 대지는 쨍한 분홍색을 띄고 있었고 뿌리와 줄기가 뒤바뀐 나무들이
      줄지어 서있었다. 행성의 곳곳을 탐사하던 나는 바지 주머니 한쪽에서 붉은
      노트한권을 꺼냈다.<br />
      3092년, 1월 11일<br />
      분홍색 대지의 행성, 나 외의 생명체는 없는 듯하다. 난 이곳을 핑크
      페르소나라 명명하겠다.<br />
      나는 마주한 모든 것들을 세밀히 기록했다. 이 행위에 어떤 이유도, 의미도
      없었다. 그저 그렇게 했다. 마치 이 광활한 우주의 모든 일을 기록하는 게 내
      소명인 양.<br />
      돌아서는 순간 그 곳에선 어디선가 익숙한 실루엣을 한 여자아이가 나를
      기다리고 있었다. 교복을 입은 여자학생, 명찰에는 윤하니라고 쓰여 있다.<br />
      윤하니..어디서 많이 들었...<br />
      노트...!노트에 마르고 닳도록 나와 있던 이름..!<br />
      눈망울이 또렷하고 목소리가 청량한 아이, 그 아이가 뛰어오는 순간 여렴 풋이
      한 장면이 떠 오른다. 천사보육원.<br />

      <button type="button" class="modal-close" @click="showRelated = false">
        <span class="blind">닫기</span>
      </button>
    </div>
    <button
      type="button"
      class="modal-close"
      @click="$emit('update:visible', !showContentsModal)"
    >
      <span class="blind">닫기</span>
    </button>
  </div>
</template>

<script>
import { reactive, toRefs } from "vue";

export default {
  name: "CharacterModal1",
  emits: ["update:visible"],
  props: {
    showContentsModal: {
      type: Boolean,
      default: false,
    },
    title: {
      type: String,
      default: "",
    },
  },
  data() {
    return {
      showRelated: false,
    };
  },
  setup() {
    const state = reactive({
      titleUrl: require("@/assets/image/region1/bg_char_title_v2.png"),
      titleUrlMo: require("@/assets/image/region1/bg_char_title_v2_mo.png"),
    });
    return {
      ...toRefs(state),
    };
  },
};
</script>

<style scoped></style>
