<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v4">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    당신을 지켜줄 3미터 우주 거인 수호자 '커엽이'
                </p>
                <p class="main-character-text2">
                    "세상을 떠돌며 자유로운 거인을 꿈꾼다"
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">21세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">3m</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#내성적인 #자연친화적 #은근팩폭</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">농구, 드라이브</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">자유자재로 커졌다 줄어들었다 하는 키</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title">커엽이 이야기</h3>
            저장강박에 빠진 아버지 밑에서 자연스럽게 쓰레기 더미들과 함께 성장했다.<br/>
            처음에는 쓰레기라 생각하지 못하고 다양한 장남감들이 우리집에는 많구나라고 생각했지만 아니었다. 그 것들은 죄다 쓰.레.기였다.<br/>
            다시는 여기서 나갈 수 없을 정도로 점점 차오르고 차올라 현관 입구가 막히는 순간 나는 포기했다. 나는 이 문 밖에 나가선 안 되는 건가?<br/>
            여기 사람이 살고 있어요!<br/>
            매일 나를 기다리는 누군가는 있긴 있었다. 꿈속의 그녀, 꿈속의 그들, 유일한 나의 친구. 차라리 이 꿈에서 깨어나고 싶지 않다.<br/>
            선호가 찬장을 열자 손톱크기의 바퀴벌레 몇 마리가 선호의 팔위로 떨어졌다.<br/>
            선호는 놀란 기색도 없이 꿈틀거리는 벌레를 털어내곤 찬장을 뒤적였다. 마지막 하나 남은 라 면이 먼지를 뒤집어 쓴 채 선호의 손에 들려나왔다.<br/>
            쓰레기로 뒤덮인 집안에서 쓸 만한 냄비를 찾는 일은 무척이나 어려웠다. 씽크대를 한참 뒤적 이던 선호는 음식물이 말라비틀어진 양은 냄비 하나를 꺼내 대충 물로 헹궜다.<br/>
            가스가 끊긴지는 오래였다. 선호는 현관으로 가 휴대용 가스버너 위에 냄비를 올렸다. 낡은 신발들이 엉망으로 쌓여있었지만 선호는 태연하게 라면을 끓였다.<br/>
            라면스프와 면과 물이 뒤섞여 끓어오르는 모양새를 보며 그는 어릴 적 기억을 한줌 끄집어냈 다.<br/>
            “선호야 아빠 왔다. 이리 와봐”<br/>
            선호의 아빠 석정은 매일 밤 공사현장에서 퇴근하는 길에 선호의 선물이랍시고 주머니에 작은 잡동사니를 담아왔다. 아빠는 주렁주렁 달린 조끼의 주머니에서 병뚜껑이라든가. 때가 탄 목 각인형 따위를 소중히 꺼내 선호의 손에 쥐어 줬다. 그는 자신의 수집품을 받아들고 웃음을 터뜨리는 어린 아들을 보며 아주 위대한 업적을 이룬 표정을 지었다.<br/>
            선호의 아빠 석정은 광적으로 수집품을 모았다. 그가 모은다는 수집품은 쓰레기와 별반 다를 게 없었다. 언젠가부터 집은 석정이 수집품을 보관하는 장소가 됐다. 몇 해가 지나자 집 안은 발 디딜 틈도 없게 됐다.<br/>
            선호는 쓰레기더미 속에서 유영하며 유년기를 보냈다. 직물 사이에 피어난 퀴퀴한 곰팡이 냄 새와 음식물이 부패되는 악취 속 어딘가에서 선호는 숨을 참고 팔을 휘저었다.<br/>
            <br/>
            선호가 17살이 되던 해 석정은 사라졌다. 그가 그토록 열심히 모아왔던 수집품을 내버리고서, 자신의 하나뿐인 아들을 남겨두고서 홀연히 사라졌다.<br/>
            선호는 그가 떠나던 날 밤을 기억했다.<br/>
            그날 퇴근하고 돌아온 그의 손엔 아무것도 들려있지 않았다. 그는 더러운 교복을 입고 쓰레기 틈에 앉아 있는 아들을 흘깃 보다가 작은 짐 가방을 들고 집을 나갔다.<br/>
            첫눈이 내리는 날이었다.<br/>
            밤 새 내린 눈은 그가 떠나간 발자취를 꽁꽁 숨겼다.<br/>
            선호는 그날부로 스스로를 낡고 작은 집에 가뒀다. 그 집이 자신의 세상의 전부인 듯 살았다. 한 달에 한번 꼴로 복지단체가 두고 가는 라면 박스가 아니라면 선호는 곧 죽었을 테다.<br/>
            선호는 세상 어딘가에서 무언갈 수집하고 있을 그 남자의 얼굴을 떠올리려 애썼다. 희미한 기 억의 잔상을 따라 선호의 미간이 움츠러들 때 바깥이 갑자기 소란스러워졌다. 선호는 남자를 떠올리기를 멈추고 창 가까이 다가갔다.<br/>
            선호는 어떤 호기심과 약간의 기대감을 가지고 창을 막고 있는 박스를 옆으로 밀어냈다. 그러 곤 창 틈 사이로 밖을 내다봤다.<br/>
            초등학생쯤 되어 보이는 아이 둘이 집 대문 앞에 서있었다. 살집이 있고 볼이 붉은 아이가 다 먹은 쭈쭈바 쓰레기를 들고 말했다.<br/>
            “내가 이거 저 옥상까지 던져볼게.”<br/>
            친구의 포부 넘치는 말에 깡마른 아이는 소심하게 말했다. “야. 여기 누구 사는 곳 같은데... 그러지 말자”<br/>
            “살긴 누가 살아. 이런 쓰레기통에”<br/>
            피식 웃으며 대꾸한 통통한 남자아이는 쭈쭈바 쓰레기를 옥상을 향해 힘차게 던졌다. 하지만 그것은 멀리 날아가지 못하고 선호가 서 있는 창문에 맞고 떨어졌다.<br/>
            팅-<br/>
            갑작스런 소음에도 선호는 어떤 소리도 내지 않았다.<br/>
            그때 깡마른 아이가 선호와 눈이 마주쳤다.<br/>
            미동도 없이 아이들을 지켜보던 선호의 눈이 휘둥그레 졌다. 눈을 크게 뜬 선호를 본 아이는 비명을 지르며 뒤로 넘어졌다.<br/>
            “아악! 귀신이야!”<br/>
            <br/>
            “으이구 멍청아 귀신이 어딨다고,,, 으악 귀신이야!”<br/>
            친구를 나무라던 통통한 아이도 선호를 보더니 비명을 지르기 시작했다.<br/>
            “쓰레기 귀신이야!!”<br/>
            아이들은 즐거운 놀이를 버려두고 줄행랑을 쳤다.<br/>
            선호는 한참동안이나 아이들이 떠난 곳을 바라보고 있었다. 하나 남은 라면이 불든 말든 상관 없었다. 단지, 무려 두 달 만에 본 사람이 그렇게 떠나버린 게 무척 괴로울 뿐이었다.<br/>
            해가 지고 있었다. 창틈 사이로 붉은 노을빛이 방 한가득 쌓인 쓰레기를 비췄다. 자신과 같은 색으로 물든 잡동사니를 보며 선호는 무언갈 깨달은 듯이 말했다.<br/>
            아 그렇구나.<br/>
            목소리가 갈라져서 나왔다. 너무 간만에 말을 해본지라 목소리가 잘 나오지도 않았다. 선호는 목을 가다듬지도 않고 낮고 거친 목소리로 말을 이었다.<br/>
            나는 쓰레기구나.<br/>
            나는 쓰레기구나. 쓰레기구나. 쓰레기구나.<br/>
            같은 말을 반복하던 선호는 곰팡이로 얼룩진 매트리스 위에 엎어지듯 누웠다.<br/>
            그 누구도 내 존재를 모르는 것도, 피하기 급급한 것도, 사랑해주지 않는 것도, 내가 쓰레기여서 그랬구나. 난 여기 있는 이것들과 같구나.<br/>
            그래서 나의 아비는 나까지 이곳에 두고 갔구나.<br/>
            선호는 오랜만에 눈물을 흘렸다. 슬퍼서기보다는 놀랐기 때문이다. 그동안 아무런 욕구도, 세 상에 대한 미련도 없이 살았는데, 실은 자신도 사랑받길 바란다는 걸, 누군가 날 봐주길 원한 다는 걸 알아채 버렸으니 말이다. 그의 놀란 감정은 얼마 안가 좌절로 뒤 바뀌었다.<br/>
            쓰레기 더미가 되어버린 이 집을 영영 벗어날 수 없다는 생각 때문이었다.<br/>
            아무도 날 원하지 않고 아무도 내가 나오길 바라지 않으니까.<br/>
            그래. 이 쓰레기 더미에서 죽게 된다면, 다음 생은 히피로 태어나자<br/>
            선호는 문득 어릴 적 집안 한 켠에 쌓여있던 잡지를 떠올렸다. 긴 머리카락을 휘날리고 청자 켓<br/>
            을 입고 노래를 부르며 자유롭게 돌아다니는 히피, 다함께 술을 마시고 춤을 추고, 노래하고, 들판에 누워 별을 구경한다는 그들로 태어나야겠다고 생각했다.<br/>
            <br/>
            그들 속에서 살아가면 인간으로 살 수 있을 거란 확신이 들었다. 선호는 몇 년 동안이나 응축된 감정을 토해내고는 까무룩 잠에 들었다.<br/>
            가벼운 통기타 소리와 함께 사람들의 노래 소리가 들렸다.<br/>
            선호는 정겨운 음색의 노래에 눈을 떴다. 감옥 같던 방은 사라지고 눈앞엔 넓은 초원이 펼쳐 져 있었다. 눈을 껌벅거리던 선호는 자신이 누워있던 곳의 여린 풀잎을 손으로 몇 번이고 쓸 어보았다. 보드라운 풀잎의 결 하나하나가 손끝에서 느껴졌다. 선호는 천국이 있으면 이런 곳 이겠거니 생각했다.<br/>
            아 드디어 죽은 건가? 내 소원이 이뤄진 걸까.<br/>
            선호는 슬픔과 기쁨을 동시에 느꼈다.<br/>
            선호는 노래 소리의 근원지를 찾기 위해 두리번거렸다. 들판 저편의 커다란 나무 근처에 사람 들이 모여 있었다. 머리를 땋은 남자가 우쿨렐레를 연주하고 있었고, 그 음에 맞춰 사람들은 다 함께 노래하고 있었다.<br/>
            Going to California with an aching in my heart<br/>
            그들은 평화로워보였고, 행복해 보였다. 선호는 그들을 한참동안 바라봤다. 그때였다. 곱슬거 리는 갈색 머리를 한 여성이 선호를 보고는 다가왔다. 그리곤 다정한 목소리<br/>
            로 말을 걸었다. 선호가 잡지에서 본 히피 같았다.<br/>
            “기다렸어. 우리 같이 노래하자.”<br/>
            선호는 사람의 온기가 낯설어 몸을 한껏 움츠렸다. 갑작스러운 상황에 입이 굳어 말이 나오지 않았다. 여자는 그런 선호를 이해한다는 듯 미소 지으며 말했다.<br/>
            “괜찮아, 여기선 아무상관 없어”<br/>
            그녀는 선호의 손목을 잡고 일으켜 세웠다. 그리고 천천히 거대한 나무의 근처로 인도했다. 노래를 부르던 사람들이 선호를 발견하곤 그의 곁으로 다가왔다. 선호는 몸을 더 웅크리기 시 작했지만 그들의 말을 듣고선 이내 긴장감을 풀 수 있었다.<br/>
            “기다렸어요.” “드디어 왔구나.”<br/>
            선호는 이곳이 원래 자신이 있던 곳, 그리고 있어야 하는 곳처럼 느껴졌다. 그는 아주 당연한 것처럼 그들 사이에 스며들었고 함께 노래하며 춤췄다. 어느덧 밤이 왔다. 그들은 모닥불을 사이에 두고 둘러 앉아 밤하늘의 별을 올려다보고 있었<br/>
            다. 선호는 그들과 조금 떨어져 앉아 타닥타닥 타오르는 모닥불을 응시하고 있었다.<br/>
            저 모닥불이 꺼지지 않길, 이 시간이 영원하길 빌고 있었다. 그때 누군가가 선호의 곁에 앉았<br/>
            <br/>
            다. 처음 그에게 말을 걸었던 곱슬머리 여자였다.<br/>
            선호는 그녀에게 멋쩍은 웃음을 보였다. 선호에게 화답하듯 미소를 지은 그녀는 말했다.<br/>
            “이젠 준비가 된 것 같구나.” 여자의 말에 선호는 물었다.<br/>
            “무슨 준비요...?”<br/>
            그녀는 싱긋 웃으며 선호의 질문에 답하지 않고선 말을 이어갔다.<br/>
            “저 높은 곳에서 만나자. 그땐 또 다른 널 볼 수 있겠네. 즐거운 여행되길.”<br/>
            그리곤 선호의 어깨를 뒤로 살짝 밀었다. 선호는 무기력하게 뒤로 밀렸다. 시야가 점점 흐려 졌다.<br/>
            “안 돼..! 안 돼!!”<br/>
            자신을 유일하게 받아준 곳에서 버림받는다는 두려움에 선호는 손을 휘적거리며 그들을 잡으 려 했지만 그들은 일렁이는 빛 속으로 사라졌다.<br/>
            안 돼... 날 버리지 마...!<br/>
            선호는 그 달콤한 꿈에서 깨어났다. 너무 달아서 잔인한 꿈이었다. 선호는 자신이 있는 세계, 영원히 도망칠 수 없는 쓰레기 더미를 바라봤다.<br/>
            선호는 어딘가 달라졌음을 느꼈다. 쓰레기 더미는 여전한데 이전의 악취가 느껴지지 않았다. 방에서 있을 때의 그 우중충한 기분도 없었다. 뭐든지 할 수 있는 기분이었다. 마치 이 공간 은 제 것이 아닌 것 같았다.<br/>
            그때였다. 선호는 자신의 몸이 붕 뜨는 걸 느꼈다.<br/>
            “어...어?”<br/>
            선호는 시선을 아래로 옮겼다. 하지만 두 발은 여전히 바닥에 딱 붙어있었다. 선호는 점점 가까워지는 천장을 보고 깨달았다.<br/>
            “내 몸이 커지고 있어”<br/>
            선호의 몸은 계속해서 자라났다. 마치 이상한 나라의 엘리스가 알 수 없는 차를 마시고 커졌 던 것처럼.<br/>
            선호의 몸은 집을 꽉 채울 정도로 커졌다. 선호는 집이 부서질까봐 몸을 움츠렸지만 그 낡은 방에겐 역부족이었다.<br/>
            곧 우드득- 하는 소리와 함께 천장 합판이 으스러졌다. 오랜 기간 동안 방치됐던 터라, 비스<br/>
            <br/>
            킷 마냥 쉽게 부서졌다. 선호는 계속 몸을 움츠리고 있었다. 이 모든 상황이 두려웠다. 소름끼 칠 만큼 생생한 꿈부터 갑자기 자라나는 몸까지. 눈을 꼭 감고 모든 상황이 해결되기를 기다 리고 있었다.<br/>
            그 순간 부서진 천장으로 봄의 내음이 들어와 움츠린 선호의 코를 간질였다. 뿌리 칠 수 없는 향기였다. 간질간질한 생명의 소리도 선호의 귓가에 속삭였다. 벚꽃이 막 피어오르고 겨울 동 안 인내하던 새싹들이 세상에 첫 숨을 내쉬는 향기, 봄비에 굳었던 땅들이 다시 새 생명을 얻 는 그 소리를 누가 거부할 수 있으랴.<br/>
            선호는 조심스레 고개를 들었다. 그리고 부서진 천장으로 고개를 내밀어 바깥을 바라봤다. “와..”<br/>
            선호는 짧게 탄식 할 수밖에 없었다. 바깥엔 새로운 세상이 펼쳐져 있었다.<br/>
            서울 변두리에 있는 오래된 자신의 동네가 아니었다.<br/>
            오묘한 보랏빛의 하늘과 그 아래 펼쳐진 은빛 도시, 그 뒤편으로 보이는 푸른 숲까지. 한번쯤 그가 꿈꿨던 세계였다.<br/>
            정신을 놓은 채 선호가 풍경을 감상하고 있을 때였다. 바람을 타고 몽환적인 노래 소리가 들려왔다.<br/>



            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal4",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title4.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title4_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
