<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v23">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    날씨를 컨트롤하는 매력적인 여우신 '주미호'
                </p>
                <p class="main-character-text2">
                    "사람들을 유혹해 <br/>자신의 매력에 빠지게 하는 것!"
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">715세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">170cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#에너제틱#똑부러짐</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">기상방송 시청</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">사람들의 희망에 따라 날씨 컨트롤</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 주미호 이야기</h3>
            “강미주! 학교 안 갈 거야?!” “지금 나간다고!”<br/>
            나는 퍽 짜증스러운 목소리로 엄마에게 대꾸하며 신발을 신었다.<br/>
            엄마는 그런 말투에도 개의치 않고 주방에서 달려 나와 내 입에 꼬마김밥 하나를 밀어 넣었 다.<br/>
            “미주야 얼른 아 해, 이거 하나 먹고 가”<br/>
            “아 됐어, 안 먹어.”<br/>
            난 그런 엄마의 손을 밀어내고는 현관을 박차고 나갔다. “요즘 애가 왜 저렇게 심통을 부린다니...”<br/>
            그래, 맞다. 난 심통이 나있다. 그것도 굉장히 왜냐하면...<br/>
            “미주야! 같이 가자” 바로 저 놈 때문이지. “너보고 달려왔어”<br/>
            박강민, 뭘 먹고 큰 건지 모를 훤칠한 키에 진한 눈썹, 그리고 댕댕미가 넘치는 환한 미소에 다정한 말투까지. 이놈은 내 심통 지분의 50퍼센트를 차지하고 있다. 그럼 나머지 50퍼센트는 누구냐고?<br/>
            “박강민! 너 왜 갑자기 뛰고 그래,” 강민을 향해 달려오고 있는 쟤. “어? 미주 하이! 오늘 또 만나네.”<br/>
            얼마 전에 갑작스레 전학 와 박강민과 나 사이에 끼어든 존재.<br/>
            하리나.<br/>
            하얀 피부와 구불거리는 갈색머리. 고양이 같은 눈매를 가지곤 주변사람들을 모두 지나가는 행인 1로 만들어버리는 여자애였다.<br/>
            리나의 눈길은 강민만을 향햐고 있었지만 유난히 눈치 없는 강민은 아주 해맑은 목소리로 내 게 말했다.<br/>
            <br/>
            “미주야 같이 등교하자!”<br/>
            “나도 미주랑 친해지고 싶었는데 같이 가면 진짜 좋겠다.”<br/>
            덩달아 리나까지 그렇게 말했지만 괜히 선남선녀들 사이에 끼인 눈치 없는 도토리가 되고 싶 진 않았기에 애둘러 거절했다.<br/>
            “아...아냐. 난 친구 만나서 같이 가기로 해서. 민정이 알지? 나랑 같이 다니는 애.” “그래? 그럼 학교에서 보자!”<br/>
            나는 멀어지는 둘의 뒷모습을 바라만 보고 있었다.<br/>
            민정이는 무슨, 걔 학교 기숙사 사는데.<br/>
            나는 길가의 돌을 툭툭 치며 그 둘이 시야에서 사라지기를 기다렸다.<br/>
            강민은 내 소꿉친구다. 서로 다른 중학교에 진학하며 사이가 멀어졌지만, 고등학교에서 다시 재회하며 가까워 졌다. 근 3년 만에 만난 강민은 많이 달라져 있었다. 나랑 키가 비슷했던 것 같은데 머리 하나 차이가 날 정도로 훌쩍 자라 있었고, 통통하던 볼 살도 사라져있었다. 다정 한건 매한가지지만...<br/>
            강민과 나는 다시 빠른 속도로 친해졌다. 같은 동네에 사는지라 등하교도 함께했고, 종종 학 교가 끝나고 분식점에서 군것질을 하기도 했다. 물론 우리가 특별한 사이는 아니지만, 강민과 함께 있으면 즐거웠고 난 그게 좋았다.<br/>
            걜 좋아한다거나 한 건 아니다. 단지 오랜 친구를 다시 만나니까 즐거웠을 뿐이다. 그런데 2 주전, 하리나가 우리 반에 전학을 오며 모든 게 달라졌다.<br/>
            예쁜 얼굴에 사교적인 성격의 하리나는 누구와도 쉽게 친해졌고, 다른 아이들도 리나에게 모 두 호의적이었다. 리나는 우연히 점심시간에 농구 중이던 강민을 보고는 너무 멋있다며 입이 닳도록 칭찬했다. 그렇게 지금 이 상황까지 온 거다.<br/>
            졸지에 나는 등하교 친구와 군것질 친구까지 몽땅, 뺏기게 됐다. 강민에게 새로운 친구가 생 기는 걸 싫어하는 건 아니지만 유난히 리나랑 있는 모습을 보면 심통이 났다.<br/>
            한참 뒤에야 하는 다시 학교로 향했다.<br/>
            “에효오오오오오”<br/>
            “고마해! 땅 꺼지겄어”<br/>
            땅이 꺼져라 한숨을 쉬어대는 날 보고는 민정이 내 등짝을 찰싹 때렸다.<br/>
            “요즘 따라 매일 이러네. 이가시나. 고민이 있음 말을 하던가. 왜 말도 않고 이런다냐.” “고민은 무슨 고민, 사는 게 너어어무 즐거워서 죽을 것 같은데”<br/>
            “죽상을 해가지고 즐겁긴 뭐가 즐거워”<br/>
            <br/>
            중학교 2학년부터 친하게 지내온 민정은 지나치게 털털한 성격이었다. 문제가 있으면 당장ᄋ 해결해버리는 스타일이랄까. 그렇기에 민정에겐 이런 사소하고 치사한 고민을 털어놓을 수 없 었다. 말해봤자 분명<br/>
            ‘야 니는 그게 뭔 고민이고 이써봐라. 언니가 해결해 주께.’<br/>
            라고 말하며 리나와 강민 그리고 나를 삼자대면 시킬 인물이었다.<br/>
            절대, 절대 말할 수 없었다. 아니 말해선 안됐다.<br/>
            으으<br/>
            나는 지끈거리는 머리를 둘둘만 담요 쏙으로 푹 박았다.<br/>
            “뭐... 뭐여 쟤가 왜 일로 오는 건데” “왜 누군데 그래”<br/>
            나는 민정의 말에 고개를 들었다. 내 앞에 서 있는 건 하리나였다. 항상 그렇듯 싱그러운 미 소를 지으면서.<br/>
            “미주야. 왜 아까 같이 안 갔어! 나도 너랑 친해지고 싶었는데”<br/>
            “어..? 하하 그냥...”<br/>
            어떤 반응을 보여야 할지 몰라 눈을 데굴데굴 굴리는데 마침 타이밍 좋게 수업종이 울렸다. 휴우 다행이다<br/>
            리나는 안도하는 내 표정을 눈치 챘는지 씨익 웃고는 내게 쪽지 하나를 건네고 자리로 돌아갔 다.<br/>
            난 작은 쪽지를 조심스레 폈다.<br/>
            물어 볼 거 있는데, 점심시간에 옥상으로 와 줄 수 있어?<br/>
            무슨 생각이지?<br/>
            나는 침을 한번 삼키고 리나의 자리를 쳐다봤다. 리나는 내 표정을 보고 베시시 웃어 보일 뿐 이었다.<br/>
            리나는 내게 불편한 존재였다. 강민 때문이기도 했지만. 꼭 강민과의 관계 때문이 아니더라도 리나는 불편했다. 우리는 어울리기 적합한 친구가 아니었다.<br/>
            친구에 등급을 메겨둔 건 아니지만 우리 모두 본능적으로 알지 않는가? 내가 어울릴 등급은 아니구나, 라는 걸.<br/>
            나는 낮은 등급이었고 리나는 상위등급이라고 볼 수 있다. 그 생각에 나는 리나 앞에서 항상 위축됐다.<br/>
            쪽지를 본 이후부터 평소엔 잘 가지도 않던 수업시간이 엄청난 속도로 지나갔다. 나는 급식을 먹는 둥마는둥하고는옥상으로쫓아올라갔다.<br/>
            리나는 다른 친구 두명과 옥상에 있었다. 그 둘을 잘 알지는 못했지만 그들도 리나만큼이나 나와 어울리지 않는 무리라는 걸 알 수 있었다. 나는 그들 앞에서 절로 주눅이 들었다.<br/>
            <br/>
            “미주야 왔어?! 내가 갑자기 불러서 놀랐지!”<br/>
            “아냐...하하”<br/>
            자연스럽게 웃고 싶었는데...<br/>
            염소 같은 목소리만 내는 내 목을 한 대 쥐어박아주고 싶었다.<br/>
            “미주야 내가 있잖아... 사실 너한테 부탁하고 싶은 게 있거든”<br/>
            리나는 갈색의 윤기도는 머리카락을 꼬며 말했다. 그 모습은 같은 여자가 봐도 너무 상큼해서 어떤 부탁을 해도 들어줄 수 있을 것 같았다.<br/>
            “나 내일 고백하려 하는데. 도와줄 수 있어?”<br/>
            “고백?”<br/>
            “응, 강민이 한테”<br/>
            강민의 이름을 듣자마자 내 입꼬리가 굳어지는 게 느껴졌다.<br/>
            “어려운건 아니고... 네가 강민이랑 오래 알고 지냈다고 들어서. 그냥 강민이 어떤 거 좋아하 는 지 얘기 좀 해줘! 부탁할게”<br/>
            안돼, 알려주지 마!<br/>
            솔직한 속마음이 내게 그렇게 말하고 있었지만 내입은 강민에 대한 정보를 술술 불고 있었다.<br/>
            “강민이는 초콜릿 보다 사탕을 좋아하고... 그리고 좋아하는 색은 파란색. 파스텔 톤은 안 좋 아해. 그리고 농구랑 축구 잘하구... 그리고...”<br/>
            “진짜 너밖에 없어 나 강민이랑 잘되면 맛있는 거 사줄게.”<br/>
            리나는 내손을 꼭 잡으며 말했다.<br/>
            나는 얼떨떨한 기분으로 붙들려있었다.<br/>
            “아 그리구 이건 선물.”<br/>
            정신을 차렸을 땐 내 손엔 틴트 하나가 들려있었다. 거의 다 쓴 틴트 하나.<br/>
            “난 쿨톤이어서 색이 잘 안 맞더라구, 이런 색은 좀 어두운 톤인 애들한테 잘 어울린 데서, 이거 너 써!”<br/>
            그 불쾌한 호의를 걷어차고 싶었지만, 이 멍청한 몸뚱이는 그럴 줄을 몰랐다. “고마워,”<br/>
            리나와 아이들은 날 남겨둔채 옥상에서 내려갔다. 난 멍하니 쓰다 남은 틴트 통을 보고 있었다.<br/>
            “멍청이...”<br/>
            <br/>
            솨아아-<br/>
            그때였다. 하늘은 내 마음을 대변하기라도 하듯 빗줄기를 쏟아냈다. 먹구름 하나 끼지 않았는 데, 비는 청승맞게 내리고 있었다. 나는 가만히 서서 비를 맞았다.<br/>
            누군가 옥상 구석에서 날 보고 있다는 것도 모른 채.<br/>
            곧 예비종이 울리자 난 틴트를 교복주머니에 넣고 교실로 돌아갔다.<br/>
            “정미주! 넌 왜 비를 홀딱 맞고 왔다냐.”<br/>
            내 생쥐같은 꼴을 보고 민정이 말했다.<br/>
            “갑자기 비가 쏟아져 가지고...”<br/>
            시무룩한 내 표정을 본 민정은 더 이상 캐묻지 않고 말을 돌렸다. “근데 너 이런 비를 뭐라고 하는지 알어?<br/>
            여우비라고 한다. 이렇게 맑은 하늘에 내리는 비 말이여.” 나는 민정의 배려에 내심 고마워하며 물었다.<br/>
            “왜 여우비라 하는데?”<br/>
            “구름이 어떤 여우를 사랑했거든, 근데 그 여우가 시집을 가게 된 거야. 시집가는 날 축하는 해줘야겠는데 속은 상하고 하니까 차마 펑펑 울진 못하고 숨어서 운거지. 그래서 맑은 하늘에 비가 내리게 된 거야.”<br/>
            “그게 뭐야”<br/>
            나는 픽하고 웃으며 말했다. “뭐 그런 전설이 있대.”<br/>
            여우비. 여우비... 여우비라...<br/>
            가볍게 웃고 넘겼던 여우비 이야기는 내 저녁식사까지 쫓아왔다. “미주야, 왜 밥도 안 먹고 멍하게 앉아 있어”<br/>
            “으응?”<br/>
            맞은편의 엄마가 내게 물었다.<br/>
            “아냐. 그냥 좀...”<br/>
            “얘가 요즘 들어 왜 그래?”<br/>
            “혹시 학교에서 무슨 일 있니?”<br/>
            엄마의 쓸데없는 걱정에 아빠까지 합세했다.<br/>
            <br/>
            “아니 일은 무슨...”<br/>
            “혹시...좋아하는 사람이라도 생겼어?”<br/>
            “그런 거 아니래도!!!”<br/>
            “왜 소리를 지르구 그래...”<br/>
            “미안...”<br/>
            난 저녁을 다 먹지도 않고 방으로 들어와 누웠다.<br/>
            좋아하기는... 누가 누굴 좋아한다고...<br/>
            내심 부정하긴 했지만, 난 알고 있었다. 내 첫사랑이 시작됐음을. 오늘 리나에게 느낀 감정은 정확히 질투였다.<br/>
            내가 여우를 사랑한 구름이 되었구나...<br/>
            난 깊은 밤이 될 때까지 잠에 들지 못했다. 내일이면, 리나가 강민에게 고백을 한다는 사실 때문이었다.<br/>
            고백 받아 주겠지? 리나는 성격도 밝고 예쁘니까...<br/>
            “후우-”<br/>
            난 잠들기를 포기하고 창문을 열고 밤하늘을 올려다봤다. 유난히 별이 밝은 밤이었다.<br/>
            밤하늘의 별자리를 유추하고 있을 때였다.<br/>
            “어 별똥별!”<br/>
            작은 별똥별이 호를 그리며 내려오고 있었다. 소원! 빨리 소원 빌어야해!<br/>
            나는 재빨리 눈을 감고 소원을 빌기 시작했다.<br/>
            별똥별님 저도 당당하고 사교적인 성격이 되게 해주세요! 그리고...<br/>
            강민이가 고백 안 받게 해주세요!<br/>
            이건 들어주셔도 되고, 못들은 척 해도 돼요!<br/>
            나는 힘줘 꼭 감았던 눈을 조심히 떴다. 이미 별똥별은 보이지 않았다.<br/>

            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal23",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title23.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title23_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
