<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v13">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    돈 쏟아지게 하는 벼락같은 샤우팅! <br />
                    영앤리치 꽃미남 로커 '돈벼락'
                </p>
                <p class="main-character-text2">
                    “돈 걱정 없이 노래하는,<br />영하지만 리치한 삶”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">32세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">185cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#시크하고싶어함#멋짐뿜뿜</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">명품쇼핑</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">일렉기타에서 나오는 돈 가루</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 돈벼락 이야기</h3>
            아버지의 직업을 통째로 이어 받은 남자.<br/>
            누군가에게 도움을 주는 존재로써 인정 받는 다는 것은 이 직업을 물려받기에 충분했다. 하지만 욕심내지 말아야 하는 것, 지켜야 하는 선, 눈을 감고 귀를 닫아야 하는 것이 너무 많았다. 이 것이 아버지와 내가 다른 부분이었다.<br/>
            당연한 것들이 나에게는 불편한 것들이었다.<br/>
            이것들이 모여 나중에 내 인생이 통째로 흔들릴만한 일을 낳을 것이라곤 상상도 하지 못했다.<br/>
            영웅의 몰락이란 이런 걸까.<br/>
            우진은 병실 창가에 앉아 꾸벅꾸벅 졸고 있는 아버지 정철의 뒷모습을 보며 생각했다. 우진에게 아버지란 선생이었고 선배였으며, 세상이었다. TBS 신문사 회장의 수행비서로 일하던 아버지를 보고 그도 수행비서의 길을 걸었다. 우진은 직업뿐만 아니라 아버지의 신념 또한 이어받았다.<br/>
            ‘우진아, 사람의 가치는 스스로 정하는 게 아니다. 타자가 있기에 내가 존재하는 것이고 내가 있기에 타자가 존재할 수 있는 거란다. 누군가의 인정이 있기에 내가 가치 있어 지는 거란다.’<br/>
            도진은 어릴 때부터 아버지가 항상 하던 말을 떠올렸다.<br/>
            누군가에게 인정받는 것, 그게 그 부자의 신념이었다.<br/>
            하지만 40 년 경력의 유능한 수행비서였던 그의 아버지 정철은 한 순간 무너졌다. 내부 분열로 정철이 모시던 전 회장이 벼랑 끝으로 몰리고 회장이 개인적으로 만든 비자금이 드러나자 그는 모든 걸 정철에게 뒤집어씌우고 사임했다.<br/>
            ‘5년,5년만 빵에 가있어. 그럼 내가 너 평생 책임진다.’<br/>
            정철은 어떤 질문도 하지 않고 회장의 말을 따랐다. 그는 회장에게 둘도 없는 충견이었으니까. 토사구팽이었다. 5 년 후 출소한 우진의 아버지는 전 회장을 다시 만날 수 없었다. 정철은 그에게 그저 쓰다 버리는 부품조각이었다. 정철은 매일 밤을 술로 지새웠다.<br/>
            몇 년 후, 그는 58 세라는 나이에 간경화를 진단받았다.<br/>
            <br/>
            ‘상태가 좋지 않습니다. 간이식을 준비해야 할 땝니다. 공여자를 기다리기에도 시간이 많이 촉박합니다.’<br/>
            아버지의 뒷모습을 바라보던 우진의 의사의 말을 떠올렸다. 우진은 차마 아버지께 다가가지 못하고 병원을 빠져나왔다.<br/>
            다음날, 우진은 대표이사실 앞을 서성거리고 있었다. 간이식 수술을 하게 된다면 최소 2 주는 휴식을 가져야 한다. 그동안 일을 병행하긴 어려울 터, 이 말을 어떻게 전해야 할지가 고민이었다. 회사상황이 좋지 않음은 수행비서인 우진이 누구보다 잘 알았다.<br/>
            곧 문이 열리고 대표이사가 나왔다. 짙은 회색 정장을 입은 그는 우진을 보고 짜증섞인 목소리로 말했다.<br/>
            “한동안 이런 자질구레한 일정 잡지 마. 가지.” “네”<br/>
            최근 시작한 온라인 커머스 홍보를 위해 sns 에서 챌린지를 시작한 터였다. 관련 사진을 찍기 위해 이동 중이었다.<br/>
            우진이 일하고 있는 정진유통은 온, 오프라인 매장과 식품유통, 홈쇼핑, 백화점 등 여러 방면으로 발을 뻗치고 있는 대기업이었다. 하지만 최근 내부고발로 납품비리의혹이 터지며 곤욕을 치르고 있었다.<br/>
            대표이사의 옆자리에 앉아 일정을 브리핑하던 우진은 그가 불쑥 건넨 파일 때문에 말을 멈췄다.<br/>
            “이번 사건 관련 회사야. 찾아가서 사인 받아와.” “네”<br/>
            분명 비밀유지가 관련된 조항이 들어있으리라. 대기업의 횡포에 가까운 일이었지만 나는 군말 않고 파일을 받았다.<br/>
            “이사님, 현재 아버지가 많이 편찮으십니다.”<br/>
            이사는 불쑥 꺼낸 내 개인사에 날 흘겨봤다.<br/>
            <br/>
            “제 간을 이식하기로 했습니다. 적어도 2 주 동안 부득이하게 휴가를...” “안 돼, 지금 어떤 상황인지 누구보다 자네가 잘 알지 않는가.”<br/>
            이사는 대수롭지 않은 일을 거절하듯이 말했다.<br/>
            우진은 더 이상 말을 꺼내지 않았다. 우진이 무려 2 년간 봐온 사람이었다. 더 이상 말을 꺼냈다간 욕설이 날아올게 뻔했다.<br/>
            퇴근길이었다. 점점 말라가는 아버지를 떠올린 우진은 암담했다. 회사를 벗어나 주차된 차 앞에 섰을 때, 정장을 입은 두 명의 남자가 우진에게 다가왔다.<br/>
            “저희 회장님께서 잠깐 부르십니다.”<br/>
            남자는 이 이상의 설명은 않은 채 우진에게 밝은 컬러의 명함 한 장을 건넸다.<br/>
            [지오유통 회장 강태식]<br/>
            정진유통의 경쟁사였다. 갑작스러운 상황에도 우진은 안색하나 변하지 않고 물었다.<br/>
            “무슨 일입니까”<br/>
            “가보시면 압니다.”<br/>
            그들은 위압적인 분위기를 풍기고 있었다. 우진이 가기를 거부한다면, 억지로라도 끌고 갈 심산이었다.<br/>
            우진은 자발적으로 가기로 결심하고 두 남자의 차에 올라탔다.<br/>
            그가 도착한 곳은 지오유통의 본사도, 고급 호텔도 아니었다. 충무로 인쇄소가 즐비한 거리에 위치한 허름한 사무실이었다. 간판은 따로 붙어있지 않았다.<br/>
            우진에게 불안감이 엄습했다. 이곳에서 쥐도 새도 모르게 죽는 건 아닐까 하는 생각이었다. 자신을 데리러 온 남자들도 꽤나 수상해 보였으니까.<br/>
            내부엔 낡은 테이블 하나와 1 인 쇼파 두 개가 마주보고 있었고 쇼파 한 곳에는 지오유통의 회장, 강태식이 앉아있었다. 나는 그에게 꾸벅 인사를 하고는 그에게서 멀찍이 떨어진 곳에 서있었다.<br/>
            “자네가 정우진이구만, 이리 와서 앉게나.”<br/>
            <br/>
            우진은 쇼파에 앉아 그의 말을 기다렸다. 우진은 자신의 긴장감이 표정으로 드러나지 않게 애썼다.<br/>
            “이런 허름한 곳으로 불러서 놀랐지? 허허.”<br/>
            우진의 예상과는 다르게 그는 친근하게 웃어 보였다.<br/>
            “아닙니다.”<br/>
            “30 년 전, 난 이곳에서 인쇄소를 했네, 그게 지오유통의 시작이었지. 그땐 내가 이렇게 큰 회사를 가지게 될 거라곤 상상도 못 햇는데.”<br/>
            강태식은 잠시 과거를 회상이라도 하듯 창밖으로 보이는 회색건물을 바라보고 있었다.<br/>
            “내가 귀한 손님을 너무 오래 붙잡고 있었군, 바로 본론으로 들어가지. 자네, 정진유통 내부 사정이 어떤지 알고 있겠지.”<br/>
            나는 긍정도 부정도 하지 않았다.<br/>
            “비리사건으로 꽤나 고생하고 있을 텐데...”<br/>
            회장은 테이블에 놓인 유리잔을 들어 살짝 흔들었다. 둥근 얼음이 양주 안에서 찰랑거렸다.<br/>
            “앞으로 세 번, 딱 세 번 더 폭로가 있을 예정이네. 그 후에 정진유통은 무너질 거야.”<br/>
            그 말에 우진은 표정을 숨기지 못했다. 태식을 바라보는 우진의 눈빛이 흔들렸다. 우진은 직감했다. 이 자가 저지른 일이구나.<br/>
            “이미 속부터 썩어가던 회사였어. 청소할 때가 온 거지. 그러기 위해선 자네 도움이 필요하네.” “왜 하필 접니까.”<br/>
            “너라면 할 거라 믿었으니까. 자네 아버지 박정철씨. 그렇게 만든 작자가 이번 선거후보에 나올 생각인가 보더군, 그 자를 지원하는 게 어딘지 아나?”<br/>
            “정진유통이라네.”<br/>
            <br/>
            우진은 TBS 전회장의 얼굴을 떠올리며 아랫입술을 씹었다. 하지만, 가능성이 가늠되지 않는 일을 위해 회사를 배반할 수 는 없었다.<br/>
            우진의 고민을 눈치 챈 회장은 턱짓을 해 문 앞에 서있던 정장의 남자에게 무언가 지시를 내렸다. 남자는 검은 철제가방을 들고 와 테이블에 놓곤 케이스를 열었다.<br/>
            돈다발, 노란 돈다발이었다.<br/>
            “아버지가 많이 아프시다지? 그런데 이런 상황에 일을 쉴 수도, 아버지를 간호할 수도 없는 상황이겠지. 3 억, 딱 3 억이네, 충분할거야.”<br/>
            돈을 본 우진은 급히 일어났다.<br/>
            “고민....해 보겠습니다.”<br/>
            “그래, 되도록 긍정적인 대답이면 좋겠군.”<br/>
            우진은 급히 그곳을 빠져나와 택시에 올라탔다.<br/>
            큰돈에는 그만큼의 위험이 따른다. 괜히 얽혔다간 무슨 꼴을 당할지 몰라.<br/>
            우진은 거칠게 머리를 쓸어 넘겼다,<br/>
            우진이 향한 곳은 아버지의 병원이었다. 매일 퇴근 후 들리고 있었지만 오늘은 예상치 못한 일로 조금 늦어졌다, 우진은 조금 전 벌어진 일을 얼른 잊기 위해 노력했다.<br/>
            병실 문을 열자 보이는 건, 불도 켜지 않고 티비를 보고 있는 아버지의 모습이었다. 티비 속엔 아홉시 뉴스가 흘러나오고 있었다.<br/>
            [TBS 전 회장 방영국씨가 이번 국회의원 선거에 출마하겠다는 뜻을 밝혔습니다....]<br/>
            티비에서 눈을 때지 않던 우진의 아버지 정철의 눈엔 어떤 삶의 의지도 느껴지지 않았다.<br/>
            “아버지...!”<br/>
            우진은 달려가 티비를 껐다.<br/>
            “뭐하고 계셨어요. 눈 안 좋아 져요.”<br/>
            <br/>
            이불을 쥔 손에 힘이 들어가는 게 느껴졌다. 정철은 고개를 푹 숙이고 말했다.<br/>
            “우진아, 내가, 내가 틀렸더구나. 누군가에게 신뢰를 얻는다는 게, 왜 그렇게 중요했을까.<br/>
            너에게 떳떳한 아버지가 되고 싶었는데, 내가 너한테 가르친 건, 누군가의 개가 되는 법이더구나.” “아버지 그럼 말씀 마세요!”<br/>
            “간이식은 됐다. 이 삶에 미련이 없어. 너도 이 판 뜨거라. 네가 하고 싶은 걸 해. 미안하다.”<br/>
            늦은 밤 병원을 나온 우진은 정처 없이 거리를 헤매다 거리 구석의 허름한 펍으로 들어갔다. 너무 시끄럽고 활기찬 분위기는 원치 않았기 때문이었다.<br/>
            펍의 내부는 생각보다 넓었고 낡아 보였다. 하지만 세 네 테이블에만 손님들이 있었다. 우진은 혼자 술을 홀짝이며 상황을 타개할 방법을 찾고 있었다.<br/>
            아버지의 간이식, 곧 망할 거라는 회사, 그리고 은밀한 유혹. 무엇하나 정리되지 않고 있을 때 펍 앞쪽의 공간으로 긴 머리를 한 남자가 일렉 기타를 매고 걸어 나왔다.<br/>
            삼삼오오 떠들던 손님들은 그의 등장을 전혀 눈치 채지 못하고 있었다. 남자는 자기소개도 않은 채 노래를 시작했다. 사람들은 다들 그를 어리둥절한 눈으로 바라봤다. 조용하게 흘러나오던 재즈 음악이 멈추고 남자의 고음 가득한 록 음악이 펍 안을 채웠다.<br/>
            누군 눈살을 찌푸렸고 누군 고개를 흔들었다.<br/>
            수행비서의 직업병처럼 우진은 그들을 관찰하며 세심히 반응을 보고 있었다. 우진은 곧장 알 수 있었다. 그 공간의 누구도 저 남자의 노래를 원치 않는다는 걸. 하지만 그는 누구도 신경 쓰지 않고 노래를 계속했다. 마치 엄청난 사명이라도 가진 것처럼.<br/>
            아무도 자신을 원하지 않는데, 아무도 자신의 가치를 인정해 주지 않는데 왜 노래하는 걸까. 우진은 순수한 호기심이 들어 무대에서 내려와 땀을 닦는 그에게 칵테일 한잔을 건넸다.<br/>
            남자는 씩 웃으며 우진을 바라봤다.<br/>
            “고마워요. 근데 저 술을 안 마셔서.”<br/>
            “그럼 왜 술집에서 노래해요?”<br/>
            “그냥 좋잖아요. 제 꿈이 가수라”<br/>
            “분위기랑 좀 안 어울리지 않아요? 그 노래”<br/>
            “그런가요? 전 꽤 잘 어울린다고 생각해서 선곡한 건데”<br/>
            우진은 해맑은 남자가 어쩐지 얄미워 직설적으로 물었다.<br/>
            <br/>
            “어떻게 그렇게 노래를 불러요? 아무도 관심도 없던데”<br/>
            “하하, 관심 받기 위한 노래는 아니었어요. 그냥 무대가 필요할 뿐이었죠. 그리고 당신은 제 노래 들었잖아요.”<br/>
            우진은 남자의 말에 반박할 수 없었기에 그를 위해 산 칵테일을 홀짝였다.<br/>
            “그런 전 다음 무대가 있어서 먼저 가볼게요.”<br/>
            우진은 펍을 나가는 남자의 뒷모습을 바라만 보다 그 남자가 얄미운 이유를 깨달았다. 질투심이었다. 누구의 시선도, 인정도 신경 쓰지 않은 채 오로지 자신을 위해 노래하는 그 남자가, 미치도록 부러웠던 거다. 돈에도 자신의 가치에도 얽매이지 않은 그 남자가.<br/>
            자유와 돈, 그리고 신념과 가치.<br/>
            우진은 추상된 단어들 사이에서 끊임없이 헤메고 있었다.<br/>
            늦게까지 펍에 앉아있던 우진은 저녁에 받은 명함을 꺼내들었다. 그리고 명함속의 연락처로 문자한 통을 넣었다.<br/>
            [회장님, 마음을 정했습니다.]<br/>

          <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal13",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title13.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title13_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
