<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v8">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    신비한 마력으로 사람들을<br class="mobile-only"/> 조종하는 인형술사 '실리아'
                </p>
                <p class="main-character-text2">
                    “아름다운 마녀가 되어 사람들을 판타지의 세계로 초대하고 싶다”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">777세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">176cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#화끈함 #나이를잊은몸과마음</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">인형놀이</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">인형을 이용한 독심술</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 실비아 이야기</h3>
            유럽의 작은 시골마을, 동네사람들의 마녀사냥으로 진짜 마녀가 되기로 마음먹은 소녀‘리아’ 생명의 힘을 가진 리아는 마녀로 몰리면서 죽을 위기에 처한다.<br/>
            그때 할머니가 알려준 ‘아바’를 떠올리며<br/>
            최후와 최선의 선택인 그곳으로 가기 위해 스스로 잠이 들게 되는데...<br/><br/>
            검푸른 어둠이 펼쳐진 밤이었다. 달빛도 어두웠다. 사방은 고요했고 사박사박- 산길을 걸어 올라가는 발걸음만 울릴 뿐이었다.<br/>
            나는 한참 산을 오르다 뒤돌아 마을을 내려다 봤다. 일말의 그리움 때문이었을까. 그토록 미워한 그들이 있는 곳을 눈으로 훑다 다시 발걸음을 재촉했다. 가볍게 불어오는 가을바람에 붉은 머리카락이 휘날렸다.<br/>
            오늘 밤, 이 마을을 벗어나지 못하면 죽은 목숨이다. 그 생각에 아랫입술에 절로 힘이 들어갔다. 산 길목에 비석이 보였다.<br/>
            ‘세레나 마을’<br/>
            어린 시절의 추억이 고스란히 담긴 곳이었다. 이곳에서 할머니와 엄마, 그리고 어린 나는 터전을 잡았고 삶을 일궈나갔다. 할머니와 엄마는 지혜로운 분이셨다. 그들에게 요리와 약초학을 배우고 사람들을 사랑하는 법을 배웠다. 비록 지금은 내 곁에 없지만...<br/>
            사랑하는 이들을 추모하며 산마루에 올랐을 때였다. 이제 이 산만 넘어가면 마을을 완전히 벗어나게 되는 거였다. 그때, 우거진 수풀 사이에서 까만 그림자가 하나 둘 올라 왔다.<br/>
            예상치 못한 상황에 두려웠지만 반대 방향으로 도망가기 위해 재빨리 몸을 틀었다. 하지만 이미 늦었다. 그들은 나를 기다리고 있었던 거다.<br/>
            “내일 아침에 도착한다는 소문에 속아 넘어갔군”<br/>
            등 뒤에서 울려 퍼지는 낮은 목소리에 뒷목에 소름이 돋았다.<br/>
            누군가가 횃불을 키자 목소리의 주인이 선명하게 보였다. 두꺼운 로브를 써 얼굴이 잘 보이진 않았지만 목소리만으로도 그가 수도에서 파견된 마녀 재판관임을 알 수 있었다. 가슴팍에 달린 금색 인장이 형형하게 빛나며 그것을 증명했다.<br/>
            안 돼. 여기서 이렇게 무참히 끝낼 수 없다.<br/>
            난 병사의 틈으로 도망가려 했지만 역부족이었다. 갓 성인이 된 여자 한명이 그들을 어찌 이기겠는가. 난 바로 그들에게 붙잡히고 말았다.<br/>
            “네 죄는 네가 잘 알고 있겠지. 마녀”<br/>
            로브 아래로 마녀 재판관의 소름끼치는 안광이 번뜩였다. 그 속엔 혐오와 경멸이 담겨있었다.<br/>
            “아니에요... 정말 전 아닙니다.”<br/>
            쿵쾅이는 심장을 진정시키며 말을 내뱉었다. 하지만 떨리는 목소리는 어찌 할 수 없었다.<br/>
            “마을 사람 수백을 죽이고도 뻔뻔하게 그런 말을 하다니. 내가 온다는 소문에 급히 떠나는 게 네 말의 반증이 아니겠느냐”<br/>
            ***<br/>
            <br/>
            3 개월 전이었다. 여름을 맞아 휴가를 다녀온 한 영애가 미쳐버렸다는 소문이 돌았다.<br/>
            영애가 휴양지에서 이상한 음식을 먹고 정신을 놓은 것이다, 해변에 사는 서민이랑 사랑에 빠져 앓는 것이다, 사람들의 입을 타고 왜곡된 소문은 삽시간에 퍼져나갔다.<br/>
            하지만 영애의 상태는 소문과는 달랐다. 온 몸에 검은 반점이 퍼져있었고, 고열에 숨도 편히 쉬지 못하는 상황이었다.<br/>
            내가 이렇게 자세히 알 수 있었던 건 할머니 때문이었다.<br/>
            의원들의 치료로 병세가 호전되지 않자 귀족가에서 약초 학에 밝은 할머니를 불렀다. 마을 사람들 사이에서 할머니에 대한 소문을 들은 듯 했다.<br/>
            치료를 위해 귀족가에 다녀온 할머니는 몸서리를 치며 몸을 깨끗이 씻었다.<br/>
            그리고 허망한 표정으로 나와 엄마에게 말했다.<br/>
            ‘어디서 지독한 병을 달고 왔더구나. 곧 마을이 난리가 날 테니 식량을 사들이고 최대한 나가지 말거라.’<br/>
            우리는 겨울을 준비하는 다람쥐처럼 음식을 사 모았다. 그 사이에 영애는 결국 죽었고, 귀족가와 그들의 고용인들은 줄줄이 같은 병에 앓게 되었다. 이름 모를 병은 마을에 점차 퍼지기 시작했다.<br/>
            그 시기 즈음, 지나가던 순례자가 우리 마을에서 며칠을 묵게 되었다. 사람들은 신의 뜻으로 병을 치료할 수 있을 거라 믿으며, 이방인인 그에게 아픈 가족들을 보여줬다.<br/>
            검게 변해가는 사람들을 본 그는 질겁해 마을을 떠나며 말했다.<br/>
            <br/>
            ‘이건 마녀의 소행이오. 이미 신의 뜻을 타락시킨 마녀가 이 마을에 숨어들었으니 그들을 처단하시오!’<br/>
            그 말이 불씨였다. 순박한 시골 사람들은 가족들을 뺏어간 사악한 마녀 찾기에 혈안이 되었다. 조금이라도 수상쩍은 모습을 한다 치면 마녀가 아니냐고 의심했다. 사람들은 가시가 돋쳐있었다. 그 사이에서도 사람들은 점점 죽어나갔다.<br/>
            한날, 마을 광장에 위치한 빵집 아저씨가 아픈 아이의 손을 잡고 있었다. 아이의 숨소리는 점점 옅어지다가 이내 멎었다. 그는 울음을 토해내며 마녀를 저주했다.<br/>
            그 분노 속에서 그가 떠올린 건 숲속에 살고 있는 우리 모녀였을 테다. 흔치않은 붉은 머리, 남편을 일찍 잃은 3 대의 여자들, 그리고 얼마 전 빵을 한가득 사서 모습을 비추지 않는 것까지... 그날부터였다. 우리 가족은 마을에 역병을 몰고 온 마녀가 되었다. 할머니와 엄마가 역병에 목숨을 잃게 되자 모든 화살은 내게로 돌아왔다.<br/>
            마을 사람들은 내게 돌을 던졌고, 음식을 팔지 않았다. 온갖 저주의 말을 내뱉으며 집을 불태우려 했다. 그 순간 날 붙잡았던 건 엄마의 유언이었다.<br/>
            ‘리아, 내 딸아. 넌 꼭 살아남아야 한다. 꼭 살아야만 해.’<br/>
            그리고 어제였다. 식량이 다 떨어져 로브를 뒤집어쓰고 간 광장에서 그 소문이 들렸던 것이다.<br/>
            ‘내일 아침이면 수도에서 마녀재판관이 온다는군. 정말 다행이야.’<br/>
            ‘이제 이 지옥 같은 저주도 풀리겠지?’<br/>
            황급히 집으로 돌아온 나는 짐을 싸기 시작했다. 재판이란 게 아무 의미 없다는 걸 알고 있었기 때문이다. 이건 재판이 아니다, 사냥이다.<br/>
            <br/>
            재판에서 내가 마녀가 아님을 증명하더라도 혹독한 고문에 죽을 게 뻔했다. 죄를 뒤집어 쓴 누군가를 처단한기 위한 구실에 불과했다.<br/>
            어둠이 내리기를 기다린 나는, 지체 없이 집을 떠났다.<br/>
            ***<br/>
            “집행을 시작해라. 재판은 필요 없다. 이미 모든 게 증명 됐으니.”<br/>
            난 마을 광장에 세워진 나무 기둥에 묶였다. 이 시간만을 기다리던 마을 사람들은 광장에 모여들어 내게 돌팔매질을 했다. 그들에게서 느껴지는 광기에 몸서리쳐졌다.<br/>
            난 울지도, 애원하지도 않았다. 여기까지 온 이상 죽음을 기다리는 것 외에 아무것도 할 수 있는 게 없었다.<br/>
            발아래의 장작에 불이 피어올랐다. 나는 빨리 이 숨통이 끊어지기만을 빌고 있었다. 뜨거운 열기가 느껴지기 시작할 때 어째서 일까, 어릴 적 할머니가 들려주신 이야기가 떠오른 건.<br/>
            ‘리아야. 이 세상은 네가 아는 것 보다 더 크단다. 육신으로는 가지 못하지만 간절함의 정신으로 도달할 수 있는 세계도 있어. 우리 선조들은 그곳엔 이름을 붙이지 않았단다. 한낱 인간이 이름붙일 수 없는 곳이기 때문이었어.’<br/>
            ‘간절함으로 갈 수 있는 정신의 세계’<br/>
            장작에 불길이 점점 치솟기 시작했다. 나는 밤하늘의 빛나는 별들을 바라보며 빌었다.<br/>
            <br/>
            ‘그곳... 날 그곳으로 데려다줘.’<br/>
            시야가 흐려진다. 고통도 슬픔도 점점 무뎌져갔다. 난 화마 속에서 평온한 표정으로 잠들었다. 불기둥이 타오르는 광장에서는 축제 분위기가 무르익었다.<br/>
                <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal8",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title8.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title8_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
