<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v7">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    네버랜드에 사는 영원히 늙지 않는 소년 '플라이'
                </p>
                <p class="main-character-text2">
                    “나이가 들어도 영원히 소년으로 남고싶다!”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">15세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">170cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#개구쟁이 #어린이들의영원한친구</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">산책</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">반려동물'팬'을 이용한 자유비행</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 플라이 이야기</h3>
            찌들다 못해 불면증에 시달리는 직장인의 일상에 들이닥친 임상실험이라는 선물.<br/>
            누구나 한번 쯤 상상해 볼 순 있지만 감히 도전하지 못했던 것을 통해 새로운 세상을 보게 된다면..? 어처구니없는 도전일지, 새로운 출발일지는 그의 손에 달렸다.<br/>
            <br/>
            <br/>  
            여느 날과도 같은 퇴근길이었다. 만석의 지하철, 사람들 속에 비집고 선 채 빨리 이 시간이 지나 가기만을 빌었다. 후덥지근한 선내의 공기마저 역했다.<br/>
            “야 저것 좀 봐.”<br/>
            “몇 년 전에 유행하던 거 아냐? 그때 유사과학이라면서 욕 엄청 먹었잖아. 그걸 아직도 하나?”<br/>
            내 옆으로 선 두 남자의 대화소리에 그들이 보고 있는 포스터로 자연스레 눈길이 갔다. 진한 보라색의 포스터가 지하철 내부의 광고 칸에 붙어 있었다.<br/>
            최면심리 임상 실험<br/>
            기억을 들여다볼 참가자를 모집합니다. -뉴드림 연구소-<br/>
            ‘아직도 최면 타령이라니’<br/>
            몇 년 전, 최면 열풍이 한창 불었을 때가 있었다. 어디서 얕게 최면 공부를 하고 온 사람들이 최면상담소를 마구잡이로 차렸다. 어느 유행과 마찬가지로 인기는 금세 식었고, 이젠 타로 같은 심심풀이 미신으로 전락했다. 나는 그들과 함께 알량한 광고지를 한번 비웃고는 핸드폰으로 포스터 사진을 찍었다. 단톡방에 대화거리로 올릴 심산이었다.<br/>
            <br/>
            집에 돌아와 간단히 샤워를 마치고 침대에 누울 때 까지도 단톡방은 조용했다. 채팅 옆의 숫자는 계속 줄었지만 누구 하나 답이 없었다. 이젠 서운하지도 않았다. 몇 안 남은 대학 친구들과의 연락도 뜸해진지 오래였다. 간간히 안부를 묻곤 했지만 각자 바쁜 사정 때문인지 쉽게 연락이 되지 않았다.<br/>
            ‘모르겠다.’<br/>
            핸드폰을 침대 귀퉁이에 던져놓고 이불을 덮었다. 5 평 안 되는 자취방의 고요함에 외로움이 치밀어 올랐다. 어른이 되는 건 이런 걸까. 매일 똑같은 하루를 살고, 짧은 주말을 무기력하게 침대에서 보내고, 평일이 되면 지친 일과를 처리하는 그런 게 내가 원하던 삶이었나. 회의적인 상념이 머릿속을 채웠다. 잠자리를 잡으며 마을을 뛰어다니던 어린 시절이 그리웠고, 어머니가 싸주시던 소풍 도시락이 그리웠다.<br/>
            얼른 잠들기 위해 이불을 뒤집어썼지만 10 분 채 되지 않아 짜증스러운 한숨과 함께 일어날 수 밖에 없었다.<br/>
            ‘후, 이놈의 불면증은’<br/>
            회사 디자인팀 기획을 맡게 되면서부터 시작된 불면증이었다. 과도한 업무와 스트레스가 원인일 테지만 원인을 제거할 수 없으니 약에 의존하게 됐다.<br/>
            ‘의사들은 스트레스를 줄이면 된다는데 그게 되냐고’<br/>
            나는 서랍 위의 작은 약통에서 약을 꺼내 꿀꺽 삼켰다.<br/>
            내일이 오지 않았으면 좋겠다. 운석이 우리 집 위로 떨어져 버렸으면.<br/>
            약기운이 스멀스멀 뇌를 잠식하는 게 느껴졌다. 눈꺼풀이 무거워지며 이윽고 잠에 빠졌다.<br/>
            <br/>
            다음날 점심시간, 기획서 수정으로 기진맥진 해져 의자에 앉았다. 허기가 올라왔지만 메뉴를 고르고 식당을 찾는 것에 기력을 쓰고 싶지 않았다.<br/>
            결국 내린 선택은 편의점 샌드위치였다. 근처 공원에 앉아 기계적으로 음식을 씹다가 어제 봤던 포스터가 문득 떠올랐다.<br/>
            분명...<br/>
            내 기억이 맞았다. 임상실험자를 찾던 연구소가 회사 근처였다. 보도로 10 분 거리. 잠깐 다녀올 시간은 있었다. 물론 실험에 참가할 생각은 아니었다. 단순한 호기심 정도였다.<br/>
            날씨가 너무 좋았기에, 그리고 오후에 쳐내야 할 업무가 지긋지긋 했기에 내린 충동적인 결정이었다.<br/>
            뉴드림 연구소<br/>
            진한 보라색으로 제작된 회사 간판이 보였다. 나는 건물 앞을 지나가며 외관을 훑었다. 낡은 창고나 으스스한 건물을 생각했는데 외관은 꽤나 멀끔했다. 하얀 페인트가 칠해진 건물은 연구소라기에 퍽 어울렸다.<br/>
            샌드위치와 함께 산 캔 커피를 홀짝이며 막 걸음을 돌리려 할 때였다.<br/>
            “한번 둘러보셔도 됩니다.”<br/>
            등 뒤에서 들려오는 나직한 목소리에 놀라 몸을 틀었다. 흰 가운에 철태 안경을 쓴 남자가 날 보고 서있었다.<br/>
            “아, 아뇨 그냥 지나가는 길이었어요.”<br/>
            갑작스러운 남자의 등장에 당황함을 숨기지 못하고 답했다.<br/>
            “오랫동안 심리학 연구를 하다보면 눈동자 속에 담긴 말을 읽게 될 때도 있더군요.<br/>
            <br/>
            당신이 생각하는 것처럼 이상한 곳은 아니랍니다.”<br/>
            남자에게 속내가 읽힌 것 같아 민망한 마음에 그의 말을 더 거절할 수 없었다.<br/>
            그를 따라 들어간 건물 내부는 넓진 않았지만 잘 꾸며져 있었다. 디자이너의 직업병처럼 공간 이곳저곳을 훑었다. 연구 성과를 보여주는 상패들이 벽 선반에 나란히 놓여있었고, 테이블 위에 놓인 홀로그램 느낌의 오브제가 미래도시 같은 느낌을 주었다.<br/>
            디자인에 신경을 썼네.<br/>
            이렇게 생각하고 있을 때 남자가 싱긋 웃으며 말했다.<br/>
            “아름답죠? 꽤나 신경 썼답니다.”<br/>
            내 생각을 꿰뚫는 그의 말에 머쓱해졌다.<br/>
            “임상실험 참가자를 구한다는 포스터를 보신 거겠죠?” “어...네 그런데 참가하려는 건 아니고 그냥...” “이해합니다. 최면은 한물간 유사과학이라고 생각하지겠죠”<br/>
            솔직한 남자의 말에 나는 적잖이 당혹스러웠다.<br/>
            “저는 오랫동안 뇌과학과 최면에 대해 연구했습니다. 최면에 대한 인식이 안 좋아 진건 아쉽긴 하지만 어쩔 수 없죠. 그만큼 연구 성과가 부족한건 사실이니까요.”<br/>
            남자는 계속해서 말을 이었다.<br/>
            “현대인들은 충분한 영양공급, 발전한 의료기술로 신체적으로는 건강해 졌을지 모르지만 정신은 점점 더 피폐해지고 있습니다. 최근 몇 년간 우울증과 불면증에 시달리는 사람들이 대폭 증가했죠.”<br/>
            <br/>
            나는 그의 말에 고개를 끄덕일 수밖에 없었다.<br/>
            연구소장이라는 그의 이야기가 계속해서 이어졌고 나는 홀린 듯 고개를 연식 끄덕였다.<br/>
            30 분이나 지났을까. 그곳을 나와 회사로 돌아가는 내 손엔 자그마한 약봉지가 쥐어져 있었다.<br/>
            ‘이번에 개발 중인 신약입니다. 실은 수면제와 그렇게 큰 차이는 없습니다만 수면 중 뇌의 일부분을 깨워 과거의 기억을 깨워주는 거죠. 꿈 유도제라고나 할까요. 부작용은 딱히 없으니 안심하셔도 됩니다. 매일 밤 한 알씩.3일을 드시고 다시 방문해 주세요.’<br/>
            정말 뭐에 홀리기라도 한 걸까. 평소에 의심이 많던 내가 이런 것까지 받아오다니. 주머니에 약을 쑤셔 넣고 빠른 걸음으로 회사로 들어갔다.<br/>
            ***<br/>
            어제와 똑같은 하루였다. 단 하나 다른 게 있다면...<br/>
            이 약이겠지.<br/>
            난 손바닥 위의 하얀 알약을 노려봤다. 어쩌다보니 받아오긴 했는데 막상 먹으려니 찝찝했다. 내가 미쳤었지.<br/>
            난 하얀 알약을 탁자 위에 조심히 내려놓고 수면제가 담긴 약통을 열었다. 하지만 통 속은 비어있었다. 그제 서야 어제 먹은 게 마지막 알이었음이 떠올랐다.<br/>
            체념하곤 침대에 몸을 뉘였지만 뇌는 잠들 생각이 없어보였다. 오늘 회사에서 들은 팀장의 잔소리와 어릴 적의 향수가 뒤엉켜 머릿속을 헤집었다.<br/>
            <br/>
            그래 될 되로 되라지.<br/>
            나는 짜증스럽게 오늘 받아 온 알약을 삼켰다. 그 순간만큼은 약 부작용으로 설령 내가 죽는데도 좋았다.<br/>
            후우- 깊게 호흡을 내쉬고 나는 다시 이불 속을 파고들었다. 온몸이 뭉근해지기 시작하고 오늘 들었던 남자의 목소리가 귓가에 맴돌았다.<br/>
            ‘꿈은 간절함의 실현이라고 하죠. 좋은 꿈꾸세요.’<br/>
            ***<br/>
            혀 아래에서부터 뜨거운 열기가 느껴졌다.<br/>
            “선재야, 선재야 괜찮아?”<br/>
            옆에서 내 머리를 쓰다듬으며 다정하게 날 부르는 목소리에 눈을 떴다. 하지만 시야는 희뿌옇게 안개가 진 것처럼 보였다. 몇 번 더 눈을 깜박이니 날 내려다보고 있는 사람의 실루엣이 흐릿하게 보이기 시작했다.<br/>
            “우리 선재 어떡하면 좋아”<br/>
            엄마.<br/>
            목소리의 주인공은 엄마였다. 그녀가 사라지기 전에 팔을 뻗어 끌어안고 싶었지만 몸은 마음대로 되지 않았다. 엄마가 떠난 지 일 년 채 되지 않았었다. 꾹꾹 눌러왔던 그리움이 엄마의 목소리에<br/>
            <br/>
            터져 올라왔다. 엄마. 목소리를 내 부르고 싶었지만 온 몸을 휘감는 열기에 목소리조차 낼 수 없었다.<br/>



            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal7",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title7.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title7_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
