<template>
  <div class="content-modal" :class="{ on: showContentsModal === true }">
    <div class="content-character-box v2">
      <div class="main-character">
        <h3 class="main-character-title">
          <img :src="titleUrl"/>
        </h3>
        <p class="main-character-text">
          선과 악을 넘나드는 두 얼굴의 사나이!<br />
          노래하는 기부천사 '음악깡패'
        </p>
        <p class="main-character-text2">
          “음악을 통해 소외된 사람들에게<br />
          위로와 기부를 선사하고 싶다!”
        </p>
        <ul class="main-character-info">
          <li>
            <div class="title">나이</div>
            <div class="text">23세</div>
          </li>
          <li>
            <div class="title">키</div>
            <div class="text">180cm</div>
          </li>
          <li>
            <div class="title">성격</div>
            <div class="text">#무뚝뚝 #몸집과다른천상여리여리</div>
          </li>
          <li>
            <div class="title">취미</div>
            <div class="text">메이크업, 쇼핑</div>
          </li>
          <li>
            <div class="title">스킬</div>
            <div class="text">선글라스를 벗으면 초사이언 변신</div>
          </li>
        </ul>
        <button type="button" class="btn-related" @click="showRelated = true">
          관련작품 보기
        </button>
      </div>
    </div>
    <div class="related-layer" :class="{ on: showRelated === true }">
      <h3 class="title">음악깡패 이야기</h3>

      내가 만든 나만의 공간, 그 곳에서 나는 덩치도 크고 아주 사나운 놈으로
      만들어 내안에 그 놈을 마구잡이로 펼쳐 놓았다.<br />
      세상에 유일한 단 한명의 친구, 1평 남짓한 공간의 코인노래방. 나의 작음
      몸집에 딱 맞춘 듯 편안한 곳이다.<br />
      그 곳에선 소심한 성격도, 친구가 없는 것도, 괴롭힘을 당하는 것도 다 잊고
      조금씩 스스로 성장하는 것 같다.<br />
      <br /><br /><br /><br />
      눈부신 조명 아래, 노래의 마지막 소절을 내질렀다. 목덜미를 타고 흐르는
      땀줄기가 달아오른 몸을 식혀줬다. 큰 키에 탄탄한 몸, 조금은 촌스럽지만 잘
      맞는 화려한 정장과 트레이드마크 인 까만 썬글라스, 그리고 누구도 탐할 수
      없는 가창력, 이 모든 것에 관객들은 열광한다. 환 호소리가 넓은 무대를
      채웠다. 그들을 보며 미소를 지을 때, 시야가 점점 흐려지기 시작했다. 안 돼,
      여기서 끝나면 안 돼.<br />
      뭐라도 잡기 위해 손을 휘저었지만 역부족이었다. 까만 암전 속에 머무르던
      나는 알람 소리에 눈을 떴다.<br />
      지겹게 익숙한 천장이었다. 알람을 끌 생각도 않고 멍하게 누워 달콤했던 꿈을
      여러 번 복기 했다. 현실을 마주하고 싶지 않았기 때문일 테다. 다섯 번째
      알람이 울리기 시작해서야 나는 미적거리며 화장실로 향했다.<br />
      세면대 거울에 비친 내 몸은 볼품없었다. 큰 키도, 근육질의 몸도
      온데간데없었다. 고등학교 2 학년이 되었지만 아직도 160언저리를 웃도는 작은
      키, 살도 근육도 없는 왜소한 몸을 보고 있 자니 한숨이 푹 나왔다. 나는
      팔뚝과 등 곳곳에 든 퍼런 멍을 내려 보다 물도 없는 욕조에 들 어가 앉았다.
      더 늦장을 부리다간 지각을 면하지 못할 테지만 상관없었다.<br />
      “학교 가기 싫다.”<br />
      무릎에 고개를 묻고선 그 누구에게도 들리지 않게 작게 읊조렸다.<br />
      “이야 김도해 일진이네 지각도 하고.”<br />
      조용히 가방을 풀던 내 의자를 발로 차며 경태가 말했다. 평소라면 경태의
      눈치를 살피며 바 로 사과를 했겠지만, 넓은 무대를 뛰어다니는 그 꿈을 꾼
      날은 이상하게 객기가 생기곤 했다. 그리고 내 객기의 최선은 침묵이었다. 나는
      아무런 대꾸도 없이 책상에 엎드렸다. 곧 경태의 손이 날아들어 내 뒤통수를
      내리쳤다.<br />
      “이 새끼 뭐냐? 내가 만만한가봐? 끝나고 보자.”<br />
      후회는 없었다. 그래 또 몇 대 맞고 말지, 그 생각이 전부였다<br />
      천천히 흘러가는 초여름의 하늘을 바라보며 난 쓰레기장 귀퉁이에 앉아있었다.
      분리수거 통에 서 쾌쾌 묵은 쓰레기 냄새가 올라왔지만, 난 개의치 않고 하늘만
      바라봤다. 울기엔 너무 화창 한 날씨였다.<br />
      나는 흩어진 책을 가방에 넣다 얼굴을 찡그렸다. 아까 경태의 주먹에 터진
      입술이 아려왔기<br />
      때문이다.<br />
      왜 고통에는 익숙해지지 않는 걸까.<br />
      한쪽어깨로 가방을 매고 털레털레 쓰레기장을 벗어났다.<br />
      모든 것의 시작은 고등학교 1학년, 입학한지 얼마 되지 않는 시기였다. 특별한
      사건도 없었 고, 마땅한 이유도 없었다. 굳이 이유를 찾자면 내 키가 작았고,
      왜소했으며 만만해 보였다는 거겠지<br />
      “야 이리 와봐.”<br />
      경태의 이 말 한마디가 괴롭힘의 시작을 울리는 경종이었다.<br />
      내가 향한 곳은 집이 아닌 동네 코인노래방이었다.<br />
      1평도 안 되는 작은 부스에 들어오자마자 나는 안도의 한숨을 내쉬었다. 이
      작은 직육면체의 공간은 내가 숨 쉴 수 있는 세상의 전부였다. 이곳이 있었기에
      난 지옥 같은 학교생활을 버틸 수 있었다. 난 학교에서의 고통은 가벼이 잊고
      노래방 리모컨을 조작했다.<br />
      “역시 시작은 국카스텐이지”<br />
      목청이 떠나가라 노래를 부르고 있을 때였다. 온전한 내 세계의 문이 벌컥
      열렸다. 설마 경태 패거리가 여기까지 찾아온 걸까. 난 본능적으로 고개를 푹
      숙였다. 하지만 한참이 지나도 욕 설이나 주먹은 날아오지 않았다. 난 천천히
      고개를 들었다.<br />
      큰 키에 사나운 인상, 곱슬머리가 눈을 다 가린, 불량배 같은 남자가
      당혹스러운 표정으로 나 를 내려다보고 있었다.<br />
      ‘요즘 이런 식으로 돈 뺏어가는 일이 많다던데...’<br />
      나는 남자의 시선에 들이마신 숨을 차마 뱉어내지 못하고 있었다. 하지만
      예상과는 다르게 고 개를 몇 번 갸웃거린 그는 내게 사과를 건넸다.<br />
      “죄송합니다. 제가 사람을 착각했나 봐요. 제가 음깡이라는 유튜버를
      좋아하는데 그분이랑 목 소리가 똑같아서 그만... 들떠서 문을 열었네요.”<br />
      몇 차례 더 사과를 건넨 그가 부스를 떠났다.<br />
      그가 시야에서 완전히 사라지고 10초가 더 지나서야 나는 빳빳하게 올라간
      어깨에 힘을 풀 수 있었다.<br />
      적잖이 놀랐다. 그가 날 해하지 않고 떠난 건 둘째였다. 그의 입에서 나온
      ‘음깡’이란 이름 때 문이었다.<br />
      ‘음깡’...음악깡패의 줄임말. 그건 내 유튜버 계정의 이름이었다. 몇 개월 전
      내 모습이 너무나 한심해 보여 미치겠을 때, 뭐라도 인정받고 싶은 마음에 내
      기준에 가장 사나운 이름을 붙여 노래방에서 부른 녹음파일 몇 개를 업로드 한
      게 전부였다.<br />
      얼굴도 드러내지 않았고, 조회수도 그리 높지 않았던 터라 그가 날 알아보는 게
      놀라웠다. 나조차도 잊고 지내던 계정을 그가 기억한다니 내심 기쁘기도 했지만
      그의 불량스러운 외모 때문인지 왠지 모를 거부감이 더 강했다.<br />
      <br />
      더 이상 마주칠 일도 없을 텐데 뭐. 그 남자와의 만남은 그새 잊혀졌다.<br />
      며칠 뒤, 등굣길이었다. 아무도 내 볼품없는 모습을 보지 않았으면 하는 생각에
      몸을 잔뜩 말 고 바닥만 보며 걸었다. 언제부터였을까, 길을 걸으면 모두가 날
      비웃고 있다는 느낌이 들었 다. 애써 불쾌한 감정을 지워내며 빠르게 걸음을
      옮기고 있을 때였다.<br />
      “도해! 김도해 맞지?”<br />
      누군가 날 반갑게 불렀다. 내 이름을 살갑게 부를 사람이 없다는 걸 알기에 난
      돌아보지 않고 계속 걸었다. 그때 커다란 손이 내 어깨를 붙잡았다. 난
      순간적으로 두려움이 일어 손을 뿌리 치며 뒤로 물러났다. 손의 주인은 며칠 전
      봤던 그 남자였다.<br />
      놀랍게도 그는 우리학교 교복을 입고 있었다. 단추를 잠그지 않은 하늘색
      와이셔츠, 양쪽 귀 의 까만 피어싱과 두발 규정에 어긋나는 곱슬머리를 보며
      나는 안색이 하얗게 질려갔다. 경태 와 비슷한 유의 인간이라는 게
      확실해졌으니.<br />
      그는 내 안색 따위는 신경 쓰지 않은 채 숨을 고르며 말했다.<br />
      “저 멀리서 보고 달려왔어. 그때 통성명을 못했네. 난 이 현, 외자야.”
      “어...”<br />
      “어제 명찰보고 한국 고 2학년인거 알았어. 나도 2학년이 거든” “으응...”<br />
      나는 그가 어서 자리를 뜨기만을 기다렸다. 길 건너편에서 그와 함께 오던
      무리가 그와 나를 호기심 가득한 눈으로 지켜보는 게 느껴졌기 때문이다.<br />
      “물어볼 것도 있고 한데, 같이 갈까?”<br />
      최악의 상황이었다. 경태 패거리에게 시달리는 걸로도 충분했다. 하지만
      위압감이 느껴지는 그의 덩치에 나는 거절도 못한 채 그의 뒤를 따랐다. 한발
      한발, 그의 뒤를 따르는 내 머리위 에 먹구름이 끼는 기분이었다.<br />
      “국카스텐 좋아하나봐?”<br />
      한 발짝 앞서가던 이현이 내게 물었다.<br />
      “응”<br />
      “노래 배운 적 있어? 성량이 좋던데” “아니...”<br />
      이현의 질문공세는 계속해서 이어졌다. 대부분 노래에 관한 이야기였다. 내가
      유튜버 음깡인 걸 밝힐까 잠깐 고민했지만 괜한 관심을 끌게 될까봐 말았다.<br />
      <br />
      잠깐의 호기심인줄 알았던 그의 관심은 지속됐다. 등하교를 함께하기도 했고,
      점심식사를 같 이 하기도 했다. 가끔씩은 학교가 끝나고 노래방을 갈 때도
      있었다. 불량스러운 외모 때문에 그가 처음엔 꺼려졌는데 그런 생각을 금세
      사라졌다. 희한하게도 이현과 함께 다니기 시작한 이후로부터 경태의 괴롭힘이
      없다 시피 했다. 우연은 아닌 것 같았다.<br />
      하지만 이현에게 경태와의 사이를 묻진 않았다. 우리 사이엔 분명히 선이
      있었고 난 그 선을 매우 잘 지키는 사람이었으니까. 그 또한 나서서 자기
      이야기를 늘어놓는 사람은 아니었다. 이현은 노래를 하고 싶어 했고, 내가
      노래를 잘 했기 때문에 나에게 다가온 것뿐이었다.<br />
      한여름의 끝자락 같은 어는 날이었다. 이현과 나는 노래방에서 노래를 실컷
      부르고 나오는 중 이었다. 저녁 7시 정도 됐지만 아직 해는 지지 않았었다.
      나는 바로 떠나려는 이현을 붙잡았 다. 꽤나 용기를 낸 행동이었다.<br />
      “날도 좋은데 산책이나 좀 하다 갈래.” “어쩐 일이래 맨날 단답만 하던
      놈이”<br />
      이현은 피식 웃으며 날 따라 걸었다. 지금 생각하면 꿈, 그놈의 꿈 때문인
      듯하다. 그날도 같 은 꿈을 꿨었고 아침부터 들뜬 기분이었다.<br />
      동네 천변 옆의 산책로에서 나는 그에게 물었다. 충동적인 질문이었다.<br />
      “너 아직도 음깡 그 유튜버 봐?”<br />
      “아 그 사람, 요즘은 안 봐. 업로드를 하도 안 해서.”<br />
      이현의 말에 나는 침묵했다. 노을이 지고 있었고, 얼마 전 장마로 불어난
      하천의 물은 주홍빛 으로 일렁였다. 이현은 내게 왜 그런 질문을 했냐고 되묻지
      않았다. 그렇게 한참을 걷다가 난 입을 땠다.<br />
      “그거 나야. 음깡”<br />
      그의 반응이 너무나 알고 싶기도 했지만 한편으로 모르고 싶었다. 난 고개를 푹
      숙이고 블록 의 금을 피해 걸으며 이현의 대답을 기다렸다.<br />

      <button type="button" class="modal-close" @click="showRelated = false">
        <span class="blind">닫기</span>
      </button>
    </div>
    <button
      type="button"
      class="modal-close"
      @click="$emit('update:visible', !showContentsModal)"
    >
      <span class="blind">닫기</span>
    </button>
  </div>
</template>

<script>
import { reactive, toRefs } from "vue";

export default {
  name: "CharacterModal2",
  emits: ["update:visible"],
  props: {
    showContentsModal: {
      type: Boolean,
      default: false,
    },
    title: {
      type: String,
      default: "",
    },
  },
  data() {
    return {
      showRelated: false,
    };
  },
  setup() {
    const state = reactive({
      titleUrl: require("@/assets/image/region1/bg_char_title2_v2.png"),
    });
    return {
      ...toRefs(state),
    };
  },
};
</script>

<style scoped></style>
