<template>
  <div class="content-modal" :class="{ on: showContentsModal === true }">
    <div class="content-character-box">
      <div class="main-character">
        <h3 class="main-character-title">
            <img :src="titleUrl">
        </h3>
        <p class="main-character-text">
            러블리한 외모에 그렇지 못한 털털함과<br>
            화끈한 성격을 가진 불량소녀,
        </p>
        <p class="main-character-text2">
            “총알은 안나가<br>
            더 쎈 게 나가지”
        </p>
        <ul class="main-character-info">
          <li>
            <div class="title">나이</div>
            <div class="text">20세</div>
          </li>
          <li>
            <div class="title">키</div>
            <div class="text">165cm</div>
          </li>
          <li>
            <div class="title">성격</div>
            <div class="text">#자유분방 #도전적 #흥부자 #엉뚱함</div>
          </li>
          <li>
            <div class="title">취미</div>
            <div class="text">메이크업, 쇼핑</div>
          </li>
          <li>
            <div class="title">스킬</div>
            <div class="text">물감총을 활용한 컬러풀한 그래피티</div>
          </li>
        </ul>
        <button type="button" class="btn-related" @click="showRelated = true">
          관련작품 보기
        </button>
      </div>
    </div>
    <div class="related-layer" :class="{ on: showRelated === true }">
        <h3 class="title">동보희 이야기</h3>

        새벽 3시 21분. 유라는 알람소리를 듣고 눈을 비비며 일어났다. 10시 20분 뉴욕 행 비행기에 오르기 위해서는 적어도 2시가 30분 전에 공항에 도착해야하니 어물쩍거릴 시간이 없었다. 유라는 여름 장마가 막 시작 돼 욱신거리는 관절을 풀며 화장실로 발걸음을 옮겼다.<br>
        샤워 25분, 화장 31분, 기계적인 움직임으로 이들을 해치운 유라는 비장한 표정으로 거울 앞 에 섰다.<br>
        이제부터가 고비다.<br>
        스튜어디스인 유라는 3년이나 올림머리를 했음에도 매일 아침 애를 먹었다. 매일 해도 익숙해 지지 않는 작업이었다.<br>
        유라는 아직 축축한 머리를 수건으로 가볍게 털고 드라이를 시작했다.<br>
        ‘오른쪽 2분 왼쪽 2분 말리기, 3세트 반복’<br>
        그녀는 매일 똑같은 방식으로 머리를 말렸다. 조금이라도 어겨지면 그날은 왠지 올림머리가 잘 되지 않았다.<br>
        빗질을 시작한 유라는 바닥으로 떨어지는 기다란 머리카락을 보며 미간을 찌푸렸다.<br>
        후우… 나중에 치우면 돼. 후우…<br>
        일찍 나가려고 자잘한 청소는 나중으로 미루려 했건만 유라의 성정에 그것만은 허락되지 않았 다.<br>
        그녀는 심호흡을 한지 1분채 되지 않아 돌돌이를 가져와 머리카락을 치웠다.<br>
        먼지 한 톨 없는 바닥을 보며 뿌듯한 표정을 지은 유라는 머리를 올려 실핀으로 고정하고 헤 어스프레이를 과하게 뿌려 머리를 정리했다.<br>
        업무 도중에 흐트러지면 낭패니까.<br>
        헤어스프레이를 매일 사용하다 보니 두피에 빨갛게 두드러기가 올라오지만 ‘회사방침’ 이란 한 마디 단어로 유라에겐 거를 수 없는 법이 되었다.<br>
        유라가 가장 중요시 여기는 말이기 때문이다. 방침, 규율, 법<br>
        방침이라니 몸이 상하는 것쯤이야. 직업정신을 가지고 감수해야지.<br>
        유라는 따끔거리는 두피를 애써 무시하며 생각했다.<br>
        <br/><br/>
        무려 27분을 소요한 올림머리는 유라의 마음에 썩 들지 않았다.<br/>
        유라는 핸드폰으로 시간을 확인했다. 다 풀고 다시 시작하기엔 너무 늦은 시간이다.<br/>
        유라는 애써 튀어나온 옆머리를 무시하며 유니폼을 찾았다. 어째서인지 어제 빳빳하게 다려둔 유니폼이 보이지 않는다.<br/>
        분명 옷걸이에 걸어 놨는데…<br/>
        유라는 옷장을 이리저리 뒤적이다 옷걸이에서 흘러내려 바닥에 처박힌 유니폼을 찾았다.<br/>
        깊은 한숨을 푹 내쉰 유라는 등짝에 굵은 주름이 생겨버린 상의를 탈탈 털어 입었다. 단추를 잠그려는데 느낌이 묘했다. 오늘따라 단추가 유난히 안 잠기는 것 같다.<br/>
        나 살쪘나<br/>
        거울 앞에서 이리 저리 몸을 움직여본다. 평소랑 똑같은 거 같으면서도 괜히 어디 한 구석이 불편한 기분이다.<br/>
        엎친 데 덮친 격으로 오늘 새로 뜯은 살색 스타킹은 신다가 그만 발목 쪽 올이 터졌다.<br/>
        안 좋은 일은 왜 한 번에 일어나는 걸까.<br/>
        유라는 한 달 동안 고대하던 뉴욕 비행이 다 귀찮아 졌다.<br/>
        6시 20분<br/>
        나가야 할 시간이다. 입으로 중얼거리며 짐을 확인한다. ID, 여권, 키, 지갑, 휴대폰, 다 됐지?<br/>
        유라는 가방을 확인하면서 늘 신던 까만 구두를 꺼냈다. 빨갛게 짓물린 발뒤꿈치가 거슬리지만 어쩔 수 없다.<br/>
        가서 선희한테 반창고 하나 빌려야겠네.<br/>
        그녀는 캐리어를 끌고 종종걸음으로 집을 나섰다<br/>
        그리고, 불행은 한 순간 몰려온다는 말을 증명이라도 하듯이 또 다른 고비가 유라의 앞을 막 았다.<br/>
        엘리베이터에서 막 내릴 참에 문 아래쪽 틈에 구두 굽이 끼인 것이다.<br/>
        그 망할 구두와 한참을 씨름하다 구두굽이 결국 부러지며 이 싸움의 승패가 갈렸다.<br/>
        오늘 일진 왜 이러냐고!!!<br/>
        <br/><br/>
        유라는 영화의 한 장면처럼 빗속으로 뛰어들어 한바탕 쏟아 붓고 싶었지만 차마 그럴 수가 없 었다.<br/>
        이 유니폼을 입고 있으니까. 유니폼을 입고는 모든 게 조심스러워야 하니까.<br/>
        그 순간 이 유니폼이 족쇄처럼 느껴졌다.<br/>
        그녀가 그토록 바라고 선망하던 스튜어디스였는데 오늘 따라 마음이 싱숭생숭했다.<br/>
        유라는 공항 근처를 두리번거리며 오며가며 봤던 구두수선가게를 찾았다.<br/>
        7시 2분. 30분 안에 수선하면 지각은 면할 수 있다. 굽이 나간 구두를 신고 부지런히 걸은 유 라는 모퉁이에 붙은 작은 컨테이너 박스를 발견했다. 활짝 열린 문. 안에서 낮은 의자에 앉아 꾸벅꾸벅 졸고 있는 할아버지가 보였다.<br/>
        아 다행이야.<br/>
        이른 시간부터 가게 문을 열어둔 그가 구세주처럼 느껴졌다.<br/>
        “사장님 지금 수선 가능한가요. 좀 급해요”<br/>
        유라는 한쪽 구두를 벗어 대롱거리는 굽을 들이밀며 그를 깨웠다.<br/>
        “아휴. 스튜어디스분이시네 금방 해드릴게요. 출근길이신가 봐요. 일단 급한 대로 수습해 줄게 요. 다음에 와서 제대로 고정해요.”<br/>
        머리가 하얗게 샌 그는 구두를 이리저리 돌려보더니 말했다.<br/>
        “우리 큰딸도 스튜어디스였는데”<br/>
        “정말요? 지금도 일 하시나요?”<br/>
        “아니~ 지금은 따른 일하구. 너무 힘들다고 하더라구.”<br/>
        한 2년 했는데, 어느 날 딸이 그러더라고. 스튜어디스가 멋있어보여서 시작했는데 자기가 원 하는 일은 이게 아니래. 숨이 턱 막혀서 못해먹겠대. 그래서 그냥 관두라고 했어. 지금은 교사 로 일하고 있어. “<br/>
        “그렇군요...”<br/>
        “아가씨는 이 일이 좋아?”<br/>
        유라는 선뜻 대답할 수 없었다.<br/>
        긍정도 부정도 할 수 없었다. 이 일을 좋아하는지 딱히 고민해 본적 도 없었다. 한땐 스튜어 디스를 동경했지만 스튜어디스가 된 지금 그런 마음도 없었다.<br/>
        그때 수선을 끝낸 수선공이 구두를 유라에게 건네며 말했다.<br/>
        “아직 젊으니까. 좋아하는 거 하구 살아. 구두는 다 됐어요. 한동안은 버틸 거야. 그래도 나중 에 다시 와요. 아주 단단하게 고정해 줄게요.”<br/>
        “감사합니다.”<br/>
        결제를 위해 카드를 건네는 유라의 손을 할아버지가 막았다.<br/>
        <br/><br/>
        “아유 됐어, 오늘 비도 오고 날도 안 좋은데 일한다고 고생이여 완벽하게 수선한 것도 아니구,”<br/>
        유라는 평소 같으면 이런 호의를 거절했겠지만 왠지 오늘 만큼은 타인의 정을 있는 그대로 받 고 싶었다.<br/>
        “감사해요. 다음에도 꼭 여기로 올게요.” “그래요. 어서 들어가 오늘 하루 잘 보내고, 오늘은 꼭 좋은 꿈을 꿨으면 좋겠네.”<br/>
        이렇게 이른 아침에 좋은 꿈을 꾸라니<br/>
        아침인사로는 안 어울리는 말이었지만, 어째서인지 그 말이 오늘 하루와 참 잘 어울린다는 생 각이 들었다.<br/>
        싱긋 웃으며 유라는 답했다. “사장님도. 오늘 좋은 꿈꾸세요.”<br/>
        공항으로 가는 길, 유라는 고민에 빠졌다. 아까 수선공에게 들은 말 때문이었다.<br/>
        ‘좋아하는 일이라...어릴 땐 그림 그리는 걸 좋아했었는데.’<br/>
        유라는 중학교 미술 선생님이 떠올랐다. 항상 자신의 그림을 진지하게 봐주는 그녀 덕에 고등 학교 때까지 틈틈이 그림을 그렸었다.<br/>
        ‘돈이 너무 많이 들어서 포기했지만...’<br/>
        유라는 붓을 들고 있을 때만큼은 자유로움을 느꼈다. 어디에도 얽매이지 않고 그녀 자신을 표 현할 수 있은 시간이기도 했다.<br/>
        유라는 물감을 다시 사볼까 고민하며 공항 라운지로 발걸음을 옮겼다 .<br/>
        ***<br/>
        “유라야 고생했어, 벙커 가서 좀 자다와.”<br/>
        뉴욕 행 비행기에서 보딩과 식사 서비스를 마치고 온 유라에게 선희가 말했다. 유라의 컨디션이 좋지 않음을 알아챈 선희가 첫 교대를 양보한 것이었다.<br/>
        “고마워. 선희야”<br/>
        비행기의 맨 끝 칸으로 간 유라는 벙커에 들어가 침대에 털썩 누웠다. 차가운 공기를 피하기 위해 두터운 이불을 머리끝까지 뒤집어썼다.<br/>
        아 머리 망가지면 안 되는데.<br/>
        그런 생각이 들었지만 유라는 쏟아지는 잠을 견딜 수 없었다. 정신이 몽롱해지며 저 깊은 잠 속으로 빨려 들어갔다.<br/>
        <br/><br/>
        그때 유라는 오늘 만난 구두수선공 할아버지의 다정한 목소리가 들리는 듯했다. ‘좋은 꿈 꿨으면 좋겠네.’<br/>
        차갑고 건조했던 공기가 어느 순간 포근하게 변했다. 유라는 밝은 빛 때문에 눈을 떴다. 차차 눈이 빛에 적응하자, 유라는 이곳이 자신이 잠들었던 벙커가 아님을 깨달았다.<br/>
        유라는 사방이 하얀 방 한가운데 서있었다. 온몸을 죄어오던 유니폼은 사라지고 통이 넓은 트 레이닝복을 입고 있었다. 유라는 자신이 입고 있는 옷을 보고 꿈을 꾸고 있음을 직감했다. 온 세상의 색깔을 모두 담고 있는 이 후드 티가 자신의 옷장에 있을 리가 없기 때문이다.<br/>
        유라는 이 상황이 너무나도 생생해 꿈이라고 믿겨지지 않았다.<br/>
        ‘조금 구경해 볼까?’<br/>
        유라는 주변을 둘러보기 위해 첫 발을 떼려했지만 이내 마음을 바꿨다. 자신이 마구잡이로 돌 아다니면 이 하얀 방이 더러워질게 뻔했기 때문이다. 아무리 꿈이라고 해도 유라는 흰 바닥이 더러워지는걸 보는 게 끔찍이도 싫었다.<br/>
        그때였다 취익- 하는 맥주 캔 따는 소리와 함께 유라의 등에서 움직임이 느껴졌다. “뭐..뭐야!<br/>
        유라는 손을 휘저어 등에 붙은 정체불명의 물건을 떼어냈다.<br/>
        커다란 물총이었다.<br/>
        ‘아까부터 등이 불편했는데 이런 게 달려있었네’<br/>
        유라가 물총을 이리저리 둘러보던 중 김빠지는 소리를 내던 물총에서 알록달록한 컬러 페인트 가 뿜어져 나왔다. 컬러 페인트는 흰 방에 오점을 남겨대고 있었다.<br/>
        “더러워질까봐 움직이지도 않았는데!”<br/>
        신경질이 난 유라는 물총을 멈추기 위해 패대기쳤지만 멈출 기미가 보이지 않았다.<br/>
        ‘언제 다 치우라고...’<br/>
        방은 점점 색으로 물들어 가고 있었다. 바닥에 주저앉아 지저분해지는 방을 허탈하게 쳐다보 고 있던 유라는 마음을 고쳐먹고 다시 일어났다.<br/>
        “뭐 어때! 꿈인데. 내가 치워야하는 것도 아니니까 그냥 즐기자!”<br/>
        유라는 폭주하는 컬러 건을 집어 들고 흰 벽의 이곳저곳에 난사하기 시작했다. 유라는 야자를 째고 담을 넘는 고등학생이 된 것만 같았다. 스스로 세워둔 틀을 부숴버린 기분이었다.<br/>
        유라는 뭐든 할 수 있을 것만 같은 기분에 가볍게 발을 굴렸다. 예상대로 그녀의 몸이 가볍게 떠올랐다.<br/>
        “꺄하하하”<br/>
        유라는 아이처럼 소리 내 웃고선 그 소리에 놀랐다. 이렇게 웃어본 게 얼마만인지!<br/>
        공중에서 한창 즐거운 시간을 보내고 있을 때, 유라는 발아래에서 인기척을 느꼈다.<br/>
        유라가 내려다보니 화려한 위스크칼라가 달린 피에로 복장의 토끼가 그녀를 올려다보고 있었 다. 생뚱맞은 토끼의 등장에 그만 유라는 토끼를 향해 컬러 건을 쏴버렸다.<br/>
        갑작스러운 공격에 뒤로 넘어진 토끼는 얼굴에 묻은 페인트를 닦으며 중얼거렸다. “예상외로군. 움츠려 있을 줄 알았는데...”<br/>
        <br/><br/>
        “미안해! 토끼야 괜찮아?”<br/>
        공중에서 내려온 유라가 토끼에게 달려가며 물었다.<br/>
        “난 괜찮다네. 그나저나 자네 이름이 뭔가”<br/>
        꽤나 중후한 목소리로 토끼가 말했다.<br/>
        유라는 토끼가 말한다는 거에 한번, 낮은 톤의 목소리에 두 번 놀랐지만 꿈이니 토끼가 말 정 도는 할 수 있지, 라고 생각하며 빠르게 상황을 납득했다.<br/>
        “내 이름...?”<br/>
        그 순간 유라의 입이 제멋대로 움직였다.<br/>
        “동보희”<br/>
        유라는 당황스러웠지만 ‘동보희’라는 이름을 듣는 순간, 마치 자신이 원래 ‘동보희’였던 것처 럼 느껴졌다.<br/>
        “동보희라...”<br/>
        유라의 답을 들은 피에로 토끼는 의미심장한 미소를 짓더니 유라에게 말했다.<br/>
        “넌 충분히 준비가 됐다. 여긴 네가 있기에 너무 좁아. 더 넓은 세상으로 데려가 주지.” 토끼는 빛이 뿜어져 나오는 작은 문을 가리켰다.<br/>
        “날 따라와”<br/>
        유라, 그러니까 보희는 홀린 듯 토끼를 따라 문으로 나갔다.<br/>

        <button type="button" class="modal-close" @click="showRelated = false">
        <span class="blind">닫기</span>
      </button>
    </div>
    <button
      type="button"
      class="modal-close"
      @click="$emit('update:visible', !showContentsModal)"
    >
      <span class="blind">닫기</span>
    </button>
  </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
  name: "CharacterModal1",
  emits: ["update:visible"],
  props: {
    showContentsModal: {
      type: Boolean,
      default: false,
    },
    title: {
      type: String,
      default: "",
    },
  },
  data() {
    return {
      showRelated: false,
    };
  },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
