<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v6">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    아재개그를 즐기는 1120살 골목대장 '마리앙'
                </p>
                <p class="main-character-text2">
                    “모든 사람들이 가지고 있는<br>
                    개구장이의 모습을 꺼내어 보겠다!”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">1120세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">145cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#통통튐 #으른아이 #속이깊은귀여움소유자 #호기심많음</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">스케이트, 아재개그</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">통통 튀어 다닐수록 쌓이는 에너지</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 마리앙 이야기</h3>

            갑작스러운 사고로 죽음의 경계에 서 있는 여인<br/>
            이곳이 바로 말로만 듣던 사후세계? 하지만 뭔가 이상했다.<br/>
            죽었다고 생각했는데 소설가가 되었다?! 죽어서 꿈을 이뤘다니?<br/>
            것도 나오는 것마다 족족 성공하는 베스트셀러 작가?!<br/>
            그런데 이상하다 반복적으로 사고가 일어나면서 이번에는 정말로 죽겠구나, 죽었겠구나 생각하지만 이번에는 자신의 소설 속 캐릭터로 눈을 뜨게 된다.<br/>
            <br/>
            <br/>
            대낮에 달려오는 트럭에 치인 후 정신을 차려보니 바로 앞에서 한 남자가 선망의 눈빛을 보내고 있었다. 이 남자가 저승사자인가. 고민하고 있을 때, 남자는 대뜸 자기소개를 했다.<br/>
            <br/>
            “제 이름은 이상수에요.”<br/>
            “네?”<br/>
            <br/>
            앞 뒤 없는 자기소개에 어떤 반응을 보내야 할까 고민하다 웃음으로 상황을 무마하기로 결심했다.<br/>
            “동생 이름은 이하수인가. 하하하.”<br/>
            <br/>
            나름 고심한 끝에 한 개그인데 남자는 당혹스럽다는 표정을 지으며 자리를 떠났다. 그때 뒤에서 정장을 입은 남자가 다가와 소곤거렸다.<br/>
            “이 소 작가님, 서둘러 진행해 주셔야 할 것 같습니다.”<br/>
            <br/>
            뭘 빨리 진행해야 한단 소린가. 난 상황을 파악하기 위해 재빨리 눈을 굴려 주변을 살폈다.<br/>
            내가 있는 곳은 서점인 듯했고 사람들은 내 앞에 줄지어 서 있었다. 내가 앉은 테이블 맞은편에 걸린 커다란 현수막에 아까 들은 이름이 큼직하게 써져있었다.<br/>
            <br/>
            [7년 연속 베스트셀러 작가 이 소, &gt;복수의 여신&lt; 1000만부 판매 기념 사인회]<br/>
            <br/>
            내가 저 현수막 속의 ‘이 소’라는 작자 인건가?<br/>
            참 요상한 꿈이다 생각하며 내 손등을 꼬집었다가 탄식을 내지르며 자리에서 벌떡 일어났다. 손등에 고스란히 전해지는 통증 때문이기도 했지만, 손끝에 느껴지는 부드러운 피부의 감촉이 날 더 놀라게 했다. 거칠고 핏줄이 도드라진 노파의 살결이 아니었다. 난 얼른 얼굴을 더듬었다. 주름이라곤 없는 팽팽한 젊은 처자의 피부였다.<br/>
            “이게 뭐야...”<br/>
            <br/>
            자리를 박차고 일어난 내가 얼굴을 더듬고 있자 좀 전에 내게 말을 걸었던 정장의 남성이 다시 다가왔다.<br/>
            “작가님...”<br/>
            <br/>
            난 그의 말을 끊고 물었다.<br/>
            <br/>
            “내가 몇 살이죠?”<br/>
            <br/>
            내 물음에 곤란한 표정을 짓고 있던 그가 답했다.<br/>
            “서른 중반....아니 초반일까요?”<br/>
            <br/>
            중반이든 초반이든 젊다. 참 젊은 나이다. 분명 꿈은 아닌데 이게 어떻게 된 일인가.<br/>
            그때 손녀딸의 말이 떠올랐다.<br/>
            ‘할머니 소설 좋아하지? 이것 좀 봐, 요즘 잘나가는 웹소설이란 거야. 요즘은 환생, 빙의 이런 게 엄청 인기 있다니까.’<br/>
            이게 손녀딸이 말하던 빙의...라는 걸까?<br/>
            앞에선 &gt;복수의 여신&lt;이란 책을 한권씩 손에 들고 있는 이소작가, 그러니까 나의 팬들이 수군거리기 시작했다. 나는 이 상황을 벗어나기 위해 머리를 굴리다 바닥에 털썩 쓰러졌다. 사람들이 달려오는 소리가 들렸다.<br/>
                휴우, 역시 오래 살다보니 연기력도 는다니까.<br/>
            <br/>
                일주일이 흘렀다. 난 이 작가의 집에서 칩거하며 상황을 정리하고 있었다. 80대 중반을 향하고 있던 나는 여느 날과도 같이 이른 아침 동네를 돌며 공병을 모으고 있었다. 그러다가 시장바구니 바퀴가 보도블럭에 끼였고, 그걸 빼내려다 난데없이 등장한 트럭에 치인 거다. 여기까진 분명 나, 박달례의 기억이었다.<br/>
                그 후에 ‘이 소’라는 작가양반 몸으로 빙의 된 거겠지. 이 몸의 주인, 이 소는 36살. 7년 전에 등장해 한국 장르문학의 흥행을 이끈 혜성 같은 신인작가다. 주로 로맨스장르를 쓰는데 출간할 때마다 베스트셀러가 된다.<br/>
                돈도 꽤나 번 듯 했다. 도심 한복판에 36층 한강 뷰 아파트에 사는걸 보면 말이다. 나는 예상외로 빨리 이 상황에 적응했다. 혼란보단 즐거움이 조금 더 컸다. 고생만 하며 살아온 80년이었다.<br/>
                내 인생을 뭐라 말해야 할까. 기구하다? 비참하다?<br/>
                1남 6녀의 장녀로 태어나 평생 남을 위해 돈을 벌었다. 일찍이 공장에 나가 동생들의 학업에 보탬을 했고, 결혼을 하고는 아이를 위해 반찬가게에서 일했다. 나이 50, 딸아이를 다 키우고 나니 늙은 부모를 모셔야 한다기에 동네 화력발전소에서 청소 일을 하며 돈을 벌어왔다. 모든 게 다 끝나고 나니 내겐 남아 있는 게 없었다.<br/>
                젊음도 열정도, 기회도 남아있지 않았다. 점점 굽어가는 등과 주름, 시큰거리는 관절의 통증만이 내 재산의 전부였다. 매정하게 들릴지도 모르겠지만 참 돌아보기 싫은 삶이었다.<br/>
                난 이 모든 상황을 신의 작은 선물이라 여기기로 했다. 그렇지 않다면 내가 그토록 꿈꾸던 작가로 빙의하진 않았을 테니까.<br/>
            <br/>
                과거는 뒤로 하고 내게 새로 주어진 삶에 충실해 보기로 했다. 그렇게 6개월, 난 36층 한강 뷰 아파트에 은거하며 신작을 집필했다.<br/>
                신작은 빙의를 소재로 한 이야기였다. 내가 빙의를 겪었기에 쓰게 된 글이기도 했다.<br/>
                먼 옛날 신과 인간이 가까웠던 그 시절, 인간을 아끼던 전쟁의 신 ‘안드라스타’는 인간을 돕다 태양의 신 ‘루 라바다’에게 미움을 산다. 루의 저주를 받은 안드라스타는 이름 없는 귀족 가문의 사생아에게 빙의된다.<br/>
            <br/>
                작가에게 빙의되며 능력까지 그대로 받은 걸까, 아니면 살아온 시간이 길어서일까, 처음 써보는 소설임에도 막힘없이 풀렸다.<br/>
                원고를 완성하고 출판사와의 미팅을 위해 집을 나서는 길이었다. 건널목에서 신호를 기다리는데 저 편에서 눈에 익은 트럭 한 대가 보였다. 저런 디자인의 트럭은 널렸으니까. 괜히 거름직한 기분이 들어 트럭의 동세를 잘 살피며 신호를 건넜지만, 트럭은 별 다른 움직임이 없었다.<br/>
                괜한 걱정이었어.<br/>
                안심하는 순간, 반대편에서 들려온 굉음과 함께 내 몸이 떠올랐다.<br/>
                조금 전까지 보이지도 않던 트럭이 날 향해 달려온 것이다.<br/>
            <br/>
                ‘망할 트럭... 망할 신...’<br/>
            <br/>
                짧은 순간, 난 푸른 하늘을 향해 빠르게 욕을 퍼부어 줬다.<br/>
            <br/>
                이번에 깨어난 곳은 어둠 속이었다.<br/>
                고통은 느껴지지 않았다. 고개를 들자 어둠 한가운데 고고히 빛나는 금색의 왕자가 보였다. 그리고 그 왕좌에 다리를 꼬고 앉아있는 남자를 보고 난 섬짓한 기시감을 느꼈다.<br/>
                금발에 적안의 남자. 분명 내 소설 속에 나오는 태양의 신 루였다. 그리고 이 상황은 내 소설의 가장 첫 장면이었다.<br/>
            <br/>
                “네 죄를 알겠는가.”<br/>
            <br/>
                대사 또한 같았다. 다음 대사는 ‘너는 신의 금기를 어겼다.’겠지.<br/>
                하지만 예상은 빗나갔다. 남자의 서늘한 목소리는 내가 쓴 소설의 대사가 아닌 다른 말을 뱉어냈다.<br/>
            <br/>
                “기회를 얻게 되었는데도 너는 네 갈망을 모르는구나.”<br/>
            <br/>
                이게 무슨 상황인가. 내가 한참 고민에 빠져있을 때, 태양의 신 루가 말을 이었다.<br/>
            <br/>
                “스스로의 간절함에 응답하지 않은 자여. 내 또 한 번 기회를 주겠다. 더 큰 세상으로 가라.”<br/>
                “네가 창조한 너의 세상으로”<br/>
            <br/>
                그 말을 마지막으로 난 더 깊은 어둠 속으로 빨려 들어갔다.<br/>
                그는 내가 창조한 신인가. 아니면 날 창조한 신인가. 혼란이 꼬리를 물며 나는 깊은 잠에 빠졌다.<br/>
                바람을 타고 들어온 짙은 꽃향기가 코를 간지럽히는 가운데, 나는 넋이 나간 표정으로 침대에 앉아있었다.<br/>
                이번에 또 뭘까. 나는 침을 삼키며 조심스레 거울 앞으로 갔다. 거울 안에 서있는 건 84세 박달례도, 36세 이 소도 아니었다.<br/>
            <br/>
                솜사탕 같은 분홍 머리, 통통한 볼 살에 동그란 눈, 그리고 짧은 다리. 10살 내외로 보이는 어린 아이였다.<br/>
                마리앙 리페어로이, 망해가는 귀족가의 사생아.<br/>
                내 소설 속 주인공, 전쟁의 신 ‘안드라스타’가 빙의한 어린 꼬마에 내가 빙의됐다.<br/>
                미치도록 짓궂은 신의 장난이었다.<br/>
            <br/>



                <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal6",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title6.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title6_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
