<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v19">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    초인적인 운동신경! 우주 최강 만능 스포츠맨 '공차니'!
                </p>
                <p class="main-character-text2">
                    "지치지 않는 체력을 가진 위대한 스포츠 스타!"
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">30세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">180cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#지구력우주최강#의리도최강</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">풋살</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">손을 모으면 나오는 에너지볼</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 공차니 이야기</h3>
            “최민식 선수가 공을 받았습니다! 자 이번이 중요한 기회인데요. 0대 0의 상황, 후반부가 얼 마 남지 않은 지금 선취점을 따낸다면 경성FC의 우승이 확고해집니다.”<br/>
            나는 날 막기 위해 다가오는 상대편 선수들의 틈 사이를 헤집고 골대 사이드로 이동했다. 그리곤 수풀사이에 숨은 맹수처럼 적절한 타이밍을 잡고 있었다. 3초도 지나지 않은 짧은 시 간이었다. 하지만 이미 내 몸은 긴장감에 빳빳하게 굳어왔다.<br/>
            다리가 공을 향해 크게 휘둘러졌고, 난 어딘가 잘못되었음을 직감했다. 안 돼,<br/>
            다리의 안쪽에서부터 묵직한 파열음이 들려왔다.<br/>
            뚜욱-<br/>
            “허억, 허억”<br/>
            또 같은 꿈이다.<br/>
            나는 거칠게 호흡을 내쉬며 침대에서 일어나 10년 째 욱신거리는 발목을 쓸어내렸다. 잊었다 고 굳게 믿고 있었던 과거의 기억이 왜 불쑥 찾아온 걸까. 난 손등으로 식은땀을 닦아냈다.<br/>
            이 꿈이 시작된 건 분명 그날 밤 부터였다. 2주전 발목치료를 위해 찾은 물리치료실 커튼 너 머로 한 아이의 대화를 들은 날 말이다.<br/>
            발목위에 찜질팩을 올리고 누워있을 때였다. 커튼 너머로 아이의 쾌활한 목소리가 들려왔다.<br/>
            ‘쌤 저 잘하면 유소년 국가대표로 뽑힐 수도 있어요!’ ‘으이구, 너 무릎 상태도 안 좋은데 지금 무리하면 안 돼.’ ‘그럼 쌤 또 만나고 좋죠. 헤헤’<br/>
            국가대표라는 말에 나는 커튼 너머의 대화에 귀를 기울였다.<br/>
            ‘넌 축구가 그렇게 좋아? 맨날 다치는데도?’ ‘그럼요. 축구하려고 태어난 것 같다니까요’<br/>
            나는 그 말에 피식 웃고 말았다. 내 젊은 날의 치기가 겹쳐보였기 때문이었다. 그때 골을 넣었더라면, 나도 국가대표로 선발 될 수 있었겠지.<br/>
            난 이미 떠나간 기회를 다시 떠올렸다.<br/>
            그날 밤 꿈엔 잊기 위해 애썼던 내 마지막 경기가 펼쳐졌다. 중요한 상황에서 헛발질을 하며 결국 골을 넣지 못하는 내 모습을 지워내고 싶었지만 그 꿈은 매일 밤 날 찾아와 괴롭혔다.<br/>
 <br/>
            “당신 요즘 안색이 너무 안 좋은데? 보약이라도 한 첩 지을까?”<br/>
            거실에서 쇼파에 누워 티비를 보고 있는 내게 아내 유정이 다가와 말했다.<br/>
            “아이 됐어, 보약은 무슨.”<br/>
            “그건 그렇고 당신 왜 요즘 축구를 보고 그래? 그동안은 질색을 하더니.”<br/>
            아내는 티비 화면을 보곤 조금 놀란 기색이었다.<br/>
            당연한 반응이었다. 22살이라는 어린 나이에 은퇴를 한 뒤로 축구를 거들떠보지도 않았으니 까.<br/>
            “그냥 하길래 잠깐 본거야” “요즘 수상해.”<br/>
            아내는 눈을 한번 흘겼다.<br/>
            “아참 오늘 물리치료 가는 날 아니야?”<br/>
            “맞아. 슬슬 출발하려고.”<br/>
            “이제 괜찮으면 물리치료도 그만 받자. 굳이 계속할 필요가 있나. 운동 다시 할 것도 아니고.” “몇 번만 더 받고...”<br/>
            나는 말을 얼버무리다가 집을 나섰다.<br/>
            나는 물리치료실에서 마사지 기계를 붙이고 누워 내심 그 아이를 기다리고 있었다. 지난주에도 이 시간 때에 왔던 것 같은데...<br/>
            생각이 끝나기가 무섭게 밝은 목소리가 치료실에 울려 퍼졌다.<br/>
            “쌤! 저 왔어요!”<br/>
            나는 커텐을 슬쩍 걷어 아이의 얼굴을 봤다. 진한 갈색머리에 170중반 정도의 키, 아직 학생 이라 그런지 선수라기엔 조금 작아 보이는 체구를 가진 아이였다. 그때 아이가 고개를 휙 돌 려 내 쪽으로 시선을 옮겼다. 나는 당황해 잽싸게 커텐 속으로 몸을 숨겼다. 훔쳐보는 걸 들 켜 괜히 민망해 지는 순간이었다. 아이는 날 보지 못했는지 신경 쓰지 않고 물리치료사와 대 화를 이어갔다.<br/>
            “저 이번 주 금요일에 결승전 하거든요? 아마 거기서 잘하면 진짜 국대 갈 수 있어요! 감독님이 저 엄청 좋게 봐주시고 있대요.”<br/>
            “승민아 너 그 무릎으로 괜찮겠어?”<br/>
            “에이 쌤 그럼요! 벌써 다 나았어요.”<br/>
            “역시 젊은 게 깡패라니까. 그래도 혹시 모르니까 오늘 치료는 다 받고 가”<br/>
 <br/>
            “네!”<br/>
            아이의 목소리는 한껏 들떠보였다.<br/>
            금요일, 아이의 경기를 보러간 건 순전히 충동적인 행동이었다. 어쩌면 그 아이를 통해서 내 속에 묵혀왔던 염원을 해소하고 싶었던 걸지도 모른다.<br/>
            시간에 맞춰 경기장에 왔건만 난 쉽게 들어가지 못 하고 한참동안 밖을 맴돌았다.<br/>
            축구는 내게 애증이었다. 너무나 사랑했기에 내 실패를 용납할 수 없었고, 그래서 최대한 멀 리 도망쳤다. 날 살게 한 것이자 망하게 한 것이 바로 축구였다.<br/>
            그렇게 오랜 시간 도망쳐 왔는데, 다시 애증의 존재를 마주한다는 건 꽤나 두려운 일이었다.<br/>
            그깟 공놀이가 뭐라고.<br/>
            나는 애써 간지러운 마음을 잠재우고 경기장으로 들어갔다.<br/>
            이미 경기는 후반부의 절반을 막 지나고 있었다. 밖에서 고민하던 시간이 생각보다 길었던 탓 이었다.<br/>
            유소년 축구 결승전이라 그런지 관람석엔 사람들이 꽤 많았다. 아마 학교에서 단체로 관람을 온 듯 했다. 나는 구석 자리에 조용히 앉아 날 여기까지 오게 만든 소년을 찾았다. 아이는 나 와 같은 공격수 포지션이었다. 나는 재빨리 경기의 상황을 파악했다.<br/>
            1대1의 동점에 후반부가 20분 정도 남은 상황. 소년의 팀은 그라운드를 밀고 올라가 상대편 골대 근처에서 접전을 벌이고 있었고 아이는 곧 기회를 잡았다. 상대편 수비가 막고 선 공을 가져온 것이다.<br/>
            아주 먼 거리였지만 난 순간적으로 아이의 눈에 띈 이채를 볼 수 있었다.<br/>
            관중석엔 긴장감 어린 환호가 터져 나왔다. 아이가 점수를 딴다면, 경기의 흐름을 바꿀 수 있 는 상황이었다.<br/>
            탕!<br/>
            공을 걷어차는 경쾌한 소리가 들렸고 공은 빠르게 날아갔다.<br/>
            하지만 공은 골대에 맞고 튕겨져 나왔고, 아이는 균형을 잃고 쓰러졌다. 아직 앳된 얼굴에 허망함이 잔뜩 서려있었다.<br/>
            일어나, 포기하지 마. 계속 달려야해.<br/>
            난 10년 전 과거의 내가 듣고 싶었던 말을 아이에게 대신했다.<br/>
            풀이 죽어 보이는 아이는 동료 선수의 부축을 받으며 일어났다. 하지만 그것도 잠시였다. 불거진 무릎을 한번 쓸어내리고는 이내 다시 달리기 시작했다. 최후의 발악이라도 하듯이 이 를 꽉 깨문 채였다.<br/>
 <br/>
            하지만 후반전 5분이 남을 때까지 점수의 균형은 깨지지 않았다.<br/>
            만일 경기가 동점으로 끝나고 승부차기 까지 가게 된다면 아이의 팀은 불리해진다. 상대팀은 승부차기에 꽤 강한 편이라고 들었다. 결승전까지 올라오는 경기에서도 몇 번이나 승부차기로 승리를 가져간 전적도 있었으니까.<br/>
            최대한 후반전 내에 승부를 내야한다.<br/>
            후반전이 3분 남았을 때, 아이의 팀은 다시 공을 몰고 상대팀 골대로 올라갔다. 다들 몇 분 남지 않은 경기에 지친 모습이 역력했다.<br/>
            아이는 수비수를 재치고 가장 먼저 골대 근처로 가 포지션을 잡고 있었다.<br/>
            때를 기다리는 거겠지. 나는 계속해 공과 아이의 움직임을 주시했다.<br/>
            그때, 상대편의 수비에 막힌 공격수 하나가 아이에게 공을 드리블 했다. 꽤 거리가 차이 났지 만 아이는 재빨리 달려가 공을 받았다. 그리고 조금의 틈도 없이 공을 걷어찼다.<br/>
            망설임 없는 움직임이었다.<br/>
            공은,<br/>
            골키퍼의 허점을 뚫고 들어가 골대의 망을 흔들었다. 찰나의 침묵이 맴돌던 관중석은 어느새 환호로 일렁였다.<br/>
            해냈구나. 너는.<br/>
            난 팀원들에게 둘러싸여 헝가레를 받는 아이를 흐뭇한 얼굴로 바라보고 있었다.<br/>
            경기가 끝나고, 관객들이 우수수 빠져나갈 때에도 난 자리를 지키고 앉아있었다.<br/>
            오랜만에 느끼는 경기의 열기를 조금 더 느끼고 싶었기 때문이었다. 넓게 펼쳐진 푸른 잔디, 그리고 균형을 이루는 흰 선, 우두커니 자리를 지키는 골대. 그것들을 애정 어린 시선으로 지 켜봤다.<br/>
            오랜 시간 떠났던 고향에 돌아온 기분이었다.<br/>
            “안녕하세요.”<br/>
            누군가의 인사에 고개를 돌렸을 때, 난 목소리의 주인공을 보고 숨을 헉 들이마셨다. 내가 보러 온 그 아이가 내 앞에 떡하니 서있던 것이다.<br/>
            “최민식 선수님 맞으시죠? 어릴 때 경기영상 보면서 많이 연습했어요.” 쿵, .<br/>
            아이의 말에 심장이 내려앉는 기분이었다. 날 알아볼 거라곤 상상도 못했었는데, 뒤이어 아이가 하는 말은 날 더 당황하게 만들었다.<br/>
 <br/>
            “경기 보러 와줘서 고마워요. 내심 와 줬으면 싶었거든요.”<br/>
            “응?”<br/>
            “물리치료실에서 선수님보고 일부러 크게 말했어요. 들으시라고...”<br/>
            나는 아이를 훔쳐보다 들킨 날을 떠올렸다. 그 때 날 알아봤었구나.<br/>
            10년 전 부상으로 은퇴한 보잘 것 없는 선수 하나를 기억하다니.<br/>
            내심 고마웠지만, 부끄러운 마음이 들어 재빨리 자리를 뜨려고 일어난 참이었다.<br/>
            아이는 쑥 하고 손을 뻗어 보라색 꽃 한 송이를 건넸다. 아마 본인이 받은 꽃다발에서 뽑아 온 듯 했다.<br/>
            “이거요.”<br/>
            “이게 뭐니?”<br/>
            “그냥, 오늘은 좋은 꿈 꾸셨으면 해서요.”<br/>
            아이는 내가 마치 악몽에 시달리는걸 아는 듯이 말했다. 나는 얼떨결에 꽃을 받아들었다.<br/>
            그날 밤이었다. 나는 오늘도 어김없이 과거의 경기 속에서 고전을 하고 있었다. 꿈 속 경기는 비디오를 재생하듯 매번 똑같았다. 그리고 나는 또 다시 팀원이 건네준 공을 받았다.<br/>
            나는 알고 있었다. 난 이 공을 절대 넣지 못한다. 난 또 실패할 거고, 절망하며 꿈에서 깨겠 지.<br/>
            “포기하지 마요!”<br/>
            그때 관중석에서 앳된 목소리가 들려왔다. 그곳엔 오늘 봤던 그 아이가 있는 힘껏 고함을 내 지르고 있었다.<br/>
            쟤가 왜 여기에... 의문과 함께 오늘 낮에 아이가 내게 했던 말을 떠올렸다.<br/>
            오늘은 좋은 꿈 꿨으면 좋겠다고.<br/>
            나는 공을 다시 내려다 봤다. 그리고 골대의 사이드를 향해 공을 걷어찼다. 탕!<br/>
            경쾌한 울림이었다.<br/>
            나는 눈을 질끈 감았다. 차마 결과를 볼 자신은 나지 않았었다.<br/>
            “와아아!”<br/>
            사방에서 환호가 울려퍼지는 걸 듣고 나서야 난 슬며시 눈을 뜰 수 있었다.<br/>
            “뭐...뭐야!”<br/>
            하지만 눈을 떴을 때 보이는 건 푸른 경기장이 아닌 끝을 알 수 없는 흰 공간이었다.<br/>
            “기다리고 있었어요.”<br/>
 <br/>
            등 뒤에서 익숙한 목소리가 들려왔다.<br/>
 <br/>

            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal19",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title19.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title19_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
