<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v12">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                  힐링 보이스로 상처를 치료하는 치유의 神 '치유신'
                </p>
                <p class="main-character-text2">
                    “파괴된 모든 것들을,<br /> 치유하는 것”
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">40</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">195cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#온화한마음#아름다운미소</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">명상</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">손에나오는빛으로마음을치유</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 치유신 이야기</h3>
            희생과 구원. 이 것만이 내가 태어난 이유를 말하고 존재의 가치를 표현할 수 있을 것이라 생각하며 신부님의 길을 걸어가기로 마음먹었었다.<br/>
            하지만, 동생의 억울한 사건으로 인하여 내 인생은 완전히 뒤바뀌었다.<br/>
            누군가를 구원해 주는 것이 꼭 신부로써 마음을 어루만져 주는 것이 아닌,<br/>
            과연 현실적인 구원이 무엇인가? 라는 생각에 사로잡혀 마지막까지 고민하던 신부의 길을 포기했다. 상처받은 모든 것 들을 구제해 주고 싶다.<br/>
            그 사람들의 삶도, 그 사람들의 마음까지도.<br/>
            가톨릭 신학교에 입학한지 한 달이 채 안된 나는 신념과 열정으로 가득 찬 매일을 보내고 있었다. 이른 아침부터 시작된 기도와 미사에도 피곤함은 느껴지지 않았다.<br/>
            미사를 끝내고 아침식사를 위해 식당에 도착했을 때였다. 매일 저녁 8 시부터 아침 8 시까지 가지는 대침묵이 마침 끝났었고, 동기들의 시시콜콜한 잡담에 공기가 소란스러웠다. 그 틈을 뚫고 신부님 한분이 날 조용히 불러내셨다.<br/>
            “도혁아, 미사엘,”<br/>
            신부님은 날 한번 부르시곤 한참을 말이 없으셨다.<br/>
            “방금 경찰서에서 연락이 왔어. 사고가 났다고... 동생이” “네?”<br/>
            ‘동생’, 이 한 단어에 내 세상이 무너지는 기분이었다. “태워줄게. 같이 가자”<br/>
            신부님은 멍한 눈빛으로 허공을 응시하는 내 어깨를 토닥이며 말했다.<br/>
            동생 도진은 내게 유일한 가족이었다.<br/>
            15 년 전, 이른 새벽부터 도진과 날 깨운 아버지란 사람은 우리에게 옷을 몇 겹이나 껴입히고 차에 태웠다. 차에서 올라오는 한 겨울의 냉기에도 우리는 깊은 잠에 빠졌다. 얼마나 이동했는지는 모른다. 다만 어슴푸레한 새벽 공기가 걷히고 아침햇살이 창문을 통해 들어오던 게 기억난다.<br/>
            <br/>
            도착한 곳은 숲으로 둘러싸인 건물이었다. 며칠 전 내렸던 눈이 녹지 않고 건물 울타리를 따라 쌓여 있었다.<br/>
            ‘도혁아, 도진이 손 꼭 잡고 있어.’<br/>
            이 말을 끝으로 그는 떠났다. 다시 데리러 오겠다는 말은 끝까지 하진 않았다. 나는 동생의 손을 꼭 잡고 있었고 떠나가는 아버지의 파란 트럭을 보고 있었다. 난 트럭이 완전히 사라지고 나서 몸을 돌려 건물을 응시했다. 정문 위로 커다란 간판이 붙어 있었지만 그 당시엔 글자를 읽지 못했다.<br/>
            [마리아 보육원]<br/>
            읽는다 하더라도 그 뜻을 알진 못했을 테다.<br/>
            그날, 우리를 두고 가던 아버지의 얼굴은 아무리 떠올려 봐도 기억나지 않는다. 하지만 내 손을 꼭 잡고, 해맑은 얼굴로 입김을 뿜어내던 도진의 얼굴은 여태 생생하다. 털모자에 파묻힌 하얀 얼굴과 빨갛게 얼은 코, 긴 속눈썹에 맺힌 수증기가 얼어붙은 것 까지.<br/>
            우리가 버려졌음을 받아들이는 건 꽤 괴로운 일이었다. 악을 쓰며 울던 나는 한 달이 지나서야 울음을 그쳤고,2살 어린 도진은 3년 동안 아무 말도 하지 않았다.<br/>
            나는 항상 내 옆에 붙어 있는 도진을 보며 맹세했다. 너 하나 만큼은 평생 지키겠노라고. 그곳에서 우리는 서로밖에 없었다.<br/>
            그곳은 천주교 보육원이었고, 신부님과 수녀님의 사랑으로 난 하나님을 만날 수 있었다. 신앙을 가지게 된 이후, 난 매일 밤 동생을 위해 기도했다. 얼마 지나지 않아 도진이 다시 말하기 시작했다. 나는 굳건히 믿었다. 우리는 구원받았노라고. 하나님이 우릴 구원해주셨다고.<br/>
            그때부터 난 신부가 되기로 결심했다. 사람들을 구원의 길로 인도하는 게 내 새로운 삶의 목표가 됐다.<br/>
            나는 신부님이 운전하는 차 조수석에 앉아 15 년 전, 마리아보육원에 처음 온 날을 떠올리고 있었다. 도진이 뺑소니를 당했다는 소식은 비현실적이었기에 모든 상황이 꿈을 꾸는 것 같았다. 창문으로 올려다 본 가을 하늘은 깊이를 알 수 없을 만큼 높았다. 그 아득한 높이를 가늠하다 난 신부님께 물었다.<br/>
            “신부님, 저 곳에 하나님이 계신가요.”<br/>
            <br/>
            내 물음에 그는 답하지 않자 난 재차 물었다.<br/>
            “신부님, 정말 저 곳에 신이 있는 겁니까.”<br/>
            두 번째 물음에도 그는 악착같이 운전대만 잡고 있었다.<br/>
            “신은 절 버렸습니다.”<br/>
            신부님은 그제야 입을 열었다.<br/>
            “시험에 들지 말거라. 하나님의 사랑을 의심하지 마렴...”<br/>
            나는 더 이상 질문하지 않았다.<br/>
            경찰서엔 보육원 수녀님과 신부님이 먼저 도착해 있었다. 그들은 날 안아주었고 짧은 기도를 해주었다. 형사는 흰 천을 살짝 걷어 얼굴을 확인시켜줬다. 흰 천속에 누워있는 도진은 평온해 보였다.<br/>
            “네, 제 동생이 맞습니다.”<br/>
            이 한마디에 나의 유일한 가족이자 도진은 죽음을 맞았다.<br/>
            세 달이 지나고 나서야 범인이 잡혔다. 평범한 가정의 남편이자 아빠라고 했다. 아이가 너무 어리다고 했다. 업무가 많았고, 잦은 야근과 이른 출근이 힘들었지만 차마 퇴사 할 수 없었다고, 가장의 무게는 무겁다고, 어린 딸아이가 너무 보고 싶다고 했다.<br/>
            남자의 아내는 갓 돌이 지난 딸아이를 등에 업고 재판을 참관하러 왔고, 중간에 아이가 울자 조용히 자리를 떴다.<br/>
            판사는 집행유예를 내렸다. 그의 판결에 내 의사는 들어가지 않았다.<br/>
            구원이란 무엇인가.<br/>
            재판이 시작할 때부터 끝날 때까지. 난 그 질문에 대한 답을 찾았지만 결국 어떤 답도 얻지 못했다. 새로이 깨닫게 된 게 있다면, 신은 인간을 구원하지 않는 다는 것, 단지 관망할 뿐이라는 것이다.<br/>
            <br/>
            당시의 내게 간절했던 건 신의 축복 따위가 아닌 능력 있는 변호사였다. 그날부로 나는 신을 등졌다.<br/>
            신학교를 자퇴하고 10 년이란 세월이 흘렀다. 어떻게 살았는지 모를 정도로 최선을 다했다. 다른 대학을 졸업하고 로스쿨에 진학했다. 곧 변호사 시험에 합격한 나는 고민도 않고 국선변호사가 됐다.<br/>
            ***<br/>
            “변호사님, 이미애 피고인이 방문하셨습니다.”<br/>
            송무팀 직원이 사무실로 찾아와 말을 전했다. 이미애씨는 얼마 전 끝난 사건의 피고인이었다. 재판이 완전히 끝났음에도 한번 인사드리고 싶다고 어제 연락을 받은 터였다. 나는 정리하고 있던 서류를 내려두고 사무실을 나섰다.<br/>
            비참한 사건이었다. 대형 산부인과에서 의사의 오판으로 출산 중이던 아이가 죽은 사건이었다. 병원 측은 잘못이 없다고 했지만, 명명백백한 오진이었다. 제왕절개를 하면 살 수 있던 아이었는데, 의사는 자연분만을 진행했다. 태어난 아이는 울음을 터뜨리지 못했고 산모는 아이를 안아보지도 못한 채 떠나보내야만 했다.<br/>
            원래라면 전담로펌을 끼고 있는 대형 병원과의 싸움에서 개인이 이기는 건 불가능에 가까웠다. 증거수집에도 어려움이 있고 병원에서 진료기록을 은폐하기 때문이다. 하지만 재심 끝에 우리는 승소할 수 있었다.<br/>
            면담실에 앉아있던 피고인은 날 보고 일어나 고개를 몇 번이고 숙였다. 나는 손사래를 치며 앉기를 권했다.<br/>
            “감사합니다. 변호사님 감사해요”<br/>
            “아닙니다. 운이 좋았던 거예요. 믿어주셔서 제가 더 감사하죠.”<br/>
            <br/>
            내 말을 들은 그녀는 미소를 머금었다. 하지만 눈에 비추는 슬픔까지 숨기진 못했다. 처음 이 피고인과 면담했을 때보단 더 안정된 모습이었지만, 훨씬 수척해져 보였다. 내가 동생을 잃었을 때 저런 표정을 지었을까.<br/>
            “변호사님 있잖아요. 사실 승소가 제게 그렇게 중요한 건 아녔어요. 당장 죽을 것 같아서 매달려 본 거예요. 그렇게 안하면 내가 죽을 거 같아서요.”<br/>
            그녀의 말에 나는 아무 대답도 하지 않았다.<br/>
            “재판이 다 끝나니까. 오히려 더 허망하네요. 이제 제가 할 수 있는 게 아무것도 없잖아요. 이제 저 어떻게 살아야 하는 건가요. 밥은 어떻게 먹고 잠은 어떻게 자야하나요.<br/>
            집에 들어가면, 아기용품들이 보여요. 그게 그렇게 잔인해 보여요.” “제가 괜한 넋두리만 늘어놓고 있네요. 죄송해요”<br/>
            “아닙니다. 그 마음 이해합니다.”<br/>
            그녀는 몇 번이고 감사하다는 말을 끝으로 면담실을 떠났다.<br/>
            피고인이 나가고 나서 나는 10 년 전부터 가져왔던 그 질문을 다시 꺼내 들었다.<br/>
            구원이란 무엇인가.<br/>
            동생을 잃었을 때, 그 살인자가 마땅한 처벌을 받았다면 난 내 한이 풀릴 수 있다고 생각했다. 안식할 수 있을 거라고, 신부님과 수녀님의 기도는 그때의 내게 아무런 도움이 되지 않는다고 믿었기에 성직자의 길을 내팽개치고 변호사가 된 거였다. 그게 구원에 더 가까운 일이라고 믿어 의심치 않았기에.<br/>
            하지만 피고인을 만나고 많은 생각이 들었다. 그때 동생을 죽인 살인마가 높은 형량을 받았더라면, 유능한 변호사가 내 곁에 있었더라면, 난 슬픔을 이겨낼 수 있었을까.<br/>
            사람은 결코 사람을 구원할 수 없다.<br/>
            늦은 밤까지 사무실에 있던 나는 새벽이 되어서야 거리로 나왔다. 나는 정처 없이 걸었다. 발길이 닿는 곳으로 걷고 또 걸었다.<br/>
            그 여자는 오늘도 집에서 편히 자지 못하겠지. 뜬눈으로 밤을 새우고 동이 트는 걸 바라보겠지.<br/>
            <br/>
            얼마나 걸었을까, 회사와 꽤 떨어진 동네에서 멈춰 섰다. 아직 하늘은 어두웠다. 난 다시 돌아갈 방도를 생각하다 길 맞은편에서 환하게 빛나고 있는 성모 마리아 상을 바라봤다. 그 품이 어찌나 따스해 보이던지, 얼굴 한번 본적 없는 어머니의 품이 그리워졌다. 나는 성당 안으로 들어갔다.<br/>
            큰 나무문이 아무 소리도 없이 열렸다. 8 년 만에 오는 성당이었다. 성당에서 나는 특유의 냄새가 내 어릴 적 기억을 상기시켰다. 성당의 앞쪽엔 십자가에 매달린 예수의 조각상이 걸려있었다. 난 그 앞에가 무릎을 꿇었다. 예수의 얼굴은 짙은 어둠에 가려져 보이지 않았지만 조각상에서 느껴지는 경건함에 나는 고개를 숙였다.<br/>
            “왜 인간을 고통 받아야 합니까.”<br/>
            “왜 우리는 구원 할 수도 받을 수도 없는 겁니까.”<br/>
            나는 답도 없는 조각 앞에서 몇 번이고 질문을 던졌다.<br/>
            몇 시간 동안 혼자 풀 수 없는 문제를 고심하던 나는 내 풀에 지쳐서 찬 바닥에 드러누웠다. 조각상 뒤로 난 스테인드글라스로 옅은 새벽빛이 스며들어왔다.<br/>
            ‘벌써 해가 뜨는구나. 나가야 하는데...’<br/>
            하지만 스테인드글라스를 투영해 오는 빛은 찬란하고 고요했으며, 난 간만에 느끼는 평화로움 속에서 쏟아지는 잠을 참을 수 없었다.<br/>
            잠깐만, 아주 잠깐만 눈을 붙이자...<br/>
            나는 스르륵 잠에 들었다.<br/>
            <br/>
          <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal12",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title12.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title12_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
