<template>
    <div class="content-modal" :class="{ on: showContentsModal === true }">
        <div class="content-character-box v24">
            <div class="main-character">
                <h3 class="main-character-title">
                    <img :src="titleUrl" class="pc-only">
                    <img :src="titleUrlMo" class="mobile-only">
                </h3>
                <p class="main-character-text">
                    뒷골목을 무대로 자유롭게 노래하는 낭만 기타리스트 '김나비'
                </p>
                <p class="main-character-text2">
                    "꿈을 잃어버린 사람들에게<br/>희망을 전달하고 싶다!"
                </p>
                <ul class="main-character-info">
                    <li>
                        <div class="title">나이</div>
                        <div class="text">2세</div>
                    </li>
                    <li>
                        <div class="title">키</div>
                        <div class="text">100cm</div>
                    </li>
                    <li>
                        <div class="title">성격</div>
                        <div class="text">#감성적#생계형필살애교#힙합</div>
                    </li>
                    <li>
                        <div class="title">취미</div>
                        <div class="text">홍대버스킹</div>
                    </li>
                    <li>
                        <div class="title">스킬</div>
                        <div class="text">냥냥펀치와 꾹꾹이로 마음을 녹임</div>
                    </li>
                </ul>
                <button type="button" class="btn-related" @click="showRelated = true">
                    관련작품 보기
                </button>
            </div>
        </div>
        <div class="related-layer" :class="{ on: showRelated === true }">
            <h3 class="title"> 김나비 이야기</h3>
            윤기 나는 회색 털을 가진 쇼리는 오늘 주인이 참 이상하다고 생각하며 조수석의 박스 속에 앉아 있었다. 귀찮을 정도로 뽀뽀를 하지도 않았고, 고음으로 귀엽다는 말도 하지 않았다. 쇼 리는 그런 선아의 모습이 싫을 때도 많았지만 막상 그녀가 변하니 서운한 마음도 들었다.<br/>
            선아는 노래도 틀지 않고 조용히 운전을 하고 있었고, 쇼리가 담긴 박스 속엔 사료와 좋아하 는 인형 몇 개가 들어있었다.<br/>
            쇼리는 병원에 가는 게 아닐까, 걱정이 들었지만 열린 창문으로 들어오는 옅은 풀 향기에 안 심했다.<br/>
            ‘아 우리는 여행을 가는 거구나!’<br/>
            쇼리는 그렇게 결론을 내리고 자동차의 진동을 느끼며 그르릉 거렸다.<br/>
            한참을 달린 선아는 인적이 드문 산기슭에 차를 세웠다. 선아는 쇼리가 앉아있는 박스를 갓길 에 내려놓고는 주변을 두리번거리다 다시 차에 올라탔다. 마냥 들떠 있던 쇼리는 선아가 차에 올라타자 이상함을 느끼고 박스에서 뛰쳐나왔다.<br/>
            -선아! 날 두고 어딜 가는 거야! “야아아옹! 야옹!”<br/>
            쇼리는 최선을 다해 선아를 불렀지만 야옹거리는 고양이의 울음소리 밖에 나지 않았다. 작은 몸을 세워 차 문을 긁는 쇼리를 본 선아는 미간을 찡그리며 창문을 내리고 말했다.<br/>
            앉아. 기다려.<br/>
            그녀의 목소리는 지나간 겨울만큼이나 차가웠다. 단 두 마디를 던져두곤 선아는 떠났다.<br/>
            처음 보는 표정이었다. 쇼리는 선아를 잘 알고 있다고 자부했는데, 그 순간만큼은 그녀의 마 음을 알 수 없었다.<br/>
            새로운 냄새도, 바스락 거리는 낙엽도, 자라나는 풀잎에 맺힌 이슬도 더 이상 호기심 많은 고 양이 쇼리의 마음을 흔들지 못했다. 지금 이 순간 쇼리에게 어떤 것도 중요하지 않았다.<br/>
            ‘선아... 앞으로 부르면 바로 달려갈게... 밥투정도 안하고 토도 안할게. 그러니까...’ “날 데리러 와줘”<br/>
            그렇게 일주일이 지났다.<br/>
            <br/>
            쇼리는 여전히 그 자리를 지키고 있었다. 선아가 두고 간 인형에서 나는 그녀의 향기가 점점 옅어지고 있었다.<br/>
            -미련한 자식, 그 자리가 무덤이 되길 바라는 건가?<br/>
            뒤로 우거진 숲에서 낮은 목소리가 들려왔다. 그 곳엔 며칠 전부터 주위를 맴돌던 노란빛의 들개가 앉아있었다.<br/>
            “캬아아아옹” -가까이 오기만 해봐<br/>
            쇼리는 털을 바짝 세우고 그를 경계했지만 들개 똘복은 어떤 공격의 의사도 없다는 제스처를 취하며 천천히 쇼리에게 다가왔다. 그리고 갓 잡은 참새 한 마리를 툭하고 내려놨다.<br/>
            -먹어, 죽고 싶은 게 아니라면. 그리고 따라와. 물이 있는 곳을 알려주지<br/>
            -됐어. 곧 내 주인이 올 거야. 그럼 집에 가서 맛있는 밥도 먹고 푹신한 침대에서 잠도 잘 수 있어.<br/>
            -우습군, 네 주인은 오지 않아. 네 주인은....<br/>
            똘복은 말하기를 멈췄다. 마냥 새침해보이던 회색 털의 고양이 눈에 맺힌 눈물을 봤기 때문일 테다. 똘복은 이 아이의 희망을 짓밟을 자신이 없었기에 거짓말을 하기로 결심했다. 그게 이 아이에게 독이 되더라도.<br/>
            -네 주인이 네가 있는 곳을 까먹은 것 같다. 여긴 길이 복잡하니까. -뭐? 그럼 어떡하지?<br/>
            -어떡하긴, 네가 주인을 찾아 가는 수밖에 없어. 여긴 네가 있기에 너무 위험해. 큰 길을 따 라 가다보면 도시가 나올 거야. 네 주인은 아마 거기에 있을 거야.<br/>
            -정말? 거기서 선아를 찾을 수 있을까?<br/>
            -그래, 찾을게다. 대신 출발하기 전에 든든히 먹고 가. 긴 여정이 될 테니까.<br/>
            근처 개 농장에서 탈출해 산전수전 다 겪으며 살아남은 똘복이 보기에 온실 속 화초처럼 자란 이 작은 고양이는 이곳에서 살기에 부적합했다. 오히려 짐만 될 뿐이었다.<br/>
            ‘그깟 인간들이 뭐가 좋다고 그러는지’<br/>
            <br/>
            똘복은 쇼리가 한심해 보였지만 차마 두고만 볼 수 없었다. 그 고양이가 자신과 같은 불행을 겪지 않았으면 하는 마음이었다.<br/>
            -따라와 물이 있는 곳으로 가자 쇼리는 쫄래쫄래 똘복의 뒤를 따랐다.<br/>
            똘복의 말처럼 여정은 길고 험난했다.<br/>
            나흘을 부지런히 걸어서야 도시에 도착한 쇼리는 똘복의 말을 떠올리곤 곧장 공원을 찾아갔 다.<br/>
            -도시에 도착하면 곧장 공원으로 가. 그곳이 제일 안전할 거야. 그리고 거긴 사람들이 많이 오니까 네 주인을 찾을 확률도 높지.<br/>
            쇼리는 빌딩숲 사이를 헤매며 자연의 냄새가 흘러오는 방향을 따라갔다. 이윽고 잿빛도시 가 운데 푸른 숲을 찾아낼 수 있었다.<br/>
            공원은 다른 곳에 비하면 천국이었다. 생명을 위협하는 자동차도 없었고, 수풀 사이엔 물과 사료가 놓여있었다.<br/>
            허겁지겁 사료를 먹고 있을 때였다. 누군가 쇼리의 뒤통수를 후려쳤다. -어떤 놈이야!<br/>
            쇼리는 신경질 적으로 뒤돌아봤다. 그곳엔 볼 털이 빵빵한 고양이 한 마리가 쇼리를 노려보고 있었다.<br/>
            -꺼져 여긴 내구역이야.<br/>
            정말 개념이라곤 눈곱만치도 없는 고양이었다. 첫 만남에 뒤통수를 친 걸로도 모자라 욕을 지 껄이다니!<br/>
            ‘스트릿 출신 고양이들은 다 이런 건가.’<br/>
            쇼리는 얼른 선아를 찾아 보금자리로 돌아가고 싶었다.<br/>
            하악질을 해대는 쇼리를 위 아래로 훑어본 볼이 빵빵한 고양이 나비는 조소를 지으며 키득거 렸다.<br/>
            -딱 보니 알겠네. 너 주인 찾으러 왔지? 널 버린 주인 말이야<br/>
            <br/>
            -뭐? 선아 찾으러 온 건 맞는데 선아는 날 버린 게 아니야! 단지 날 데리러 오는 길을 까먹은 거라고!<br/>
            -네가 절대 찾아오지 못하게 멀리까지 가서 버린 거겠지. 너도 알고 있잖아. 널 두고 떠나는 주인의 표정을 봤을 텐데.<br/>
            -아냐! 아니라고!<br/>
            쇼리는 그대로 자리를 박차고 떠났다.<br/>
            -쯧, 한심하긴.<br/>
            나비는 앞발을 그루밍하며 읊조렸다.<br/>
            쇼리는 높은 나무 위에서 눈물을 훔치고 있었다.<br/>
            ‘아니야. 선아는 날 버릴 사람이 아니라고... 매일 사랑한다고 말해 줬었잖아.’<br/>
            별도 달도 뜨지 않은 어두운 밤이었다. 공원엔 처량한 울음소리만이 울려 퍼졌다. 미야아아아오....미야아아아옹<br/>
            이른 새벽이 되도록 쇼리는 울음을 멈출 수 없었다. 선아의 부드러운 긴 머리카락과 현란하게 장난감을 움직이던 손, 그리고 다정한 목소리가 머릿속을 헤집고 다녔기 때문이다.<br/>
            퍽!퍽!퍽<br/>
            그때 뒤에서 작은 솜방망이가 튀어나와 쇼리의 머리통은 연속해서 세 번이나 내리쳤다. -조용히! 조용히 좀 해! 여기 너 혼자 살아? 이래서 집고양이들이란<br/>
            어제 만났던 볼이 빵빵한 고양이었다.<br/>
            -따라와. 언제까지 이러고 있을 거야? 네가 밥 먹을 곳을 알려주지<br/>
            -됐어. 난 곧 집에 갈 거야!<br/>
            꼬르륵...<br/>
            새침한 쇼리의 말과는 다르게 위장은 요동쳤다.<br/>
            <br/>
            -여기서 자존심 부린다고 득 될 거 없어<br/>
            쇼리는 결국 배고픔에 굴복하고 스트릿 고양이의 뒤를 따라갔다.<br/>
            쇼리가 따란 간 곳은 수풀 사이의 둥근 공간이었다. 아마 이곳을 아지트로 사용하는 것 같았 다. 그곳엔 다섯 마리의 고양이가 더 있었다.<br/>
            -나는 나비야. 그리고 여기 있는 모두가 나비지<br/>
            처음 만났던 볼 털이 포실한 나비가 말했다.<br/>
            -이젠 너도 나비야. 여기 사는 고양이들은 다 그렇게 불리니까.<br/>
            -왜? 난 쇼리라는 이름이 있다구<br/>
            -이제 그 이름은 버려. 갖고 있으면 너만 괴로워 질 뿐이야.<br/>
            ‘쳇 뭐든 지 맘대로야’<br/>
            쇼리는 불만이 한 가득이었지만 식량을 얻어내기 위해 대충 그들의 말을 따르는 척했다.<br/>
            -이곳에서 지내기 위한 규칙은 딱 두 가지야 첫 번째, 서로 싸우지 않는다.<br/>
            두 번째, 인간을 사랑하지 않는다.<br/>
            그렇게 말하는 나비는 덤덤한 표정이었지만 왠지 그 속에 아픔을 숨기고 있는 것처럼 보였다.<br/>
            쇼리의 안내를 마치고 돌아온 볼이 빵빵한 나비는 전용 나무 위에 올라가 휴식을 취하고 있었 다. 머리부터 발끝까지 그루밍을 하던 나비는 주변을 두리번거리며 다른 고양이들이 없는지 확인했다. 그리곤 나무의 수풀사이를 헤집고 들어갔다.<br/>
            ‘사라진 건 아니겠지.’ - 여기 있다.<br/>
            나비가 찾은 건 하트모양 펜던트가 달린 체인 목걸이였다. 펜던트엔 ‘루이’라는 각인이 새겨져 있었다.<br/>
            - 루이<br/>
            <br/>
            나비는 자신의 과거 이름을 한번 읊조렸다. 아주 나지막한 소리였다.<br/>
            ***<br/>
            쇼리가 이곳에 온지 한 달이 지났다. 쇼리는 공원에서의 나날이 생각보다 평화롭다고 느꼈다. 누군가 매일 아침 두고 가는 사료를 먹었고, 대부분의 시간은 풀로 장난을 치거나 새를 사냥 하며 보냈다. 하지만 쇼리의 마음 한 구석엔 선아를 향한 그리움은 건재했다.<br/>
            다른 고양이들은 그를 나비라고 불렀지만, 그 스스로는 자신을 쇼리라고 칭했다.<br/>
            ‘이 이름은 절대 안 버려. 선아가 준 이름인데 어떻게 버려!’<br/>
            해가 저물어가는 5월의 저녁이었다. 나무 위에서 붉은 노을을 감상하고 있는데 익숙한 목소리 가 들려왔다.<br/>
            “미니! 이리와!”<br/>
            쇼리는 온 몸의 털이 찌르르 서는 걸 느꼈다. 매일같이 기다리던 선아의 목소리였으니까. ‘선아가 날 데리러 온 건가?. 어쩌면 선아도 날 찾아다녔을지도 몰라. 만나면 무슨 말을 하 지? 선아도 날 그리워했을까?’<br/>
            쇼리는 더 이상 생각하기를 멈추고 내달렸다.<br/>
            사람들의 다리 사이를 요리조리 피하며 도착한 곳엔 익숙한 뒷모습이 있었다. 쇼리는 노을에 붉게 빛나는 선아의 머리카락을 바라보며 천천히 그녀에게로 다가갔다.<br/>
            하지만 얼마 안가 쇼리는 멈출 수밖에 없었다.<br/>
            선아의 품엔 작고 하얀 말티즈가 안겨 있었고. 선아는 그 작은 존재를 사랑스러운 눈빛으로 보고 있었으니까.<br/>
            ‘아, 그렇구나. 나는 버려진 거구나.’<br/>
            쇼리는 그동안 외면해 왔던 진실과 마주했다.<br/>


            <button type="button" class="modal-close" @click="showRelated = false">
                <span class="blind">닫기</span>
            </button>
        </div>
        <button
            type="button"
            class="modal-close"
            @click="$emit('update:visible', !showContentsModal)"
        >
            <span class="blind">닫기</span>
        </button>
    </div>
</template>

<script>
import {reactive, toRefs} from "vue";

export default {
    name: "CharacterModal24",
    emits: ["update:visible"],
    props: {
        showContentsModal: {
            type: Boolean,
            default: false,
        },
        title: {
            type: String,
            default: "",
        },
    },
    data() {
        return {
            showRelated: false,
        };
    },
    setup() {
        const state = reactive({
            titleUrl: require("@/assets/image/region1/bg_char_title24.png"),
            titleUrlMo: require("@/assets/image/region1/bg_char_title24_mo.png"),
        });
        return {
            ...toRefs(state),
        };
    },
};
</script>

<style scoped></style>
