<template>
  <div class="content-modal" :class="{ on: showContentsModal === true }">
    <h2 class="content-modal-title">{{ title }}</h2>
    <div class="content-modal-box">
      <div class="content-modal-bg">
        <h3 class="title">{{ title }}</h3>
        <div class="content-modal-text">
          금발의 이국적인 외모를 한 남자는 한 병원의 로비에 설치된 대형 거울앞에
          서있다. 거울 너머로 지나다니는 사람들은 그저 바쁘게 자기 갈 길을 가고
          있다. 가끔씩 지나가다 외국인 처럼 생긴 외모 때문인지 힐끗힐끗
          바라보지만 이내 다시 제 갈길을 바삐 지나갔다. 금발의 남자가 거울에
          손을 대자 갑자기 거울에 한 화면이 나타났다. 몹시 신기할 법 하지만 다른
          사람들은 보이지 않는지 그저 자신들이 갈 길을 갈 뿐이다. “이번 임무는
          어디보자.. 임태수 35세..이 병원인가?” . . . . 치유병원의 원무과 태수는
          오늘따라 유독 피곤했다. 양쪽 날개뼈 안쪽 능형근이 욱신거려서 계속
          스트레칭을 해도 소용없었다. 원무과에서 근무 중인 태수는 늘 아픈
          사람으로 북적인 곳에서 있다보니 멀쩡한 사람은 병원 직원들뿐인데,
          우리도 사람 인지라 늘 주변의 영향을 받는다. 몸은 멀쩡해도 어깨는
          환자처럼 축 늘어진다. 그래. 그래서 이토록 까닭없이 날개뼈가 아픈
          모양이다. “21􏰀 환자분, 엑스레이 먼저 찍으실게요.” 평소처럼 안내를
          해주다가, 문득 착 가라앉은 목소리가 낯설었다. 병원 손님에게 얼핏 화가
          난 것처럼 들릴 것 같아서, 뒤이어 해야 할 말은 일부러 밝은 톤으 로
          꾸몄다. “1번 탈의실에서 옷 갈아입으시고 복도에 앉아 대기해주세요.”
          금발의 남자가 태수의 축 늘어진 모습이 걱정되었는지, 물어왔다. “어디
          아파요?” “아뇨. 그런 게 아니에요. 걱정해주셔서 감사합니다.” “어제 뭘
          했길래 그리 피곤해보여요?” 태수는 속으로 ‘외국인인가? 한국사람들은
          이런거 묻지 않을텐데…그런데 무슨 한국말을 나보다 잘하는거 같네’ “어제
          방 청소를 좀 했어요. 이것저것 옮기기도 했는데, 소파 밑에서 옛날 일기장
          모아둔 상 자를 발견했지 뭐예요?” “오, 그랬어요? 그래서 그거 읽다가
          늦게 잤구나.” “음…. 늦게 자지는 않았어요. 아마 무거운 걸 옮겨서 좀
          피곤한 걸 수도 있겠네요. 그런데 일기장을 봐서 그런지 어린시절 꿈을
          꿈속에서 꾼거 있죠?” “그 꿈, 살짝만 들려줄 수 있어요? 실례가 되면
          말구요.” “별거 없었어요. 누구나 다 꾸는 꿈처럼 평범하고
          허무맹랑했거든요. 다만 그걸 읽다보니 제 가 잊고 있던 옛날 생각도 나고
          좋더라고요.” 나는 그리 대답하며 다음 손님을 받으려고 카운팅 프로그램
          버튼에 커서를 올렸다. 내 행동을 물끄러미 바라보던 금발의 남자가
          은근슬쩍 속삭이며 탈의실로 사라져갔다. “오늘은 좋은 꿈을 꿀 거예요.”
          “네, 고마워요.” 여기까지는 별 게 없었다. 깊게 생각할 필요조차 없는
          흔하고 따뜻한 말 한마디에 불과한 그 인사가 이상하다는 걸 깨달 은 건
          퇴근 후 밤이 되어서였다. 고된 하루를 보내고 피곤한 와중에도 간신히
          마지막 의지를 끌어모아 구석구석 깨끗이 씻고, 머리에 묻은 물기가 채
          가시기도 전에 누워버린 나는 그대로 잠이 들었다. 그리고 꿈을 꿨다.
          ‘이게 뭐야…?’ 이번 꿈은 이전의 꿈들과는 너무나도 명확하게 달랐다.
          보통의 꿈을 꾼다면 자연스럽게 행동하며 내가 꿈꾸는 줄도 몰랐을 것이다.
          하지만 내 눈 앞에 펼쳐진 거대한 우주를 보는 지금의 나는 분명히 내가
          꿈을 꾸도 있다는 것 을 인지하고 있었다. 보랏빛, 분홍빛, 무지개빛,
          반짝이는 금은빛으로 수놓아진 이색적인 식물, 그리고 웅장하게 솟 은 낯선
          구조물들이 생생했다. 떨리는 손으로 식물을 만져보니, 따뜻하고도 차가운
          촉감이 동 시에 느껴져서 신비로웠다. 그들 사이로 거대한 표지판이 허공에
          솟아 있었다. 《물아일체(物我一體)에 성공한 드리머님. 거대한 우주선
          아바드림호로의 로그인(Login)을 환영 합니다.》 《이곳에서 당신이 원하던
          모습으로 꿈을 이뤄보세요.》 ‘꿈을 이뤄? 로그인...?’ 이곳의 모든 것을
          생생하게 느낄 수 있었음에도, 나의 머리는 끝없이 이 비현실적인 공간을
          부인했다. 하지만 모든 게 존재하고 있었다. 무엇보다…. 내 어깨의 통증도
          여전했다. 좀 더 무겁기까지 했다. 양손을 뒤로 뻗어 어깨죽지를 만져보니,
          놀랍게도 질긴 산줄과 좌석 하네스, 그리고 캐노피가 연결되어 있었다.
          “…패러글라이딩 복장이잖아? 이런 게 달려있으니 가뜩이나 아프던 어깨가
          더 무겁지….” 나는 당황스럽게 중얼거렸다. 그렇게 말하다가, 채 말 한마디
          다 뱉기도 전에 갑자기 울컥 차오른 감정을 참아야 했다. 먼 옛날의 내가
          바라던 내 모습이 아니었던가. 『나는 패러글라이딩 선수가 될 거야!』
          『하늘을 날고 바람이랑 놀거야. 그 어떤 강풍이 불어도 꿋꿋하게
          목적지까지 도착하고 싶어.』 어제 밤늦도록 심취해 읽었던 내 옛날
          일기장. 그 속에는 온통 패러글라이딩 선수를 꿈꿨던 어린 날의 내 희망이
          잠들어 있었다. ‘어쩌면 내가 옛날 꿈을 다시 생각했기 때문에 그렇게
          어깨가 아팠던 걸까. 패러글라이딩은 날개뼈 쪽을 주로 사용하니까.’ 문득
          저 위에서 뭔가가 반짝였다. 이곳은 거대한 우주선이라고 했는데, 어째서
          천장 대신 넓게 펼쳐진 우주와 작은 행성이 모형 처럼 보여지는 걸까? 그
          모습이 신기해서 ‘저걸 직접 가까이에서 보고 싶다’고 생각한 순간. 나는
          발로 바닥을 박차고 위로 올라갔다. 놀랍게도 나는 중력을 무시하고 위로
          한없이 날아갔고, 그 작은 행성들이 유유자적 떠다니며 금빛 가루를 뿌리는
          모습을 허공에서 감상했다. 내 어깨에 매어져 있던 캐노피가 저절로 빵처럼
          둥글게 부풀어 올랐다. 나는 드디어 이 모든 것들의 전말을 깨달을 수
          있었다. 어젯밤 옛 일기를 읽으면서 ‘어린 시절로 돌아가 다시 시작하고
          싶다’고 간절하게 희망했다. 목욕을 통해 몸을 정갈히 했고, 내일도 지속될
          평소의 생활이 달라지길 진심을 다해 바랬다. 돌이킬 수 없는 과거와, 있을
          수 없는 변화를 바라는 그 일련의 감정과 의식이 나를 이곳으로 불러온
          암호가 아니었을까? 금발의 남자가 한말이 떠올랐다. - 오늘은 좋은 꿈을
          꿀 거예요. 태수는 ‘정말로 좋은 꿈을 꿨네요.’라고 속으로 대답을 했다.
          웃으면서 아바드림호 곳곳을 누볐다. 나는 내 스스로 놀랄 정도로 최고의
          패러글라이딩 기술을 선보였다. 바람을 내 뜻대로 갈랐고, 설령 바람이
          없었더라도 끌어모아 만들 수 있었다. 최고의 기술과 더불어 초능력까지
          생긴 듯하다. 그렇게 놀고 있자니, 어느 틈에 나와 비슷하게 이
          아바드림호에서의 시간을 즐기고 있는 사람 들이 보였다. 나는 그들 무리
          쪽으로 날아갔다. 그들 중 하나가 중앙에 밝게 빛나는 곳을 가리켰다.
          “저쪽에 무대도 있어요. 한번 같이 가볼래요?” 이런 특별한 공간에서 할 수
          있는 경험은 최대한 해볼 작정이었다. 나는 순순히 그 사람들과 함께 무대
          위로 올라갔다. 무대는 크고 웅장한 구조물로 이뤄진 오픈형 구조였다. 그
          주변부로, 낯선 복장을 한 이들이 빙 둘러 앉아 있었다. 나는 이들이
          본래부터 이곳에 있어왔던 탑승객이자, 다른 차원 너머에서 온 존재임을
          깨달았 다. 그들은 노래했다. 가릉빈가(迦陵頻伽)나 세이렌의 목소리처럼
          알 수 없는 힘으로 나를 감격시키는 환상적인 음 색이었다. 나도 홀린 듯
          노래했고, 나와 함께 갔던 모든 이들도 저마다 바래왔을 모습으로 변해
          노래하고 있었다. 어제 얼마나 내가 일기장을 보며 울었는지, 지금 내
          어깨에 매어진 캐노피의 무게가 얼마나 기꺼운지 설명할 길은 이 노래밖에
          없을 것 같다는 느낌이 들었다. 다시는 이런 간절한 마음으로 진심을 다해
          노래할 수 없을 것도 같았다. 주변의 모두가 그런 마음인 듯, 누군가는
          노래를 부르며 눈물 흘리기도 했다. 마침내 마지막 순번을 맡은 이의
          노래가 끝나자, 어느덧 자연스레 우리를 심사하던 다른 차원 의 존재들이
          말했다. “가장 간절하게 노래했던 쪼꼬미 님을 꿈의 행성 아바성으로
          보내드리겠습니다. 그곳에서 다른 AVA들과 함께 우리가 꿈꾸던 멋진
          영웅으로 거듭나주세요.” 최선을 다해 노래하던 몇몇이 실망했다. 나 역시
          아바성이라는 곳에 가고싶다는 깊은 욕망이 생겼다. 오늘 처음으로
          경험해본 패러글라이더로서의 나는 매우 힘찼고, 바람을 두려워하지
          않았으며, 내가 꿈꾸던 모든 멋진 풍경을 허공에서 내려보지 않았던가. 이
          아바드림호라는 곳에서도 이 정도인데 아바성이라는 곳은 더욱 멋진 나를
          경험할 수 있을 게 분명했다. ‘최고의 패러글라이더가 되고 싶어. 지금을
          뛰어넘어서.’ 내 욕망이 느껴진 것일까. 그들이 인자한 미소를 지으며 다시
          말을 이었다. “경합은 끝난 것이 아닙니다. 오늘 이곳에 오신 아바드림호의
          승객 여러분. 지금의 간절함을 기억해주세요. 지구로 돌아가셔서도
          여러분의 멋진 활약이 빛을 발해 다시 뵐 수 있길 기원합 니다.” 그들이
          일어나 우리를 향해 박수를 치며 환호했다. 마침내 그들의 환호가 끝나는
          순간. “…….” 나는 서서히 내 침대에서 눈을 떴다. 조금 전까지 생생히
          느꼈던 전율과 자유로움이 사라지고, 움츠러든 모양새로 굳은 내 어깨와
          작은 체구가 답답했다. 나는 평소처럼 이를 닦고 정갈히 단장한 채
          병원으로 출근했다. 하지만 어제의 출근길과는 확연히 다른 경쾌한
          걸음새였다. 여느 때처럼 병원 원무과에 앉아 업무를 보면서도, 나는
          어제의 힘차고 멋지던 나를 기억했다. 일부러 찰나의 여유를 내어
          패러글라이딩 동호회를 검색하고 장비를 알아보는 손놀림이 경쾌했다.
          ‘이번 주말에는 양평에 가봐야겠다. 패러글라이딩 장비 대여업체에서
          가벼운 거라도 빌려서 입문해야겠어.’ 저절로 미소가 지어졌다. 누군가 툭-
          툭- 데스크를 두드렸다. 그 금발의 손님이었다. “간 밤에 좋은 일이
          있었나봐요? 밝은 표정이 참 보기 좋아요.” “어제 덕분에 좋은 꿈을 꾼거
          같아요. 제가 어제 어떤 꿈을 꾸었냐면,,” “쉿! 꿈은 입밖으로 내는순간
          사라진다자나요. 혼자만 잘 간직하고 계셔봐요” 데스크 너머로 웃는 얼굴이
          보였다. 우연인지 모르겠지만, 왠지 내 속을 읽기라도 한 듯 흡족해보였다.
          . . . . . 금발의 남자는 병원을 나서 엘레베이터에 올라타 주머니에 있던
          작은 거울을 꺼내 거울을 바라보며 말했다. “한 명 또 성공했습니다.
          페르소나별의 페르소나 하나가 곧 아바로 거듭나겠군요.” 그 거울 속의
          모습은 금발의 남자를 비추는 것이 아닌 사람형상의 밝은 빛이 하나
          떠있었다. 금발의 남자는 솔라. 거울 너머의 사람형상의 밝은 빛은
          아바행성의 솔이라는 영혼관리자다. 금발의 솔라는 솔의 첫번째 분신이자
          또 다른 인격이였다. 솔라가 지구에 내려온 이유는 사람들이 간절히
          무엇인가를 바라던 꿈의 모습을 아바드림호로 소환하고, 그곳에서 소원을
          일시적으로나마 이뤄 꿈을 되살려내는 게 임무였다. 그렇게 되살린 꿈을
          유지하는 건 오로지 꿈꾸는 사람의 몫이다. 그가 살아온 우주는 이런
          꿈들로 인해 유지되고 생성되었다. 간절히 어떠한 형상을 바라고 상상하는
          인간의 정신활동이 우주를 만들어내는 것이다. 거울 너머의 사람형태의
          빛인 솔 은 말했다. “다음은 여의도 편의점에서 일하는 은지씨를
          찾아가시면 되요. 잠도 제대로 못자면서 일을 하고 있는데 쉽진않을꺼에요.
          잠이라도 자야 우리 세계로 초대를 할텐데…” 말 끝을 흐리며 염려를 담은
          목소리가 넘어왔다. “저희세계가 꼭 잠을 푹자야 갈수 있는건 아니잖아요.
          요번에는 잠깐의 찰나의 순간에 느낄 수 있도록 계획을 세워볼께요.”
          금발의 솔라는 거울 조각을 주머니로 넣었다. “편의점 알바생이니까….
          이번엔 나도 알바로 들어가서 접근해야 하나?” 솔라는 엘리베이터의 거울을
          보며 날카로운 눈빛으로 비장한 표정을 지었다. 그런데 거울 너머의 자신의
          모습은 기쁜듯 웃고 있었다. 엘리베이터가 1층에 멈춰선 순간 . . .
          어제부터 허리가 아파 치유병원에 방문 한 은지는 5층 정형외과로 가기
          위해 엘리베이터를 기다리고 있다. 은지는 틈만나면 핸드폰으로 구직
          사이트를 뒤지고 있었다. “이젠 알바 말고 취업하고 싶다…” -띵동
          1층입니다. 엘리베이터가 이내 1층에 도착하고 문이 열리자 은지는 잠시
          고개를 들어 내리는 자기또래의 짧은 검은 머리의 남자와 눈을 잠깐
          마주치지만 이내 무관심 한듯 엘리베이터에 올라타 5층의 버튼을 누르고
          이내 다시 핸드폰으로 시선을 빼앗긴다. 은지는 알아채지 못하지만 닫히는
          엘레베이터 문사이 너머로 짧은 머리의 남자는 뒤돌아 미소진다.
        </div>
      </div>
    </div>
    <button
      type="button"
      class="modal-close"
      @click="$emit('update:visible', !showContentsModal)"
    >
      <span class="blind">닫기</span>
    </button>
  </div>
</template>

<script>
export default {
  name: "ContentsModal",
  emits: ["update:visible"],
  props: {
    showContentsModal: {
      type: Boolean,
      default: false,
    },
    title: {
      type: String,
      default: "",
    },
    content: {
      type: String,
      default: "",
    },
  },
};
</script>

<style scoped>
.content-modal-bg {
  background: #000 url("@/assets/image/region1/bg_ava_book.png") repeat center top;
    background-size: cover;
}
</style>
