<template>
    <footer class="footer">
        <div class="footer-left">
            <svg data-name="그룹 5958" xmlns="http://www.w3.org/2000/svg" width="184.919" height="33.869" viewBox="0 0 184.919 33.869">
                <defs>
                    <clipPath id="6r95azsuya">
                        <path data-name="사각형 835" style="fill:none" d="M0 0h184.919v33.869H0z"/>
                    </clipPath>
                </defs>
                <g data-name="그룹 1757" style="clip-path:url(#6r95azsuya)">
                    <path data-name="패스 1108" d="M14.667 0 0 8.467V25.4l14.666 8.467L29.332 25.4V8.467zm11.978 16.948V17.247a5.886 5.886 0 0 1-.524 2.162 5.349 5.349 0 0 1-4.935 3.255h-.491a5.183 5.183 0 0 1-2.048-.406 7.021 7.021 0 0 1-3.97-4.058 7.022 7.022 0 0 1-3.97 4.058 5.185 5.185 0 0 1-2.049.406h-.502a5.349 5.349 0 0 1-4.934-3.255 5.882 5.882 0 0 1-.522-2.163v-.624a5.881 5.881 0 0 1 .525-2.162 5.349 5.349 0 0 1 4.934-3.255h.491a5.188 5.188 0 0 1 2.049.406 7.021 7.021 0 0 1 3.97 4.058 7.021 7.021 0 0 1 3.97-4.058 5.187 5.187 0 0 1 2.048-.406h.491a5.349 5.349 0 0 1 4.935 3.255 5.885 5.885 0 0 1 .524 2.162v.325" transform="translate(-.001)" style="fill:#fff"/>
                    <path data-name="패스 1109" d="m667.454 45.223 6.154 8.991v6.394h6.154v-6.394l6.154-8.991h-5.579l-3.652 5.335-3.652-5.335h-5.58" transform="translate(-531.055 -35.981)" style="fill:#fff"/>
                    <path data-name="패스 1110" d="m500.741 60.608-6.1-15.385h-7.8l-6.1 15.386h5.668l4.333-10.923 4.332 10.923h5.668" transform="translate(-382.497 -35.981)" style="fill:#fff"/>
                    <path data-name="패스 1111" d="M407.542 55.995v-10.77h-5.4V60.61H417l1.831-4.615z" transform="translate(-319.959 -35.983)" style="fill:#fff"/>
                    <path data-name="패스 1112" d="M202.968 48.3v9.231l3.152 3.077h15.587v-8.293h-4.688v3.678h-8.654v-6.154h13.342v-4.616H206.12z" transform="translate(-161.49 -35.981)" style="fill:#fff"/>
                    <path data-name="패스 1113" d="m305.555 45.223-6.1 15.386h5.668l4.332-10.923 4.333 10.923h5.668l-6.1-15.386z" transform="translate(-238.257 -35.981)" style="fill:#fff"/>
                    <path data-name="사각형 834" transform="translate(183.146 22.854)" style="fill:#fff" d="M0 0h1.773v1.773H0z"/>
                    <path data-name="패스 1114" d="M836.9 95.06v-2.674l-1.186-.889h-5.048v5.929h1.784v-1.672h1.582l1.223 1.672h1.945l-1.223-1.672zm-1.782-.895h-2.668v-1.186h2.668z" transform="translate(-660.913 -72.799)" style="fill:#fff"/>
                    <path data-name="패스 1115" d="M757.8 92.386v4.15l1.188.889h4.867v-1.548H759.9v-2.832h3.958V91.5h-4.867z" transform="translate(-602.937 -72.798)" style="fill:#fff"/>
                    <path data-name="패스 1116" d="M871.923 94.763v-2.377l-1.186-.889h-5.048v5.929h1.779v-1.773h3.27zm-1.788-.6h-2.668v-1.184h2.668z" transform="translate(-688.778 -72.799)" style="fill:#fff"/>
                    <path data-name="패스 1117" d="m792.556 91.5-1.293.889v4.15l1.293.889h4.524l1.292-.889v-4.15l-1.292-.889zm4.033 4.447h-3.542v-2.968h3.542z" transform="translate(-629.562 -72.799)" style="fill:#fff"/>
                    <path data-name="패스 1118" d="m591.212 52.653 5.867-7.428h-5.968l-2.883 3.65-2.883-3.65h-5.967l5.867 7.428-6.285 7.957h5.967l3.3-4.18 3.3 4.18h5.973z" transform="translate(-460.644 -35.983)" style="fill:#fff"/>
                </g>
            </svg>
            <ul>
                <li>
                    갤력시유니버스 최신뉴스 보기
                </li>
                <li>
                    갤럭시코퍼레이션 사이트 가기
                </li>
                <li>
                    개인정보처리방침
                </li>
            </ul>
            <p>
                Copyright ⓒ 2019 GALAXY.CORP. all rights reserved.<br class="mobile-only"> E-mail: contact@galaxy.ai
            </p>
        </div>
        <div class="footer-right">
            <svg xmlns="http://www.w3.org/2000/svg" width="30.262" height="34.943" viewBox="0 0 30.262 34.943">
                <path data-name="패스 1220" d="M.994 25.917V9.593l14.137-8.162 14.137 8.162v16.324l-14.137 8.162zM0 9.019v17.472l15.131 8.736 15.131-8.736V9.019L15.131.283z" transform="translate(0 -.284)" style="fill:#fff"/>
                <path data-name="패스 1221" d="M54.541 86.5c-1.647 0-3.295.007-4.942-.006a4.842 4.842 0 0 1-.99-.123 1.83 1.83 0 0 1-1.425-1.383 5.952 5.952 0 0 1-.228-1.472c-.039-.982-.081-1.965-.066-2.947.013-.807.094-1.614.175-2.418a3.1 3.1 0 0 1 .226-.793 1.8 1.8 0 0 1 1.569-1.179c.528-.065 1.063-.1 1.6-.11q2.4-.053 4.8-.074c.8-.006 1.593.013 2.389.042.768.028 1.537.064 2.3.132a1.9 1.9 0 0 1 1.773 1.508 6.719 6.719 0 0 1 .2 1.248 30.514 30.514 0 0 1 .068 3.654 10.642 10.642 0 0 1-.21 2.12 2.415 2.415 0 0 1-.5 1.107 2.025 2.025 0 0 1-1.454.663q-.466.028-.933.029h-4.355m-1.633-3.252 4.03-2.092-4.03-2.1z" transform="translate(-39.321 -63.781)" style="fill:#fff"/>
            </svg>
            <svg xmlns="http://www.w3.org/2000/svg" width="30.262" height="34.944" viewBox="0 0 30.262 34.944">
                <path data-name="패스 1224" d="m588.4 34.944-15.131-8.736V8.736L588.4 0l15.131 8.736v17.472zm-14.137-9.31L588.4 33.8l14.137-8.162V9.31L588.4 1.148 574.263 9.31z" transform="translate(-573.269)" style="fill:#fff"/>
                <path data-name="패스 1225" d="M632.026 78.634c-1.235 0-2.471.023-3.7-.006a3.13 3.13 0 0 1-3.015-3.122v-7.048a3.158 3.158 0 0 1 3.229-3.292q3.495-.029 6.989 0a3.174 3.174 0 0 1 3.249 3.309v6.964a3.149 3.149 0 0 1-2.378 3.093 3.97 3.97 0 0 1-.943.105c-1.142.012-2.283 0-3.425 0v-.009m4.3-6.724a4.295 4.295 0 1 0-8.59.008 4.295 4.295 0 0 0 8.59-.008m-.86-4.45a1 1 0 0 0 1.021 1.006 1.01 1.01 0 1 0-1.021-1.006" transform="translate(-616.909 -54.639)" style="fill:#fff"/>
                <path data-name="패스 1226" d="M655.385 92.641a2.77 2.77 0 1 1-2.728-2.772 2.763 2.763 0 0 1 2.728 2.772" transform="translate(-637.49 -75.367)" style="fill:#fff"/>
            </svg>

        </div>
    </footer>
</template>

<script>
export default {
    name: "Footer"
}
</script>

<style scoped>

</style>
