<template>
  <div class="content-modal" :class="{ on: showContentsModal === true }">
    <h2 class="content-modal-title"> <router-link class="galaxy-header-logo" to="/">
      <svg
          xmlns="http://www.w3.org/2000/svg"
          width="119.717"
          height="59.828"
          viewBox="0 0 119.717 59.828"
      >
        <g
            id="갤럭시유니버스_로고"
            data-name="갤럭시유니버스 로고"
            transform="translate(-51.297 -47)"
        >
          <path
              id="패스_419"
              data-name="패스 419"
              d="M158.316,39.751l.025,5.758,0,.589-18.07.081.048,10.337,12.173-.056-.011-2.864-5.894.025-2.994.014-.022-4.607,2.994-.014,11.789-.053.036,7.474,0,.589.028,5.757-5.9.025-15.33.073-4.739-4.585-.064-13.817,4.7-4.627Z"
              transform="translate(-17.825 26.245)"
              fill="#fff"
          />
          <path
              id="패스_425"
              data-name="패스 425"
              d="M509.2,38.266l8.049-.036.073,16.441,9.2-.042-.076-16.441,8.041-.036.092,19.538L530,61.156l-16.091.076L509.291,57.8Z"
              transform="translate(-363.561 27.081)"
              fill="#fff"
          />
          <path
              id="패스_432"
              data-name="패스 432"
              d="M25.838,0,0,15.077.138,44.991,26.113,59.829,51.95,44.752l-.138-29.914ZM46.076,29.845c0,.06,0,.12,0,.181,0,.093,0,.186-.006.279,0,.014,0,.028,0,.042a10.069,10.069,0,0,1-1.811,5.306,9.3,9.3,0,0,1-1.736,1.865q-.248.2-.511.386a8.66,8.66,0,0,1-2.976,1.335,9.137,9.137,0,0,1-2.085.242l-.824,0a8.71,8.71,0,0,1-3.441-.665,9.775,9.775,0,0,1-2.958-1.657,10.935,10.935,0,0,1-1.267-1.221,13.291,13.291,0,0,1-1.138-1.489,18.243,18.243,0,0,1-1.332-2.413,18.154,18.154,0,0,1-1.309,2.425,13.345,13.345,0,0,1-1.124,1.5q-.2.227-.4.44a9.875,9.875,0,0,1-3.794,2.476,8.615,8.615,0,0,1-1.665.52,8.946,8.946,0,0,1-1.769.177l-.824,0a9.09,9.09,0,0,1-2.087-.223,8.652,8.652,0,0,1-2.988-1.307q-.265-.181-.515-.381a9.283,9.283,0,0,1-1.753-1.849,10.063,10.063,0,0,1-1.859-5.288c0-.014,0-.028,0-.042,0-.093-.006-.185-.008-.278,0-.061-.005-.12-.006-.181v-.044c0-.061,0-.12,0-.181,0-.093,0-.186.006-.279,0-.014,0-.028,0-.042a9.865,9.865,0,0,1,.863-3.632,9.468,9.468,0,0,1,3.195-3.924,8.654,8.654,0,0,1,2.329-1.155,9.01,9.01,0,0,1,2.733-.422l.824,0a8.932,8.932,0,0,1,1.771.161,8.6,8.6,0,0,1,1.67.5,9.775,9.775,0,0,1,2.958,1.657,10.633,10.633,0,0,1,.86.784q.207.211.408.436a13.291,13.291,0,0,1,1.138,1.489,18.244,18.244,0,0,1,1.332,2.413,18.154,18.154,0,0,1,1.309-2.425,13.345,13.345,0,0,1,1.124-1.5,10.887,10.887,0,0,1,1.256-1.232A9.766,9.766,0,0,1,32.6,20.951a8.706,8.706,0,0,1,3.435-.7l.824,0a9.017,9.017,0,0,1,2.736.4,8.661,8.661,0,0,1,2.339,1.134,9.462,9.462,0,0,1,3.231,3.894,9.866,9.866,0,0,1,.9,3.624c0,.014,0,.028,0,.042,0,.093.006.185.008.278,0,.06.005.12.006.181v.045"
              transform="translate(51.297 46.999)"
              fill="#fff"
          />
        </g>
      </svg>
    </router-link>{{ title }}</h2>
    <div class="content-modal-box">
      <h3 class="title">이거 꿈 아님 1화</h3>
      <div class="content-modal-text">
          “아무리 사소한 동기라도, 예상치 못한 방향으로 위대함을 낳기 마련이에요.”<br/>
          불가능을 향한 도전은 항상 지예를 두근거리게 했다.<br/>
          누군가는 그런 그녀를 비웃고, 또 어리석은 짓을 그만두라고 다그치기도 한다.<br/>
          하지만 그녀에게 있어 도전은 미래를 꿈꾸게 만드는 원동력이었으며, 실패는 마침표가 아닌 새로운 가능성으로 이어지는 쉼표였다.<br/>
          설령 팔꿈치 핥기와 같은 바보 같은 도전이라 할지라도, 불가능을 가능으로 바꾸려는 의지가 어떤 미래를 만들어낼지는 모르는 법.<br/>
          소녀는 오늘도 그런 믿음을 안고서 꿈을 꾼다.<br/>
          ***<br/>
          언제나처럼 점심시간의 사소한 잡담이 모든 일의 시작이었다. 그것도 정말 영양가라곤 1mg도 없는 사소한 이야기.<br/>
          “야. 니들 이거 봤어? 세상에서 딱 1%의 사람만 자기 팔꿈치에 혀가 닿는대.” 그 아이는 그렇게 말하며 친구들을 향해 자신의 핸드폰을 내밀었다.<br/>
          자기 팔꿈치를 핥으려고 애를 쓰는 사람들의 우스꽝스러운 모습의 영상.<br/>
          그것은 본 아이들은 호기심에 각자 한 번씩 따라 해보더니, 동시에 꺄르륵 웃음을 터트렸다. 자신들의 모습도 영락없이 영상 속 사람들처럼 바보 같기 그지없었다.<br/>
          “그런데 아무도 안 되잖아? 이거 원래 안되는 건데 그냥 구라치는 거 아냐?”<br/>
          “아닌데. 여기 되는 사람 영상도 있거든? 아무나 다 되면 괜히 1%만 된다고 하겠냐?” “야야. 나 어떡해! 어깨 쥐 내린 것 같애!”<br/>
          아이들에겐 그렇게 5분도 채 되지 않는 아주 잠깐의 여흥에 불과했던 이야기. 하지만 단 한 사람, 지예에게는 달랐다.<br/>
          그녀에게 있어 불가능이란 단어는, ‘한번 도전해봐!’라는 말과 다름없었다.<br/>
          “조… 조금만 더!”<br/>
          사실 조금만이라고 하기엔 아직도 너무나 먼 팔꿈치와 혀 사이의 거리.<br/>
          고개의 각도를 이리저리 바꿔가며 혼자 사투를 이어가고 있자, 한 친구가 이내 웃음을 터트리 며 그녀의 어깨를 톡톡 건드렸다.<br/>
          “야, 킴지. 원래 다들 안 되는 거라잖아? 너 그러다 팔 빠지겠다.”<br/>
          “아직 성공을 못 했을 뿐이지, 분명 다른 방법이 있을 거야!”<br/>
          쟤 또 저러네.<br/>
          친구들은 그런 지예를 보며 언제나처럼 고개를 절레절레 흔들며 피식 웃었다.<br/>
          하지만 친구들이 웃어도 상관없었다.<br/>
          지예에게 실패는 마침표가 아니라, 쉼표에 지나지 않으니까.<br/>
          ***<br/>
          “엄마, 집에 파스 없어?”<br/>
          안타깝게도 무모한 도전에는 늘 대가가 따라오는 법.<br/>
          친구의 경고가 어느 정도 적중하기라도 했는지.<br/>
          점심시간 내내 팔꿈치 핥기를 도전한 결과 목과 어깨에 담을 얻어버리고 말았다.<br/>
          그리고 그녀의 어머니는 학교에서 무슨 일이 있었는지 다 알고 있다는 듯. 딸을 바라보며 짧게 한숨을 내쉬며 미간을 찌푸렸다.<br/>
          “김지예, 너 또 이상한 짓 했지? 열 살짜리 살 애도 아니고 다 커서 뭐 하는 짓이야?”<br/>
          “칫! 엄마는 내가 뭐만 하면 이상한 짓이래.”<br/>
          객관적으로 보면 이상한 짓인 건 맞다.<br/>
          하지만 그 사실을 죽어도 인정하지 못하는 지예.<br/>
          그녀는 여느 때처럼 쏟아지는 엄마의 잔소리에 삐죽거리며, 열심히 서랍을 뒤졌다.<br/>
          어릴 때부터 엄마에게 가장 많이 들었던 말을 손꼽으라면.<br/>
          안돼. 하지 마. 넌 못해.<br/>
          이 세 가지가 아니었나 싶다.<br/>
          어쩌면 불가능에 대한 도전을 집착에 가까울 정도로 몰두하게 된 건, 그런 엄마에 대한 작은 반항심에서 시작했을지도 모르겠다.<br/>
          물론 엄마는 그런 지예만 보면 늘 화를 내기 일쑤였지만.<br/>
          ‘잘하는 걸 더 잘하게 노력해도 모자란 데. 왜 자꾸 실패할 일만 찾아서 하니? 니가 변태야?’<br/>
          엄마는 실패를 싫어한다.<br/>
          아니, 어쩌면 무서워한다는 표현이 맞을 것 같다.<br/>
          아무래도 엄마에겐 실패는 언제나 마침표인 모양이다.<br/>
          사소한 일이라도 실패를 용납하는 법이 없었다.<br/>
          애초에 식당에 가서도 처음 본 메뉴는 실패할까 봐 절대로 고르지 않는 사람이었으니까.<br/>
          ‘하지만 난 엄마와 달라!’<br/>
          지예는 서랍 구석에서 파스를 찾아내는 데에 성공한 뒤 두 주먹을 불끈 쥐었다. 언젠가는 꼭 팔꿈치 핥기를 멋지게 성공해 보이겠단 다짐과 함께.<br/>
          그것은 그저 꿈이라고 하기엔 너무나 생생한 경험이었다.<br/>
          어떤 영화에선 꿈속의 자신은 평행세계의 모습이라고 하던데, 그 말이 정말이었던 걸까? 물론 영화와 현실은 엄연히 다르겠지만.<br/>
         <br/>
          <div class="icon-planet">
              <img :src="imgUrl[0].src" alt="">
          </div>
          <br/>
          지예는 꿈속에서 한 줄기의 빛을 따라갔다.<br/>
          어느새 빛은 그녀를 스포트라이트처럼 비추고 있었고.<br/>
          빛 아래에 서 있는 그녀의 모습은 낯선 또 다른 자신이었다.<br/>
          “자아. 다음은 비둘기 자세예요. 의자에 오래 앉아있는 현대인의 골반에 정말 좋은 자세랍니다.”<br/>
          열댓 명의 사람들 앞에서 요가 자세를 취하고 있는 지예의 모습.<br/>
          어쩐지 어른스러운 느낌이었지만 그보다 중요한 건, 과연 자신이 맞나 싶을 정도로 온몸이 유연했다.<br/>
          “자아. 배꼽의 위치가 틀어지지 않게 조심하시고요.”<br/>
          지예는 먼저 자세의 시범을 보여준 뒤, 회원들의 자세를 하나하나 직접 짚어가며 지도했다. 그런 회원 중 몸이 유독 뻣뻣해 보이는 한 사람이, 오만상을 찌푸리며 자세를 제대로 잡지 못해 자꾸만 비틀거렸다.<br/>
          “아우. 전 선생님처럼 유연하지 않아서 안 될 것 같아요.”<br/>
          “정말 그럴까요?”<br/>
          안된다. 불가능하다.<br/>
          지예는 칭얼대는 회원에게 부드러운 미소 지으며 다가갔다.<br/>
          그리고 그녀는 지금의 자신을 있게 만든, 아주 사소한 계기를 떠올렸다.<br/>
          “옛날에 인터넷에서 유행했던 이야기인데 혹시 아세요? 세상에 단 1%의 사람만 자기 팔꿈 치를 핥을 수 있대요.”<br/>
          “네? 팔꿈치요?”<br/>
          “그런데 이것 봐요.”<br/>
          갑자기 웬 팔꿈치를 핥는다니 이상한 얘기를 꺼낸다 싶더니. 지예는 유연하게 어깨를 뒤로 접으며 팔꿈치를 가볍게 핥았다.<br/>
          지예의 회원은 어리둥절한 눈으로 그 모습을 빤히 바라봤다. 그래서 자긴 1%의 사람이라고 자랑하나?<br/>
          “실은 저 고등학교 때만 해도 이게 안 됐었거든요. 그것뿐이겠어요? 그 시절의 전 지금의 회원님보다 유연하지 않았을걸요?”<br/>
          “네? 정말로요?”<br/>
          “그러다 오기가 생겼어요.”<br/>
          여전히 영문을 모르겠다는 표정을 짓는 회원을 향해, 지예는 장난스럽게 웃었다.<br/>
          “팔꿈치를 핥아보겠단 집념 하나로, 유연해지기 위해 노력했고. 정신을 차려보니 지금 이렇게 됐더라고요.”<br/>
          최근 SNS의 인플루언서로도 이름난 요가강사 김지예.<br/>
          그녀가 요가를 시작하게 된 계기가 자기 팔꿈치 핥기였다니! 대체 누가 그런 걸 상상이나 해봤을까?<br/>
          아마 지금 이 꿈을 꾸는 지예 본인도 상상도 해본 적 없었을 이야기.<br/>
          어느덧 다시 한 줄기 빛이 스포트라이트처럼 지예를 비췄고.<br/>
          요가강사 김지예의 모습은 무대 너머로 사라지듯 점점 멀어지고 있었다.<br/>
          ‘잠깐만!’<br/>
          어쩌면 미래의 자기모습이었을지도 모를 그 광경. 지예는 다시 한번 빛을 쫓아 어둠 속을 달렸다.<br/>
         <br/>
         <br/>
          <div class="icon-planet">
              <img :src="imgUrl[1].src" alt="">
          </div>
         <br/>
          <br/>
          그리고 그녀에게 다시 스포트라이트가 찾아왔다. .<br/>
          지예는 주변을 둘러보았다.<br/>
          어느새 그녀를 둘러싸고 있는 카메라와 조명들.<br/>
          무대 스테이지 위에 마련된 자리에 앉아있던 그녀의 옆에는, 인터뷰를 진행 중인 리포터가 웃으며 말을 건네고 있었다.<br/>
          “그래서 이번 영화에서 인상 깊었던 장면 중 하나를 꼽으라면. 역시 그 씬이겠죠? 팔꿈치에 묻은 피를 혀로 핥는 그 모습이, 묘하게 징그러우면서도 관능적으로 느껴졌거든요.”<br/>
          “아하핫. 사실 그렇게까지 의도한 장면은 아니었는데.”<br/>
          “혹시 그 자세가 김지예 씨 개인기인가요? 저도 따라 해보려고 했는데 안 되더라고요.”<br/>
          “실은요.... 그거 CG였어요.”<br/>
          “네 진짜요? 헐, 전혀 예상 못 했는데요!”<br/>
          리포터는 진심으로 놀란 듯 눈과 입이 동그래졌다.<br/>
          물론 할리우드에서도 벼나 별걸 다 CG 처리해 버린단 얘기가 있지만, 국산 영화에서도 이런 일이 생기다니.<br/>
          조금은 유별난 이야기인지라, 점점 더 자세한 사연이 궁금해지는 이야기였다.<br/>
          “그래서 다들 묻더라고요. 대체 CG까지 써가면 그 장면을 고집한 이유가 뭐냐고요.”<br/>
          “제 말이요! 실례가 안 된다면, 그 이유 좀 들려주시겠나요?”<br/>
          알 수 없는 기대감 가득한 리포터의 눈빛을 마주 보며 지예는 싱긋 웃었다. 자신의 입으로 이런 얘기를 할 날이 오다니.<br/>
          “사실 그 장면 하나를 위해서 제가 배우 겸 감독이 된 거나 마찬가지거든요.”<br/>
          “네? 정말로요? 농담이 아니라요?”<br/>
          “네! 진짜로요!”<br/>
          리포터는 그 말에 반신반의하며 멍하니 눈을 깜박거렸다.<br/>
          “어릴 때 팔꿈치를 핥아보려 했는데 안 되더라고요. 제가 좀 고집이 있어서, 안되는 건 꼭 되게 만드는 버릇이 있는데. 하루는 영화를 보다가 그런 생각이 들더라고요. 아, 이걸 CG로 구현하면 되겠다!”<br/>
          “와! 설마 진짜로 그 생각 하나만으로 영화인의 길을 걷게 되신 건가요?”<br/>
          “물론 배우로 만족할 수도 있었는데. 뭔가 진짜가 아닌 CG다 보니, 그 장면 자체를 제 손으로 만들어야 더 의미가 있겠다 싶었어요. 그러다 보니 영화 연출에도 욕심을 내버렸죠!”<br/>
          유명 여배우 겸 영화감독의 상상도 못 한 정체!<br/>
          엉뚱하면서도 귀엽기도 한 그녀의 사연에 현장에 있던 사람들이 모두 미소를 짓고 있었다.<br/>
          그리고 어느새 그 모습을 삼인칭으로 보고 있던 지예도 마찬가지로.<br/>
          ‘앗! 설마 또!’<br/>
          그렇게 다시, 또 다른 자신의 모습이 밝은 빛 너머로 사라지고.<br/>
          빛줄기를 따라 계속 나아가자, 그 너머에 새로운 자신이 기다리고 있었다. .<br/>
         <br/>
         <br/>
          <div class="icon-planet">
              <img :src="imgUrl[2].src" alt="">
          </div>
         <br/>
          웅웅 거리는 기계음과 함께.<br/>
          용도를 알 수 없는 첨단기계들로 가득한 실험실의 풍경이 펼쳐져 있었다. 그리고 그 한가운데, 흰 가운을 걸치고 있는 또 다른 자신의 모습.<br/>
          “여러분. 오늘 인류는 또 한 번 미래를 향해 도약할 겁니다.”<br/>
          지예는 실험실 창문 너머에 모여있는 사람들을 향해, 자신감 있는 어조로 설명을 이어갔다.<br/>
          “음. 그렇네요. 시공간적 개념으로 보면, 정말로 미래 도약이라고 할 수도 있겠지요. 해석에 따라선 A 좌표에서 B 좌표로 이동하는 시간을 생략하고, 그렇게 미래의 결과를 현재로 불 러들인다...... 라고 볼 수도 있으니까요.”<br/>
          스스로 말하고도 놀라웠다.<br/>
          과연 그녀의 입에서 나온 게 맞나 싶을 정도로, 추상적이고 어려운 말들이 술술 나오고 있었 다.<br/>
          그리고 그 말에 창문 너머의 사람들은.<br/>
          다들 하나같이 감명받은 표정으로 고개를 연신 끄덕이고 있었다.<br/>
          “이런! 또 설명이 길어졌네요! 백문이 불여일견이라는 말도 있으니, 지금은 직접 보여드리는 게 순서겠죠.”<br/>
          일순간 청중의 시선이 지예에게로 집중됐다.<br/>
          그녀는 태블릿의 패널위로 손을 바쁘게 움직이며, 무언가를 작동시켰다. 이내 실험실의 장비들이 웅웅거리는 소리가 점차 커져갔고 이윽고 실험실 양측에 놓인 기계가 강력한 에너지를 뿜어내기 시작했다.<br/>
          “여러분께 소개합니다. 양자 터널링 장치. 소위 말하는 공간이동을 가능케 하는 꿈의 발명품 입니다.”<br/>
          지예의 소개와 함께 허공이 갈라지며 두 개의 틈새가 생겨났고. 그와 동시에 우레와 같은 박수가 쏟아졌다.<br/>
          SF 창작물에서나 볼 수 있을법한 말도 안 되는 발명이 이루어지는 순간을 목격한 몇몇 사 람들은, 감동을 주체하지 못하고 눈물까지 흘리고 있었다.<br/>
          그리고 지예가 포털을 통해 실험실 우측에서 왼쪽으로 다시 나타나는 시연을 직접 보이자. 다시 한번 갈채가 터져 나왔다.<br/>
          “물론 오늘 우리는 어디까지나 공간이동을 구현했다. 라는 정도에서 만족하고, 앞으로 더욱 실용성을 갖출 수 있는 연구를 해나가야 할 겁니다.”<br/>
          다만 현재로선 이 실험실에서 선보일 수 있는 정도가 전부. 공간이동이라곤 하나 이렇게 몇 미터 떨어진 거리가 고작이었다.<br/>
          “하지만 오늘이 위대한 첫걸음이란 사실은 부정할 수 없겠죠.”<br/>
          지예는 그렇게 얘기하면서 빙그르르 웃었다.<br/>
          지금의 그녀가 있을 수 있게 한 사소한 계기 하나를 떠올렸기 때문이었다.<br/>
          “물론 현재의 성과만으로도, 이 연구의 계기가 된 꿈은 충분히 이룰 수 있겠네요.”<br/>
          “저기 김지예 박사님! 그 꿈이란 게 대체 뭔가요!”<br/>
          위대한 발명을 이루게 한 꿈.<br/>
          그것은 분명 그 못지않게 위대한 것이리라 사람들은 믿어 의심치 않았다.<br/>
          하지만.<br/>
          “제 꿈 말이죠. 그건 바로 제 팔꿈치를 직접 핥는 거예요.”<br/>
          “예엣? 팔꿈치를요? 어떻게 그런 터무니없는 이유로 이런 세기의 발명을!”<br/>
          전혀 예상치 못한 뜬금없는 대답에, 모두 벙찐 얼굴로 멍하니 서 있었다. 혹시 그녀만의 농담이기라도 한 걸까?<br/>
          그러나 지예는 그게 농담이 아니란 걸 증명하듯, 포털의 위치를 조정하여 둘을 더 가깝게 붙 이고는 그 사이로 들어갔다.<br/>
         <br/>
          “애초에 계기는 어떤 것이냐가 중요하지 않아요. 아무리 사소한 동기라도, 예상치 못한 방향 으로 위대함을 낳기 마련이에요. 바로 이렇게요.”<br/>
          그 말을 남긴 위대한 발명가는 포탈 너머로 내민 자신의 팔꿈치를 할짝 핥으며 미소 지었다.<br/>
          어느덧 김지예 박사의 모습도 빛줄기와 함께 점점 멀어져 갔다.<br/>
          이번에는 빛줄기를 쫓는 대신 한 발짝 뒤로 물러나, 여태 쫓아온 그것들을 관망하듯이 바라보았다.<br/>
          그렇게 자신과 이어진 여러 갈래의 빛줄기를 보고 있는 지예의 눈동자는, 마치 무수한 별을 담고 있는 것처럼 반짝이고 있었다.<br/>
          “그래! 끝없이 도전하는 한 난 뭐든 될 수 있을 거야!”<br/>
          지예는 싱긋 웃으며 다시 한번 다짐했다.<br/>
          앞으로도 계속 포기하지 않고, 새로운 가능성으로 이어지는 쉼표를 찍어나갈 것을…<br/>
      </div>
      <div class="icon-planet1"></div>
      <div class="icon-planet2"></div>
      <div class="icon-planet3"></div>
      <div class="icon-planet4"></div>
      <div class="icon-planet5"></div>
      <div class="icon-planet6"></div>
    </div>
    <button
      type="button"
      class="modal-close"
      @click="$emit('update:visible', !showContentsModal)"
    >
      <span class="blind">닫기</span>
    </button>
  </div>
</template>

<script>
export default {
  name: "ContentsModal",
  emits: ["update:visible"],
  props: {
    showContentsModal: {
      type: Boolean,
      default: false,
    },
    title: {
      type: String,
      default: "",
    },
    content: {
      type: String,
      default: "",
    },

  },
    computed: {
        imgUrl() {
            return [
                {
                    src: require('@/assets/image/region2/icon_planet.png'),
                },
                {
                    src: require('@/assets/image/region2/icon_planet2.png'),
                },
                {
                    src: require('@/assets/image/region2/icon_planet3.png'),
                },
            ];
        },
    },
};
</script>

<style scoped>
.content-modal-box{
    overflow-x:hidden;
    overflow-y:auto;
    background: url('@/assets/image/region2/bg_planet.png');
    background-size: cover;
}

.icon-planet1{
  position: absolute;
  top: 250px;
  left:50%;
  width: 400px;
  height: 400px;
  margin-left: 650px;
  background: url('@/assets/image/region2/planet1.png') no-repeat 0 0;
  background-size: cover;
}
.icon-planet2{
  position: absolute;
  top: 4900px;
  left: 50%;
  width: 400px;
  height: 368px;
  margin-left: -1050px;
  background: url('@/assets/image/region2/planet2.png') no-repeat 0 0;
  background-size: cover;
}
.icon-planet3{
  position: absolute;
  top: 1000px;
  left:50%;
  width: 400px;
  height: 368px;
  margin-left: -1050px;
  background: url('@/assets/image/region2/planet3.png') no-repeat 0 0;
  background-size: cover;
}.icon-planet4{
   position: absolute;
   top: 3200px;
   left:50%;
   width: 400px;
   height: 400px;
   margin-left: 650px;
   background: url('@/assets/image/region2/planet4.png') no-repeat 0 0;
   background-size: cover;
 }

.icon-planet5{
  position: absolute;
  top: 7520px;
  left: 50%;
  width: 400px;
  height: 300px;
  margin-left: 528px;
  background: url('@/assets/image/region2/planet5.png') no-repeat 0 0;
  background-size: cover;
}
.icon-planet6{
  position: absolute;
  top: 9060px;
  left: 50%;
  width: 300px;
  height: 300px;
  margin-left: -520px;
  background: url('@/assets/image/region2/planet6.png') no-repeat 0 0;
  background-size: cover;
}
.content-modal-text{
  z-index: 5;
}
</style>
