<template>
  <div class="region-wrap">
    <div class="region-main region2">
      <h1 class="region-main-title">RAINBOW SHADOW</h1>
    </div>
    <div class="region-title-box">
      <p class="text">
        희망은 강한 힘을 가지고 있다.<br />
        물론 희망이 모든것을 이루는 마법을 가진 것은 아니다.<br />
        하지만, 당신이 간절히 희망하고 그 희망의 빛을 계속 가지고 간다면<br />
        당신이 원하는 것이 마치 마법처럼 이루어질 것이다.
      </p>
      <span class="writer">-Laini taylor-</span>
    </div>
    <div class="icon-star">
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="52.211"
        height="91.323"
        viewBox="0 0 52.211 91.323"
      >
        <path
          id="심볼1"
          d="M25.851,0l-1.93,40.474-3,3.029L0,45.889,21.134,48.06l2.845,2.814,2.381,40.45,1.93-40.474,2.995-3.029L52.21,45.435,31.076,43.264l-2.845-2.813Z"
          transform="translate(0 0)"
          fill="#fff"
        />
      </svg>
    </div>
    <div class="region-main-text">
      <p>
        나 하나로 시작되는 현실에서 답답함을 느꼇다면<br />
        페르소니아계는 다양한 모습을 찾고, 만날수 잇씁니다.
      </p>
      <p>
        새로운 세계 속 다양한 모습의 나<br />
        노래하는 가수이자, 춤추는 댄서<br />
        요리도 할 수 있으며, 운동선수도 가능한<br />
        작지만, 거대한 꿈 속 나의 모습
      </p>
      <p>
        내면 깊은 곳에 숨겨져 있던 또 다른 ‘나’를 펼쳐내는 순간<br />
        놀라운 ‘나’를 만날 수 있습니다.
      </p>
      <div class="icon2-star">
        <svg
          id="심볼2"
          xmlns="http://www.w3.org/2000/svg"
          width="14.203"
          height="23.594"
          viewBox="0 0 14.203 23.594"
        >
          <defs>
            <clipPath id="clip-path">
              <rect
                id="사각형_471"
                data-name="사각형 471"
                width="14.203"
                height="23.594"
                fill="none"
              />
            </clipPath>
          </defs>
          <g id="그룹_876" data-name="그룹 876" clip-path="url(#clip-path)">
            <path
              id="패스_445"
              data-name="패스 445"
              d="M4.641,11.882l5.459.561.735.727.615,10.449.5-10.455.774-.782,5.405-.616L12.669,11.2l-.735-.727L11.319.029l-.5,10.455-.774.782Z"
              transform="translate(-4.283 -0.026)"
              fill="none"
              stroke="#fff"
              stroke-miterlimit="10"
              stroke-width="1"
            />
          </g>
        </svg>
      </div>
    </div>
    <section class="region-content">
      <div class="region-content-image r2" @click="clickImage">
        <h3><span class="blind">페르소나</span></h3>
        <span class="text">멀티버스 은하계 가이드</span>
      </div>
    </section>
    <div class="icon-star">
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="52.211"
        height="91.323"
        viewBox="0 0 52.211 91.323"
      >
        <path
          id="심볼1"
          d="M25.851,0l-1.93,40.474-3,3.029L0,45.889,21.134,48.06l2.845,2.814,2.381,40.45,1.93-40.474,2.995-3.029L52.21,45.435,31.076,43.264l-2.845-2.813Z"
          transform="translate(0 0)"
          fill="#fff"
        />
      </svg>
    </div>
    <section class="region-content-more">
      <ul class="content-image-list">
        <li class="content-image-item" @click="showModal2 = true">
          <div class="image book1"></div>
        </li>
      </ul>
    </section>
    <div class="region-main-text">
      <p style="margin-bottom: 50px">페르소니아계 행성 01</p>
      <p>
        은하는 수십개가 모여 은하군을 이루고 수백 내지 수천 개의 은하가 모여
        은하단을 이룬다.<br />
        여러개의 다양한 행성이 모여 거대한 계를 이루고 있는 페르소니아계도
        마찬가지다.
      </p>
      <p>
        우주속 페르소니아계에서 첫번째로 발견 된 행성. ‘핑크페르소나’<br />
        지구와 같은 모습을 하고 있지만<br />
        이곳은 기아와 난민, 가난이 없는 풍요롭고 행복만이 가득한 곳이다.<br />
        지천에 널린 꽃과 나무, 그들이 만들어낸 산과 강<br />
        또 빛나는 별이 떨어진 바다가 있는 빛나는 행성.<br />
        손만 대면 어디든 생명을 불어 넣을 수 있는 초인적인 힘을 가진 신이 있는
        곳.
      </p>
      <p>
        핑크 페르소나의 중심부에는 풍부한 꿈의 혼합체가 있으며,<br />
        그것은 모든것을 끌어들이고 빨아들일 수 있다.<br />
        그 혼합체의 중심에는 육각형의 밝고 거대한 핵이 있다.<br />
        이 핵은 거대한 힘을 가지고 있다.<br />
        이것이 바로 핑크페르소나가 가진 유일한 힘 ‘핵사곤’이다.
      </p>
      <p>
        핵사곤은 사람들의 꿈을 모아 핑크페르소나 행성에 빛을 비추고 행복을
        유지할 수 있게 한다.<br />
        그 힘이 가진 무게를 아는 마미손은 핵사곤의 존재를 숨기며 지키려 하고,<br />
        그 힘을 손에 넣기 위한 마의손은 위험한 파괴의 계략을 꾸미기도 한다.<br />
        하지만 어떠한 외압에도 우주평화를 위해 핵사곤의 힘을 지키며<br />
        곧고 빛을 내고 있는 것이 바로’핑크페르소나’ 이다.
      </p>
      <div class="icon2-star">
        <svg
          id="심볼2"
          xmlns="http://www.w3.org/2000/svg"
          width="14.203"
          height="23.594"
          viewBox="0 0 14.203 23.594"
        >
          <defs>
            <clipPath id="clip-path">
              <rect
                id="사각형_471"
                data-name="사각형 471"
                width="14.203"
                height="23.594"
                fill="none"
              />
            </clipPath>
          </defs>
          <g id="그룹_876" data-name="그룹 876" clip-path="url(#clip-path)">
            <path
              id="패스_445"
              data-name="패스 445"
              d="M4.641,11.882l5.459.561.735.727.615,10.449.5-10.455.774-.782,5.405-.616L12.669,11.2l-.735-.727L11.319.029l-.5,10.455-.774.782Z"
              transform="translate(-4.283 -0.026)"
              fill="none"
              stroke="#fff"
              stroke-miterlimit="10"
              stroke-width="1"
            />
          </g>
        </svg>
      </div>
    </div>
    <section class="region-content">
      <div class="region-content-image r2_2">
        <h3><span class="blind">부캐전성시대</span></h3>
      </div>
    </section>

    <section class="region-content">
      <div class="region-content-image r2_3">
        <!--              <h3><span class="blind">부캐전성시대</span></h3>-->
      </div>
    </section>
  </div>

  <!-- 이미지 노출 -->
  <ModalImage v-model:visible="showModal" :imgUrl="imgUrl" />
  <ContentsModal
    :showContentsModal="showModal2"
    :title="'이거 꿈 아님 1화'"
    :content="contentText"
    v-model:visible="showModal2"
  />
</template>

<script>
import ModalImage from "@/components/modal/ModalImage";
import { reactive, toRefs } from "vue";
import ContentsModal from "@/components/region3/ContentsModal";
export default {
  name: "Region2",
  components: { ContentsModal, ModalImage },
  setup() {
    const state = reactive({
      showModal: false,
      showModal2: false,
      imgUrl: "",
      contentText:
        "“아무리 사소한 동기라도, 예상치 못한 방향으로 위대함을 낳기 마련이에요.”\n" +
        "불가능을 향한 도전은 항상 지예를 두근거리게 했다.\n" +
        "누군가는 그런 그녀를 비웃고, 또 어리석은 짓을 그만두라고 다그치기도 한다.\n" +
        "하지만 그녀에게 있어 도전은 미래를 꿈꾸게 만드는 원동력이었으며, 실패는 마침표가 아닌 새로운 가능성으로 이어지는 쉼표였다.\n" +
        "설령 팔꿈치 핥기와 같은 바보 같은 도전이라 할지라도, 불가능을 가능으로 바꾸려는 의지가 어떤 미래를 만들어낼지는 모르는 법.\n" +
        "소녀는 오늘도 그런 믿음을 안고서 꿈을 꾼다.\n" +
        "***\n" +
        "언제나처럼 점심시간의 사소한 잡담이 모든 일의 시작이었다. 그것도 정말 영양가라곤 1mg도 없는 사소한 이야기.\n" +
        "“야. 니들 이거 봤어? 세상에서 딱 1%의 사람만 자기 팔꿈치에 혀가 닿는대.” 그 아이는 그렇게 말하며 친구들을 향해 자신의 핸드폰을 내밀었다.\n" +
        "자기 팔꿈치를 핥으려고 애를 쓰는 사람들의 우스꽝스러운 모습의 영상.\n" +
        "그것은 본 아이들은 호기심에 각자 한 번씩 따라 해보더니, 동시에 꺄르륵 웃음을 터트렸다. 자신들의 모습도 영락없이 영상 속 사람들처럼 바보 같기 그지없었다.\n" +
        "“그런데 아무도 안 되잖아? 이거 원래 안되는 건데 그냥 구라치는 거 아냐?”\n" +
        "“아닌데. 여기 되는 사람 영상도 있거든? 아무나 다 되면 괜히 1%만 된다고 하겠냐?” “야야. 나 어떡해! 어깨 쥐 내린 것 같애!”\n" +
        "아이들에겐 그렇게 5분도 채 되지 않는 아주 잠깐의 여흥에 불과했던 이야기. 하지만 단 한 사람, 지예에게는 달랐다.\n" +
        "그녀에게 있어 불가능이란 단어는, ‘한번 도전해봐!’라는 말과 다름없었다. \n" +
        "“조… 조금만 더!”\n" +
        "사실 조금만이라고 하기엔 아직도 너무나 먼 팔꿈치와 혀 사이의 거리.\n" +
        "고개의 각도를 이리저리 바꿔가며 혼자 사투를 이어가고 있자, 한 친구가 이내 웃음을 터트리 며 그녀의 어깨를 톡톡 건드렸다.\n" +
        "“야, 킴지. 원래 다들 안 되는 거라잖아? 너 그러다 팔 빠지겠다.”\n" +
        "“아직 성공을 못 했을 뿐이지, 분명 다른 방법이 있을 거야!”\n" +
        "쟤 또 저러네.\n" +
        "친구들은 그런 지예를 보며 언제나처럼 고개를 절레절레 흔들며 피식 웃었다.\n" +
        "하지만 친구들이 웃어도 상관없었다.\n" +
        "지예에게 실패는 마침표가 아니라, 쉼표에 지나지 않으니까.\n" +
        "***\n" +
        "“엄마, 집에 파스 없어?”\n" +
        "안타깝게도 무모한 도전에는 늘 대가가 따라오는 법.\n" +
        "친구의 경고가 어느 정도 적중하기라도 했는지.\n" +
        "점심시간 내내 팔꿈치 핥기를 도전한 결과 목과 어깨에 담을 얻어버리고 말았다.\n" +
        "그리고 그녀의 어머니는 학교에서 무슨 일이 있었는지 다 알고 있다는 듯. 딸을 바라보며 짧게 한숨을 내쉬며 미간을 찌푸렸다.\n" +
        "“김지예, 너 또 이상한 짓 했지? 열 살짜리 살 애도 아니고 다 커서 뭐 하는 짓이야?” \n" +
        "“칫! 엄마는 내가 뭐만 하면 이상한 짓이래.”\n" +
        "객관적으로 보면 이상한 짓인 건 맞다.\n" +
        "하지만 그 사실을 죽어도 인정하지 못하는 지예.\n" +
        "그녀는 여느 때처럼 쏟아지는 엄마의 잔소리에 삐죽거리며, 열심히 서랍을 뒤졌다.\n" +
        "어릴 때부터 엄마에게 가장 많이 들었던 말을 손꼽으라면.\n" +
        "안돼. 하지 마. 넌 못해.\n" +
        "이 세 가지가 아니었나 싶다.\n" +
        "어쩌면 불가능에 대한 도전을 집착에 가까울 정도로 몰두하게 된 건, 그런 엄마에 대한 작은 반항심에서 시작했을지도 모르겠다.\n" +
        "물론 엄마는 그런 지예만 보면 늘 화를 내기 일쑤였지만.\n" +
        "‘잘하는 걸 더 잘하게 노력해도 모자란 데. 왜 자꾸 실패할 일만 찾아서 하니? 니가 변태야?’\n" +
        "엄마는 실패를 싫어한다.\n" +
        "아니, 어쩌면 무서워한다는 표현이 맞을 것 같다.\n" +
        "아무래도 엄마에겐 실패는 언제나 마침표인 모양이다.\n" +
        "사소한 일이라도 실패를 용납하는 법이 없었다.\n" +
        "애초에 식당에 가서도 처음 본 메뉴는 실패할까 봐 절대로 고르지 않는 사람이었으니까.\n" +
        "‘하지만 난 엄마와 달라!’\n" +
        "지예는 서랍 구석에서 파스를 찾아내는 데에 성공한 뒤 두 주먹을 불끈 쥐었다. 언젠가는 꼭 팔꿈치 핥기를 멋지게 성공해 보이겠단 다짐과 함께.\n" +
        "그것은 그저 꿈이라고 하기엔 너무나 생생한 경험이었다.\n" +
        "어떤 영화에선 꿈속의 자신은 평행세계의 모습이라고 하던데, 그 말이 정말이었던 걸까? 물론 영화와 현실은 엄연히 다르겠지만.\n" +
        "\n" +
        "\n" +
        "지예는 꿈속에서 한 줄기의 빛을 따라갔다.\n" +
        "어느새 빛은 그녀를 스포트라이트처럼 비추고 있었고.\n" +
        "빛 아래에 서 있는 그녀의 모습은 낯선 또 다른 자신이었다.\n" +
        "“자아. 다음은 비둘기 자세예요. 의자에 오래 앉아있는 현대인의 골반에 정말 좋은 자세랍니다.”\n" +
        "열댓 명의 사람들 앞에서 요가 자세를 취하고 있는 지예의 모습.\n" +
        "어쩐지 어른스러운 느낌이었지만 그보다 중요한 건, 과연 자신이 맞나 싶을 정도로 온몸이 유연했다.\n" +
        "“자아. 배꼽의 위치가 틀어지지 않게 조심하시고요.”\n" +
        "지예는 먼저 자세의 시범을 보여준 뒤, 회원들의 자세를 하나하나 직접 짚어가며 지도했다. 그런 회원 중 몸이 유독 뻣뻣해 보이는 한 사람이, 오만상을 찌푸리며 자세를 제대로 잡지 못해 자꾸만 비틀거렸다.\n" +
        "“아우. 전 선생님처럼 유연하지 않아서 안 될 것 같아요.”\n" +
        "“정말 그럴까요?”\n" +
        "안된다. 불가능하다.\n" +
        "지예는 칭얼대는 회원에게 부드러운 미소 지으며 다가갔다.\n" +
        "그리고 그녀는 지금의 자신을 있게 만든, 아주 사소한 계기를 떠올렸다.\n" +
        "“옛날에 인터넷에서 유행했던 이야기인데 혹시 아세요? 세상에 단 1%의 사람만 자기 팔꿈 치를 핥을 수 있대요.”\n" +
        "“네? 팔꿈치요?”\n" +
        "“그런데 이것 봐요.”\n" +
        "갑자기 웬 팔꿈치를 핥는다니 이상한 얘기를 꺼낸다 싶더니. 지예는 유연하게 어깨를 뒤로 접으며 팔꿈치를 가볍게 핥았다.\n" +
        "지예의 회원은 어리둥절한 눈으로 그 모습을 빤히 바라봤다. 그래서 자긴 1%의 사람이라고 자랑하나?\n" +
        "“실은 저 고등학교 때만 해도 이게 안 됐었거든요. 그것뿐이겠어요? 그 시절의 전 지금의 회원님보다 유연하지 않았을걸요?”\n" +
        "“네? 정말로요?”\n" +
        "“그러다 오기가 생겼어요.”\n" +
        "여전히 영문을 모르겠다는 표정을 짓는 회원을 향해, 지예는 장난스럽게 웃었다.\n" +
        "“팔꿈치를 핥아보겠단 집념 하나로, 유연해지기 위해 노력했고. 정신을 차려보니 지금 이렇게 됐더라고요.”\n" +
        "최근 SNS의 인플루언서로도 이름난 요가강사 김지예.\n" +
        "그녀가 요가를 시작하게 된 계기가 자기 팔꿈치 핥기였다니! 대체 누가 그런 걸 상상이나 해봤을까?\n" +
        "아마 지금 이 꿈을 꾸는 지예 본인도 상상도 해본 적 없었을 이야기.\n" +
        "어느덧 다시 한 줄기 빛이 스포트라이트처럼 지예를 비췄고.\n" +
        "요가강사 김지예의 모습은 무대 너머로 사라지듯 점점 멀어지고 있었다.\n" +
        "‘잠깐만!’\n" +
        "어쩌면 미래의 자기모습이었을지도 모를 그 광경. 지예는 다시 한번 빛을 쫓아 어둠 속을 달렸다.\n" +
        "\n" +
        "\n" +
        "\n" +
        "그리고 그녀에게 다시 스포트라이트가 찾아왔다. .\n" +
        "지예는 주변을 둘러보았다.\n" +
        "어느새 그녀를 둘러싸고 있는 카메라와 조명들.\n" +
        "무대 스테이지 위에 마련된 자리에 앉아있던 그녀의 옆에는, 인터뷰를 진행 중인 리포터가 웃으며 말을 건네고 있었다.\n" +
        "“그래서 이번 영화에서 인상 깊었던 장면 중 하나를 꼽으라면. 역시 그 씬이겠죠? 팔꿈치에 묻은 피를 혀로 핥는 그 모습이, 묘하게 징그러우면서도 관능적으로 느껴졌거든요.”\n" +
        "“아하핫. 사실 그렇게까지 의도한 장면은 아니었는데.”\n" +
        "“혹시 그 자세가 김지예 씨 개인기인가요? 저도 따라 해보려고 했는데 안 되더라고요.” \n" +
        "“실은요.... 그거 CG였어요.”\n" +
        "“네 진짜요? 헐, 전혀 예상 못 했는데요!” \n" +
        "리포터는 진심으로 놀란 듯 눈과 입이 동그래졌다.\n" +
        "물론 할리우드에서도 벼나 별걸 다 CG 처리해 버린단 얘기가 있지만, 국산 영화에서도 이런 일이 생기다니.\n" +
        "조금은 유별난 이야기인지라, 점점 더 자세한 사연이 궁금해지는 이야기였다.\n" +
        "“그래서 다들 묻더라고요. 대체 CG까지 써가면 그 장면을 고집한 이유가 뭐냐고요.” \n" +
        "“제 말이요! 실례가 안 된다면, 그 이유 좀 들려주시겠나요?”\n" +
        "알 수 없는 기대감 가득한 리포터의 눈빛을 마주 보며 지예는 싱긋 웃었다. 자신의 입으로 이런 얘기를 할 날이 오다니.\n" +
        "“사실 그 장면 하나를 위해서 제가 배우 겸 감독이 된 거나 마찬가지거든요.” \n" +
        "“네? 정말로요? 농담이 아니라요?”\n" +
        "“네! 진짜로요!”\n" +
        "리포터는 그 말에 반신반의하며 멍하니 눈을 깜박거렸다.\n" +
        "“어릴 때 팔꿈치를 핥아보려 했는데 안 되더라고요. 제가 좀 고집이 있어서, 안되는 건 꼭 되게 만드는 버릇이 있는데. 하루는 영화를 보다가 그런 생각이 들더라고요. 아, 이걸 CG로 구현하면 되겠다!”\n" +
        "“와! 설마 진짜로 그 생각 하나만으로 영화인의 길을 걷게 되신 건가요?”\n" +
        "“물론 배우로 만족할 수도 있었는데. 뭔가 진짜가 아닌 CG다 보니, 그 장면 자체를 제 손으로 만들어야 더 의미가 있겠다 싶었어요. 그러다 보니 영화 연출에도 욕심을 내버렸죠!”\n" +
        "유명 여배우 겸 영화감독의 상상도 못 한 정체!\n" +
        "엉뚱하면서도 귀엽기도 한 그녀의 사연에 현장에 있던 사람들이 모두 미소를 짓고 있었다.\n" +
        "그리고 어느새 그 모습을 삼인칭으로 보고 있던 지예도 마찬가지로. \n" +
        "‘앗! 설마 또!’\n" +
        "\n" +
        "\n" +
        "\n" +
        "그렇게 다시, 또 다른 자신의 모습이 밝은 빛 너머로 사라지고.\n" +
        "빛줄기를 따라 계속 나아가자, 그 너머에 새로운 자신이 기다리고 있었다. .\n" +
        "웅웅 거리는 기계음과 함께.\n" +
        "용도를 알 수 없는 첨단기계들로 가득한 실험실의 풍경이 펼쳐져 있었다. 그리고 그 한가운데, 흰 가운을 걸치고 있는 또 다른 자신의 모습.\n" +
        "“여러분. 오늘 인류는 또 한 번 미래를 향해 도약할 겁니다.”\n" +
        "지예는 실험실 창문 너머에 모여있는 사람들을 향해, 자신감 있는 어조로 설명을 이어갔다.\n" +
        "“음. 그렇네요. 시공간적 개념으로 보면, 정말로 미래 도약이라고 할 수도 있겠지요. 해석에 따라선 A 좌표에서 B 좌표로 이동하는 시간을 생략하고, 그렇게 미래의 결과를 현재로 불 러들인다...... 라고 볼 수도 있으니까요.”\n" +
        "스스로 말하고도 놀라웠다.\n" +
        "과연 그녀의 입에서 나온 게 맞나 싶을 정도로, 추상적이고 어려운 말들이 술술 나오고 있었 다.\n" +
        "그리고 그 말에 창문 너머의 사람들은.\n" +
        "다들 하나같이 감명받은 표정으로 고개를 연신 끄덕이고 있었다.\n" +
        "“이런! 또 설명이 길어졌네요! 백문이 불여일견이라는 말도 있으니, 지금은 직접 보여드리는 게 순서겠죠.”\n" +
        "일순간 청중의 시선이 지예에게로 집중됐다.\n" +
        "그녀는 태블릿의 패널위로 손을 바쁘게 움직이며, 무언가를 작동시켰다. 이내 실험실의 장비들이 웅웅거리는 소리가 점차 커져갔고 이윽고 실험실 양측에 놓인 기계가 강력한 에너지를 뿜어내기 시작했다.\n" +
        "“여러분께 소개합니다. 양자 터널링 장치. 소위 말하는 공간이동을 가능케 하는 꿈의 발명품 입니다.”\n" +
        "지예의 소개와 함께 허공이 갈라지며 두 개의 틈새가 생겨났고. 그와 동시에 우레와 같은 박수가 쏟아졌다.\n" +
        "SF 창작물에서나 볼 수 있을법한 말도 안 되는 발명이 이루어지는 순간을 목격한 몇몇 사 람들은, 감동을 주체하지 못하고 눈물까지 흘리고 있었다.\n" +
        "그리고 지예가 포털을 통해 실험실 우측에서 왼쪽으로 다시 나타나는 시연을 직접 보이자. 다시 한번 갈채가 터져 나왔다.\n" +
        "“물론 오늘 우리는 어디까지나 공간이동을 구현했다. 라는 정도에서 만족하고, 앞으로 더욱 실용성을 갖출 수 있는 연구를 해나가야 할 겁니다.”\n" +
        "다만 현재로선 이 실험실에서 선보일 수 있는 정도가 전부. 공간이동이라곤 하나 이렇게 몇 미터 떨어진 거리가 고작이었다.\n" +
        "“하지만 오늘이 위대한 첫걸음이란 사실은 부정할 수 없겠죠.”\n" +
        "지예는 그렇게 얘기하면서 빙그르르 웃었다.\n" +
        "지금의 그녀가 있을 수 있게 한 사소한 계기 하나를 떠올렸기 때문이었다.\n" +
        "“물론 현재의 성과만으로도, 이 연구의 계기가 된 꿈은 충분히 이룰 수 있겠네요.” \n" +
        "“저기 김지예 박사님! 그 꿈이란 게 대체 뭔가요!”\n" +
        "위대한 발명을 이루게 한 꿈.\n" +
        "그것은 분명 그 못지않게 위대한 것이리라 사람들은 믿어 의심치 않았다.\n" +
        "하지만.\n" +
        "“제 꿈 말이죠. 그건 바로 제 팔꿈치를 직접 핥는 거예요.”\n" +
        "“예엣? 팔꿈치를요? 어떻게 그런 터무니없는 이유로 이런 세기의 발명을!”\n" +
        "전혀 예상치 못한 뜬금없는 대답에, 모두 벙찐 얼굴로 멍하니 서 있었다. 혹시 그녀만의 농담이기라도 한 걸까?\n" +
        "그러나 지예는 그게 농담이 아니란 걸 증명하듯, 포털의 위치를 조정하여 둘을 더 가깝게 붙 이고는 그 사이로 들어갔다.\n" +
        "“애초에 계기는 어떤 것이냐가 중요하지 않아요. 아무리 사소한 동기라도, 예상치 못한 방향 으로 위대함을 낳기 마련이에요. 바로 이렇게요.”\n" +
        "그 말을 남긴 위대한 발명가는 포탈 너머로 내민 자신의 팔꿈치를 할짝 핥으며 미소 지었다.\n" +
        "어느덧 김지예 박사의 모습도 빛줄기와 함께 점점 멀어져 갔다.\n" +
        "이번에는 빛줄기를 쫓는 대신 한 발짝 뒤로 물러나, 여태 쫓아온 그것들을 관망하듯이 바라보았다.\n" +
        "그렇게 자신과 이어진 여러 갈래의 빛줄기를 보고 있는 지예의 눈동자는, 마치 무수한 별을 담고 있는 것처럼 반짝이고 있었다.\n" +
        "“그래! 끝없이 도전하는 한 난 뭐든 될 수 있을 거야!”\n" +
        "지예는 싱긋 웃으며 다시 한번 다짐했다.\n" +
        "앞으로도 계속 포기하지 않고, 새로운 가능성으로 이어지는 쉼표를 찍어나갈 것을…",
    });
    const clickImage = () => {
      state.showModal = true;
      state.imgUrl = require("@/assets/image/bg_r1_popup.png");
    };
    const clickImage2 = () => {
      state.showModal = true;
      state.imgUrl = require("@/assets/image/bg_r1_2_popup.png");
    };
    return {
      ...toRefs(state),
      clickImage,
      clickImage2,
    };
  },
};
</script>

<style scoped></style>
